Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Frequently asked questions
fr: Questions fréquemment posées

source: I forgot my DE Africa Sandbox password. How do I reset it?
fr: J’ai oublié mon mot de passe DE Africa Sandbox. Comment puis-je le réinitialiser ?

source: Visit the Sandbox homepage at https://sandbox.digitalearth.africa/hub/login and click **Login or Sign up**. Click **Forgot your password?** and follow the instructions to reset your password.
fr: Visitez la page d’accueil de Sandbox à https://sandbox.digitalearth.africa/hub/login et cliquez sur **Login or Sign up**. Cliquez sur **Forgot your password?** et suivez les instructions pour réinitialiser votre mot de passe.

source: I accidentally deleted a pre-loaded notebook in the Sandbox. How do I get it back?
fr: J’ai accidentellement supprimé un bloc-notes pré-chargé dans le Bac à sable. Comment puis-je le récupérer?

source: This should reload all default folders and notebooks for the DE Africa Sandbox. Note that this will **not** overwrite files that have been added, renamed, or modified. Additionally, this only applies to default pre-loaded files and will not restore personal notebooks that have been deleted.
fr: Cela devrait recharger tous les dossiers et ordinateurs portables par défaut pour le Bac à sable DE Africa. Notez que cela ne sera pas remplacer les fichiers qui ont été ajoutés, renommés ou modifiés. En outre, cela ne s’applique qu’aux fichiers préchargés par défaut et ne restaurera pas les blocs-notes personnels qui ont été supprimés.

source: Home
fr: Accueil

source: Lessons
fr: Leçons

source: Other information
fr: Autres informations

source: Digital Earth Africa Training
fr: Formation à Digital Earth Africa

source: Welcome to the Digital Earth Africa training course!
fr: Bienvenue au cours de formation de Digital Earth Africa !

source: This is a 6-week, self-paced online course. It should take around 2 hours per week to complete. Participants who successfully complete the course will receive a Certification of Completion at the end of training.
fr: Il s'agit d'un cours en ligne de 6 semaines, à rythme libre. Il devrait prendre environ 2 heures par semaine. Les participants qui réussissent le cours recevront un certificat de réussite à la fin de la formation.

source: To get started, watch the short introductory video below. Then click **Session 1: Introduction** to begin. Other sessions will be added as the course progresses.
fr: Pour commencer, regardez la courte vidéo d'introduction ci-dessous. Cliquez ensuite sur **Session 1 : Introduction** pour commencer. D'autres sessions seront ajoutées au fur et à mesure de la progression du cours.

source: Should you require help, see the :doc:`Frequently_asked_questions` and :doc:`Contact_us` pages.
fr: Si vous avez besoin d'aide, consultez les pages :doc:`Frequently_asked_questions` et :doc:`Contact_us`.

source: Latest Updates
fr: Dernières mises à jour

source: **20/11/2020:** The training material can be downloaded as a single PDF from the page `Download course content <./Download_course.ipynb>`_. Note videos and Sandbox access are not available offline.
fr: **20/11/2020:** Le matériel de formation peut être téléchargé en un seul PDF à partir de la page `Télécharger le contenu du cours <./Download_course.ipynb>`_. Notez que les vidéos et l'accès au Sandbox ne sont pas disponibles hors ligne.

source: **14/10/2020:** The `Session 1 quiz <./session_1/05_s1_quiz.ipynb>`_ has been added. This makes the quiz available to anyone who did not originally receive the link from the mailing list.
fr: **14/10/2020:** `Le quiz de la session 1 <./session_1/05_s1_quiz.ipynb>`_ a été ajouté. Le quiz est ainsi accessible à tous ceux qui n'ont pas reçu le lien de la liste de diffusion à l'origine.

source: **06/10/2020:** The `Session 6 quiz <./session_6/03_s6_solution.ipynb>`_ is live. Check your email for the link to the final feedback survey.
fr: **06/10/2020:** Le quiz de la `Session 6 <./session_6/03_s6_solution.ipynb>`_ est en direct. Vérifiez votre email pour le lien vers l'enquête finale.

source: **02/10/2020** `Course conclusion & wrap-up <./Course_wrap-up.ipynb>`_ has been added.
fr: **02/10/2020** `Course conclusion & wrap-up <./Course_wrap-up.ipynb>`_ a été ajouté.

source: **01/10/2020:** `Session 6: Water Analyses <./session_6/index.rst>`_ has been added.
fr: **01/10/2020:** `Session 6 : Analyses de l'eau <./session_6/index.rst>`_ a été ajoutée.

source: **29/09/2020:** The `Session 5 quiz <./session_5/03_s5_solution.ipynb>`_ is live.
fr: **29/09/2020:** Le quiz de la `Session 5 <./session_5/03_s5_solution.ipynb>`_ est en direct.

source: **24/09/2020:** `Session 5: Vegetation Analyses <./session_5/index.rst>`_ has been added.
fr: **24/09/2020:** `Session 5 : Analyses de la végétation <./session_5/index.rst>`_ a été ajoutée.

source: **22/09/2020:** The `Session 4 quiz <./session_4/04_s4_solution.ipynb>`_ is live.
fr: **22/09/2020:** Le quiz de la `Session 4 <./session_4/04_s4_solution.ipynb>`_ est en direct.

source: **17/09/2020:** `Session 4: Indices <./session_4/index.rst>`_ has been added.
fr: **17/09/2020:** `Session 4 : Indices <./session_4/index.rst>`_ a été ajouté.

source: **15/09/2020:** The `Session 3 quiz <./session_3/04_s3_solution.ipynb>`_ is live. Video slides are now available to download under each video.
fr: **15/09/2020:** Le quiz de la `Session 3 <./session_3/04_s3_solution.ipynb>`_ est en direct. Des diapositives sont maintenant disponibles au téléchargement sous chaque vidéo.

source: Contact us
fr: Nous contacter

source: Course conveners
fr: Animateurs de cours

source: **Edward Boamah** — Technical Manager
fr: **Edward Boamah** - Directeur technique

source: **Kenneth Mubea, PhD** — User Engagement Manager
fr: **Kenneth Mubea, PhD** - Responsable de l'engagement des utilisateurs

source: The course conveners can be contacted at training@digitalearthafrica.org.
fr: Les organisateurs du cours peuvent être contactés à training@digitalearthafrica.org.

source: Getting help
fr: Obtenir de l'aide

source: The **Digital Earth Africa FAQ** can be found at `Frequently asked questions <Frequently_asked_questions.ipynb>`__.
fr: La **FAQ de Digital Earth Africa** se trouve dans `Foire aux questions <Frequently_asked_questions.ipynb>`__.

source: An overview of the **Digital Earth Africa help documentation** can be found at `Help documentation <help_documentation.ipynb>`__.
fr: Un aperçu de la **documentation d'aide de Digital Earth Africa** est disponible dans `Documentation d'aide <help_documentation.ipynb>`__.

source: **Sandbox Notebooks:** The `Sandbox Notebooks <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks>`__ is a repository of help documentation and notebooks that cover common data analysis functions and questions. The files can be accessed without signing up.
fr: **Sandbox Notebooks:** Le `Sandbox Notebooks <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks>`__ est un référentiel de documentation d'aide et de blocs-notes qui couvrent les fonctions et questions courantes d'analyse des données. Les fichiers sont accessibles sans inscription.

source: **Slack:** Slack is a platform for team communication and information sharing. Sign up to the `Open Data Cube Slack <http://slack.opendatacube.org/>`__. You can then join the ``#de-africa-training`` channel by clicking the **+** next to the **Channels** list. It is a friendly environment where anyone can ask questions about course content.
fr: **Slack:** Slack est une plateforme de communication d'équipe et de partage d'informations. Inscrivez-vous au `Open Data Cube Slack <http://slack.opendatacube.org/>`__. Vous pouvez ensuite rejoindre le canal ``#de-africa-training`` en cliquant sur le **+** à côté de la liste **Canaux**. C'est un environnement convivial où tout le monde peut poser des questions sur le contenu du cours.

source: Course conclusion & wrap-up
fr: Conclusion du cours et récapitulation

source: Congratulations! You have reached the end of the Digital Earth Africa training course.
fr: Toutes nos félicitations! Vous avez atteint la fin de la formation Digital Earth Africa.

source: Over the six sessions, you have learnt how to
fr: Au cours des six séances, vous avez appris à

source: Run data analysis notebooks in the Digital Earth Africa Sandbox.
fr: Exécutez des cahiers d'analyse de données dans le bac à sable Digital Earth Africa.

source: Check data availability for an area of interest using the Digital Earth Africa Maps portal and Metadata Explorer.
fr: Vérifiez la disponibilité des données pour une zone d'intérêt à l'aide du portail Digital Earth Africa Maps et de Metadata Explorer.

source: Load Earth observation data from a variety of products, including Landsat 8 and Sentinel-2.
fr: Chargez les données d'observation de la Terre à partir d'une variété de produits, y compris Landsat 8 et Sentinel-2.

source: Recognise the importance of composite images in providing cloud-free scenes.
fr: Reconnaissez l'importance des images composites pour fournir des scènes sans nuage.

source: Understand band indices and their role in multi-spectral data analysis.
fr: Comprendre les indices de bande et leur rôle dans l'analyse des données multispectrales.

source: Select a suitable band index for analysis purposes.
fr: Sélectionnez un indice de bande approprié à des fins d'analyse.

source: Visualise data by plotting maps.
fr: Visualisez les données en traçant des cartes.

source: In the Sandbox, you are able to
fr: Dans le bac à sable, vous pouvez

source: Set up a notebook with common packages and functions.
fr: Configurez un ordinateur portable avec des packages et des fonctions communs.

source: Connect to the Open Data Cube to retrieve data.
fr: Connectez-vous au cube Open Data pour récupérer des données.

source: Load data both with and without cloud masking.
fr: Chargez des données avec et sans masquage cloud.

source: Create geomedian composites.
fr: Créez des composites géomédiens.

source: Calculate band indices such as NDVI.
fr: Calculez les indices de bande tels que NDVI.

source: Construct complete case studies based on vegetation or water indices.
fr: Construisez des études de cas complètes basées sur des indices de végétation ou d'eau.

source: This is a significant achievement. Well done!
fr: C'est une réalisation importante. Bien joué!

source: *A snapshot of some of the different plots you have created over the course of the six training sessions.*
fr: * Un aperçu de certaines des différentes parcelles que vous avez créées au cours des six sessions de formation. *

source: What next?
fr: Et ensuite?

source: You now have insight to Digital Earth Africa, and experience with the Sandbox. There are many ways you can take this further. To continue expanding your skills, here are some suggestions on exploring the platform capabilities and functions.
fr: Vous avez maintenant un aperçu de Digital Earth Africa et une expérience avec le bac à sable. Il existe de nombreuses façons d'aller plus loin. Pour continuer à développer vos compétences, voici quelques suggestions pour explorer les capacités et les fonctions de la plateforme.

source: Venturing outside of training material content means there is not always a solutions notebook available. Not to worry — if you run into any trouble or have any questions, you can continue to attend live sessions or contact the course convenors. There are always people ready to help!
fr: S'aventurer en dehors du contenu du matériel de formation signifie qu'il n'y a pas toujours de cahier de solutions disponible. Ne vous inquiétez pas - si vous rencontrez des problèmes ou avez des questions, vous pouvez continuer à assister aux sessions en direct ou contacter les organisateurs du cours. Il y a toujours des gens prêts à vous aider!

source: 1. Modify case studies for your area of interest
fr: 1. Modifiez les études de cas pour votre domaine d'intérêt

source: In Sessions 5 and 6, we built case studies looking at vegetation change with EVI, and water extent over time with Water Observations from Space (WOfS).
fr: Au cours des sessions 5 et 6, nous avons construit des études de cas portant sur le changement de végétation avec EVI et l'étendue de l'eau au fil du temps avec les observations de l'eau depuis l'espace (WOfS).

source: Make a copy of those notebooks and change the area of interest. You could investigate:
fr: Faites une copie de ces cahiers et modifiez la zone d'intérêt. Vous pourriez enquêter:

source: NDVI or EVI over an area of cropland in your country
fr: NDVI ou EVI sur une superficie de terres cultivées dans votre pays

source: Water extent fluctuations over dams or water catchments
fr: Fluctuations de l'étendue de l'eau sur les barrages ou les bassins versants

source: You can also try selecting a different index from the ``calculate_indices`` function. The full list of available indices can be viewed by accessing the **Scripts** folder in the Sandbox, and opening ``deafrica_bandindices.py``.
fr: Vous pouvez également essayer de sélectionner un autre index à partir de la fonction ``calculer_indices``. La liste complète des index disponibles peut être consultée en accédant au dossier **Scripts** dans le bac à sable et en ouvrant ``deafrica_bandindices.py``.

source: 2. Consolidate your Python knowledge using the Beginner’s Guide tutorials
fr: 2. Consolidez vos connaissances Python à l'aide des didacticiels du Guide du débutant

source: During the six sessions, we gradually introduced Python coding concepts with hands-on examples. If you would like to study the theory behind some of the functions and commands we used, have a look at the **Beginners_guide** folder in the Sandbox.
fr: Au cours des six sessions, nous avons progressivement introduit les concepts de codage Python avec des exemples pratiques. Si vous souhaitez étudier la théorie derrière certaines des fonctions et commandes que nous avons utilisées, jetez un œil au dossier **Beginners_guide** dans le bac à sable.

source: The **Beginners_guide** series of notebooks provide background information, code examples, and a range of applications. Some of this material will be familiar to you, but many of the notebooks contain extra details that can help solidify your understanding of the Sandbox mechanics.
fr: La série de blocs-notes **Beginners_guide** fournit des informations générales, des exemples de code et une gamme d'applications. Certains de ces documents vous seront familiers, mais de nombreux cahiers contiennent des détails supplémentaires qui peuvent vous aider à solidifier votre compréhension des mécanismes de Sandbox.

source: 3. Explore real world examples
fr: 3. Explorez des exemples du monde réel

source: The case studies we created in Sessions 5 and 6 were based off more complex analyses documented in the **Real_world_examples** folder of the Sandbox.
fr: Les études de cas que nous avons créées dans les sessions 5 et 6 étaient basées sur des analyses plus complexes documentées dans le dossier **Real_world_examples** du Sandbox.

source: These case studies often have a few more data processing steps than the exercises in the training course. After reviewing the Beginner’s Guide contents, these steps should be more accessible and easy to understand.
fr: Ces études de cas comportent souvent quelques étapes de traitement des données de plus que les exercices du cours de formation. Après avoir examiné le contenu du guide du débutant, ces étapes devraient être plus accessibles et faciles à comprendre.

source: Use the real world example notebooks to inspire your analysis and improve your data processing technique.
fr: Utilisez les exemples de cahiers du monde réel pour inspirer votre analyse et améliorer votre technique de traitement des données.

source: 4. Advance your analysis with code snippets
fr: 4. Faites progresser votre analyse avec des extraits de code

source: Real world examples are great for generating ideas and providing examples of case study structure. However, when you are writing your own case studies, you may find code snippets in the **Frequently_used_code** folder even more helpful.
fr: Les exemples du monde réel sont parfaits pour générer des idées et fournir des exemples de structure d'étude de cas. Toutefois, lorsque vous rédigez vos propres études de cas, vous pouvez trouver des extraits de code dans le dossier **Frequent_used_code** encore plus utiles.

source: The **Frequently_used_code** folder contains a series of notebooks demonstrating code doing useful and common functions. This includes plotting boundary or contour lines, exporting files, incorporating external datasets and masking data. They can be easily adapted into your own notebooks.
fr: Le dossier **Frequent_used_code** contient une série de blocs-notes présentant du code exécutant des fonctions utiles et courantes. Cela comprend le traçage de lignes de contour ou de courbes de niveau, l'exportation de fichiers, l'incorporation de jeux de données externes et le masquage des données. Ils peuvent être facilement adaptés dans vos propres cahiers.

source: Keep in contact
fr: Rester en contact

source: Thank you for joining us to explore Digital Earth Africa. We hope you found the training course helpful and informative.
fr: Merci de vous joindre à nous pour explorer Digital Earth Africa. Nous espérons que vous avez trouvé la formation utile et informative.

source: If you have any questions or feedback on the Digital Earth Africa training course, don’t hesitate to `contact the course convenors or access the community knowledge bank on Slack <./Contact_us.ipynb>`__.
fr: Si vous avez des questions ou des commentaires sur le cours de formation Digital Earth Africa, n’hésitez pas à `contacter les organisateurs du cours ou à accéder à la banque de connaissances de la communauté sur Slack <./ Contact_us.ipynb>`__.

source: We are always keen to see what our users have created — feel free to share your results by tagging us on Twitter at `#DigitalEarthAfrica <https://twitter.com/DEarthAfrica>`__.
fr: Nous sommes toujours impatients de voir ce que nos utilisateurs ont créé - n'hésitez pas à partager vos résultats en nous taguant sur Twitter à `#DigitalEarthAfrica <https://twitter.com/DEarthAfrica>`__.

source: Download course content
fr: Télécharger le contenu du cours

source: The DE Africa Training Course can be downloaded as a PDF. This can be used as an offline resource, although we encourage following along with exercises online on the `DE Africa Sandbox <https://sandbox.digitalearth.africa/>`__ when possible.
fr: Le cours de formation DE Africa peut être téléchargé au format PDF. Cela peut être utilisé comme une ressource hors ligne, bien que nous vous encourageons à suivre des exercices en ligne sur le `DE Africa Sandbox <https://sandbox.digitalearth.africa/>`__ lorsque cela est possible.

source: `Click here to download the PDF of course content (29 MB) <./_static/other_information/training-digitalearthafrica-org-en-latest_20112020.pdf>`__
fr: `Cliquez ici pour télécharger le PDF du contenu du cours (29 Mo) <./_static/other_information/training-digitalearthafrica-org-en-latest_20112020.pdf>`__

source: The PDF only contains text and images. Videos and tutorials will not be accessible or interactive through the PDF. Please check this page regularly to download the most up-to-date version of the training material.
fr: Le PDF ne contient que du texte et des images. Les vidéos et les didacticiels ne seront ni accessibles ni interactifs via le PDF. Veuillez consulter cette page régulièrement pour télécharger la version la plus récente du matériel de formation.

source: You can also generate the latest PDF version of the training material by following the `FAQ on downloading course content <./Frequently_asked_questions.ipynb>`__.
fr: Vous pouvez également générer la dernière version PDF du matériel de formation en suivant la `FAQ sur le téléchargement du contenu du cours <./ Frequently_asked_questions.ipynb>`__.

source: The DE Africa Sandbox session automatically loads several folders of default notebooks. If you have accidentally deleted any of the folders or notebooks, they can be restored by restarting the server.
fr: La session DE Africa Sandbox charge automatiquement plusieurs dossiers de blocs-notes par défaut. Si vous avez accidentellement supprimé l'un des dossiers ou blocs-notes, ils peuvent être restaurés en redémarrant le serveur.

source: Save any open working files.
fr: Enregistrez tous les fichiers de travail ouverts.

source: Select **File -> Hub Control Panel**. This will open a new tab.
fr: Sélectionnez **File -> Hub Control Panel**. Cela ouvrira un nouvel onglet.

source: On the new tab, select **Stop My Server**. The server will take a few minutes to stop.
fr: Dans le nouvel onglet, sélectionnez **Stop My Server**. Le serveur prendra quelques minutes pour s'arrêter.

source: When the server has stopped, the buttons will refresh. Select **Start My Server**.
fr: Une fois le serveur arrêté, les boutons s'actualiseront. Sélectionnez **Start My Server**.

source: Select **Launch Server** and **Start**.
fr: Sélectionnez **Launch Server** et **Start**.

source: I have fallen behind on course content. Can I still complete the course?
fr: J'ai pris du retard sur le contenu des cours. Puis-je quand même terminer le cours?

source: Yes. It is recommended to spend 2 hours a week on new content. This will allow you to build on the previous week’s content and finish the training course in around 6 weeks. However, this training course is self-paced, so there is no cut-off date for access. You are encouraged and welcome to spend more time on the course as necessary.
fr: Oui. Il est recommandé de passer 2 heures par semaine sur du nouveau contenu. Cela vous permettra de vous appuyer sur le contenu de la semaine précédente et de terminer la formation en environ 6 semaines. Cependant, ce cours de formation est auto-rythmé, il n'y a donc pas de date limite d'accès. Vous êtes encouragé et invité à passer plus de temps sur le cours si nécessaire.

source: Certification will be evaluated by submissions to the course conveners, so it is possible to obtain certification even if the course takes you longer than 6 weeks to complete.
fr: La certification sera évaluée par des soumissions aux organisateurs du cours, il est donc possible d'obtenir une certification même si le cours vous prend plus de 6 semaines.

source: If you need help with the content or have course feedback, see the `Contact us <Contact_us.ipynb>`__ page for support channels and convener contact information.
fr: Si vous avez besoin d'aide avec le contenu ou si vous avez des commentaires sur le cours, consultez la page `Contactez-nous <Contact_us.ipynb>`__ pour les canaux d'assistance et les coordonnées des organisateurs.

source: How do I download an offline copy of course material?
fr: Comment télécharger une copie hors ligne du matériel de cours?

source: The Digital Earth Africa training course material can be downloaded as a PDF for offline reading or printing. The PDF contains all text and images, but does not embed videos. As content may be updated, it is recommended you download a new copy every 1 – 2 weeks.
fr: Le matériel du cours de formation Digital Earth Africa peut être téléchargé au format PDF pour lecture ou impression hors ligne. Le PDF contient tout le texte et les images, mais n'intègre pas de vidéos. Comme le contenu peut être mis à jour, il est recommandé de télécharger une nouvelle copie toutes les 1 à 2 semaines.

source: Go to the Digital Earth Africa training homepage at https://training.digitalearthafrica.org/en/latest/index.html.
fr: Accédez à la page d'accueil de la formation Digital Earth Africa à l'adresse https://training.digitalearthafrica.org/en/latest/index.html.
