Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: You can also use all of the features of the workbench on the data you have loaded as well.
fr: Vous pouvez également utiliser toutes les fonctionnalités de l'atelier sur les données que vous avez chargées.

source: To share a view of your data with others, you must first publish it to the web somewhere with a URL, and then load it from there.
fr: Pour partager une vue de vos données avec d'autres personnes, vous devez d'abord les publier sur le Web quelque part avec une URL, puis les charger à partir de là.

source: DE Africa Map can display two kinds of spreadsheets:
fr: DE Africa Map peut afficher deux types de feuilles de calcul:

source: Spreadsheets with a point location (latitude and longitude) for each row, expressed as two columns: lat and lon. These will be displayed as points (circles).
fr: Feuilles de calcul avec un emplacement de point (latitude et longitude) pour chaque ligne, exprimé sous forme de deux colonnes: lat et lon. Ceux-ci seront affichés sous forme de points (cercles).

source: Spreadsheets where each row refers to a region such as a local government area (council), state, postcode, or ABS statistical unit such as an SA2 or CED (Commonwealth Electoral Division). Columns must be named according to the CSV-geo-au standard. These will be displayed as regions, highlighting the actual shape of each area.
fr: Feuilles de calcul où chaque ligne se réfère à une région telle qu'une zone de gouvernement local (conseil), un état, un code postal ou une unité statistique ABS telle qu'un SA2 ou un CED (Commonwealth Electoral Division). Les colonnes doivent être nommées selon la norme CSV-geo-au. Celles-ci seront affichées sous forme de régions, mettant en évidence la forme réelle de chaque zone.

source: Spreadsheets must be saved as CSV (comma-separated values).
fr: Les feuilles de calcul doivent être enregistrées au format CSV (valeurs séparées par des virgules).

source: Other standard spatial data types such as GeoJSON and KML are also supported.
fr: D'autres types de données spatiales standard tels que GeoJSON et KML sont également pris en charge.

source: |Upload Location|
fr: | Télécharger l'emplacement |

source: Understanding geomedians: 1 pixel, 3 timesteps
fr: Comprendre les géomédiens: 1 pixel, 3 pas de temps

source: When we want to make a single image that represents a period of time from satellite data, we use a method known as compositing. This notebook will help you to experiement with two similar (but subtly different) compositing methods, known as the ``median`` and ``geomedian``.
fr: Lorsque nous voulons créer une image unique qui représente une période de temps à partir de données satellites, nous utilisons une méthode appelée composition. Ce cahier vous aidera à expérimenter deux méthodes de composition similaires (mais subtilement différentes), connues sous le nom de ``médiane`` et de ``géomédian``.

source: In this example, you have a dataset of Earth observation satellite data. It contains the red, green, and blue bands, which are used to generate colour images. We will focus on a single pixel that has data for 3 different timesteps. We can composite (combine) these 3 timesteps into one using a statistical composition method such as ``median`` or ``geomedian``.
fr: Dans cet exemple, vous disposez d'un ensemble de données de données satellitaires d'observation de la Terre. Il contient les bandes rouge, verte et bleue, qui sont utilisées pour générer des images couleur. Nous nous concentrerons sur un seul pixel contenant des données pour 3 pas de temps différents. Nous pouvons composer (combiner) ces 3 pas temporels en un seul en utilisant une méthode de composition statistique telle que ``médiane`` ou ``géomédiane``.

source: **Note**: To run the app and experiment with different pixel colours, follow the instructions in the **Interactive app** section. To view a pre-run example and learn more about geomedians and medians, see the **Pre-run example** section.
fr: **Remarque**: pour exécuter l'application et tester différentes couleurs de pixels, suivez les instructions de la section **Application interactive**. Pour afficher un exemple de pré-exécution et en savoir plus sur les géomédians et les médianes, consultez la section **Exemple de pré-exécution**.

source: Interactive app
fr: Application interactive

source: To run this notebook, go to the main menu bar and select ``Run`` -> ``Restart Kernel and Run All Cells...``. Click ``Restart``. The notebook may take a few minutes to finish computing. You will know it is complete when you see the app appear (it will look like the example in the next session, but you will be able to move the sliders).
fr: Pour exécuter ce notebook, allez dans la barre de menu principale et sélectionnez ``Run`` -> ``Restart Kernel and Run All Cells...``. Cliquez sur ``Restart``. L'ordinateur portable peut prendre quelques minutes pour terminer le calcul. Vous saurez qu'elle est terminée lorsque vous verrez apparaître l'application (elle ressemblera à l'exemple de la prochaine session, mais vous pourrez déplacer les curseurs).

source: Use the sliders to change the colour of the pixels at each timestep. Observe how this impacts the median and geomedian results.
fr: Utilisez les curseurs pour changer la couleur des pixels à chaque pas de temps. Observez comment cela affecte les résultats médians et géomédians.

source: **Note**: The RGB colour model uses values from 0 – 255. This is the range that has been used here. Spectral datasets are scaled to fit this range.
fr: **Remarque**: Le modèle de couleur RVB utilise des valeurs comprises entre 0 et 255. Il s'agit de la plage qui a été utilisée ici. Les ensembles de données spectrales sont mis à l'échelle pour s'adapter à cette plage.

source: **Note**: The widget code is hidden by the ``...`` symbol above. Clicking on it will expand the code cell. Click on the vertical blue line next to the left of the cell to collapse it again.
fr: **Remarque**: Le code du widget est masqué par le symbole ``...`` ci-dessus. Cliquez dessus pour développer la cellule de code. Cliquez sur la ligne bleue verticale à côté de la gauche de la cellule pour la réduire à nouveau.

source: Pre-run example
fr: Exemple de pré-exécution

source: The geomedian is regarded as the better composition method as it accounts for the multi-dimensional relationship between the satellite spectral bands. This is evident in the example below. One timestep is shows a black pixel, one a white pixel, and one a fully saturated green pixel.
fr: Le géomédian est considéré comme la meilleure méthode de composition car il tient compte de la relation multidimensionnelle entre les bandes spectrales du satellite. Cela est évident dans l'exemple ci-dessous. Un pas de temps montre un pixel noir, un un pixel blanc et un un pixel vert entièrement saturé.

source: *The image above is an example of a dataset where the median and geomedian are different. Note this is a static image, not a widget.*
fr: * L'image ci-dessus est un exemple d'un jeu de données où la médiane et le géomédian sont différents. Notez qu'il s'agit d'une image statique, pas d'un widget. *

source: Interpreting the example
fr: Interpréter l'exemple

source: The median can be determined for each band by finding the middle value over the three time steps. In the above example, for the three timesteps, the red band has the values (``0``, ``0``, ``255``). When arranged in order of increasing value, we find that the value ``0`` occupies the middle space of the three numbers, hence the median for the red band is 0. For each of the bands:
fr: La médiane peut être déterminée pour chaque bande en trouvant la valeur médiane sur les trois pas de temps. Dans l'exemple ci-dessus, pour les trois pas de temps, la bande rouge a les valeurs (``0``, ``0``, ``255``). Lorsqu'elle est disposée par ordre de valeur croissante, nous constatons que la valeur ``0`` occupe l'espace du milieu des trois nombres, donc la médiane de la bande rouge est 0. Pour chacune des bandes:

source: The median of the red band is ``median(0, 0, 255) = 0``.
fr: La médiane de la bande rouge est ``median(0, 0, 255) = 0``.

source: The median of the green band is ``median(0, 255, 255) = 255``.
fr: La médiane de la bande verte est ``median(0, 255, 255) = 255``.

source: The median of the blue band is ``median(0, 0, 255) = 0``.
fr: La médiane de la bande bleue est ``median(0, 0, 255) = 0``.

source: Thus the median RGB value for all timesteps is ``(0, 255, 0)``, with the corresponding colour shown in the **Median RGB - All timesteps** pixel. Note that the median RGB value is the same as the green pixel (``Timestep 2``).
fr: Ainsi, la valeur RVB médiane pour tous les pas de temps est ``(0, 255, 0)``, avec la couleur correspondante affichée dans le pixel **Median RGB - All timesteps**. Notez que la valeur RVB médiane est la même que le pixel vert (`` Timestep 2``).

source: The problem with the median
fr: Le problème de la médiane

source: This example shows that the median does **not** account for the fact that one of the ``red`` values and one of the ``blue`` values are very large (255). Likewise, one of the ``green`` values is very small (0). We find that the median comes out to the same value as ``Timestep 2``, which is not particularly representative of the variation we see in the three timesteps.
fr: Cet exemple montre que la médiane ne tient **pas** compte du fait que l'une des valeurs ``red`` et l'une des valeurs ``blue`` sont très grandes (255). De même, l'une des valeurs ``green`` est très petite (0). Nous constatons que la médiane a la même valeur que ``Timestep 2``, ce qui n'est pas particulièrement représentatif de la variation que nous voyons dans les trois pas de temps.

source: The variation is better incorporated into the ``Geomedian RGB - All timesteps`` result, as the geomedian formula treats each timestep as a multi-dimensional vector. We see this results in differing values between the median and geomedian.
fr: La variation est mieux intégrée dans le résultat ``Geomedian RGB - All timesteps``, car la formule géomédiane traite chaque pas temporel comme un vecteur multidimensionnel. Nous voyons que cela se traduit par des valeurs différentes entre la médiane et le géomédian.

source: Further exploration
fr: Exploration plus approfondie

source: If there is only one spectral dimension (e.g. only the red band), the median and geomedian can still be different. You can try this for yourself by setting all ``Green`` and ``Blue`` sliders to ``0``. Can you create a case where the red median and red geomedian are different?
fr: S'il n'y a qu'une seule dimension spectrale (par exemple seulement la bande rouge), la médiane et le géomédian peuvent encore être différents. Vous pouvez essayer cela par vous-même en réglant tous les curseurs ``Green`` et ``Blue ``sur ``0``. Pouvez-vous créer un cas où la médiane rouge et le géomédian rouge sont différents?

source: Session 2 Solution - Loading data exercise
fr: Solution Session 2 - Exercice de chargement de données

source: Set up notebook
fr: Configurer le notebook

source: Load packages and functions
fr: Charger des packages et des fonctions

source: Connect to the datacube
fr: Connectez-vous au datacube

source: Load Landsat 8 data
fr: Charger les données Landsat 8

source: Set area of interest and view on map
fr: Définir la zone d'intérêt et afficher sur la carte

source: Load Landsat data
fr: Charger les données Landsat

source: Examine Landsat data
fr: Examiner les données Landsat

source: Plot a true-colour image of Landsat data
fr: Tracez une image en couleurs vraies des données Landsat

source: Repeat load exercise for Sentinel-2
fr: Répétez l'exercice de chargement pour Sentinel-2

source: Load Sentinel-2 data
fr: Charger les données Sentinel-2

source: Examine Sentinel-2 data
fr: Examiner les données Sentinel-2

source: Plot a true-colour image of Sentinel-2 data
fr: Tracez une image en couleurs vraies des données Sentinel-2

source: Session 3 Solution - Cloud mask and geomedian composite exercises
fr: Solution Session 3 - Masque de nuage et exercices composites géomédiens

source: Plot timesteps
fr: Tracer les pas temporels

source: Plot a true-colour image for the first timestep
fr: Tracez une image en couleurs vraies pour le premier pas de temps

source: Plot a true-colour image for all timesteps
fr: Tracez une image en couleurs vraies pour tous les pas de temps

source: *The cloud mask exercise ends here. The geomedian composite exercise continues from this point.*
fr: * L'exercice du masque de nuage se termine ici. L'exercice composite géomédien se poursuit à partir de ce point. *

source: Check dataset
fr: Vérifier l'ensemble de données

source: Calculate geomedian
fr: Calculer le géomédian

source: Plot true-colour geomedian image
fr: Tracer une image géomédienne en couleurs vraies

source: Session 4 Solution - Calculate NDVI Part 1 Exercise
fr: Solution de la session 4 - Calculer le NDVI, partie 1, exercice

source: Running the notebook
fr: Lancer le notebook

source: Set up
fr: Installer

source: Load the data
fr: Chargez les données

source: In the following cell, we set ``x`` and ``y`` equal to pairs indicating the longitude and latitude extents of our region of interest, and then display a map showing the region.
fr: Dans la cellule suivante, nous définissons ``x`` et ``y`` égaux aux paires indiquant les étendues de longitude et de latitude de notre région d'intérêt, puis affichons une carte montrant la région.

source: Here we load data via the ``load_ard`` function. We specify the instance of the datacube (``dc``), the product that we wish to load (``s2_l2a`` for Sentinel-2), the extents of our query (in ``x``, ``y``, and ``time``), the list of bands to fetch (``['red' ,'green', 'blue']``), the spatial resolution of our data (10 meters), and we group nearby results by solar day.
fr: Ici, nous chargeons les données via la fonction ``load_ard``. On spécifie l'instance du datacube (``dc``), le produit que l'on souhaite charger (``s2_l2a`` pour Sentinel-2), les étendues de notre requête (en ``x``, ``y``, et ``time``), la liste des bandes à récupérer (`` ['red', 'green', 'blue'] ``), la résolution spatiale de nos données (10 mètres), et nous regrouper les résultats à proximité par jour solaire.

source: Note we named the variables ``x`` and ``y`` in the cell above, so we do not need to type the longitude/latitude pairs again. We can just call upon ``x`` and ``y`` as shown below.
fr: Notez que nous avons nommé les variables ``x`` et ``y`` dans la cellule ci-dessus, nous n'avons donc pas besoin de taper à nouveau les paires longitude / latitude. Nous pouvons simplement appeler ``x`` et ``y`` comme indiqué ci-dessous.

source: Here we create a list of time slices to plot, and store it as the variable ``timesteps``. The values in the list are indices into the list of satellite acquisitions, starting at zero. The values here, ``[1, 6, 8]``, therefore refer to the second, seventh, and ninth acquisitions. There should be 71 acquisitions for this particular dataset/extent combination, so any values from 0 to 70 can be used.
fr: Ici, nous créons une liste de tranches de temps à tracer, et la stockons comme variable ``timesteps ``. Les valeurs de la liste sont des indices dans la liste des acquisitions de satellites, commençant à zéro. Les valeurs ici, ``[1, 6, 8]``, se réfèrent donc aux deuxième, septième et neuvième acquisitions. Il devrait y avoir 71 acquisitions pour cette combinaison d'ensemble de données / étendue particulière, de sorte que toutes les valeurs de 0 à 70 puissent être utilisées.

source: We then call the ``rgb`` function to produce a series of plots from the data that we loaded, using the bands that we specify (``['red', 'green', 'blue']``), for the time indices stored in ``timesteps``.
fr: Nous appelons ensuite la fonction ``rgb`` pour produire une série de tracés à partir des données que nous avons chargées, en utilisant les bandes que nous spécifions (`` ['red', 'green', 'blue'] ``), pour les indices de temps stockés dans les ``timesteps``.

source: Resampling the dataset
fr: Rééchantillonner l'ensemble de données

source: Here we create a new variable (``resample_sentinel_2_ds``) which describes a grouping of the data we previously loaded (``sentinel_2_ds``), divided into 3-month (quarterly) intervals.
fr: Ici, nous créons une nouvelle variable (`` resample_sentinel_2_ds``) qui décrit un regroupement des données que nous avons précédemment chargées (`` sentinel_2_ds``), divisées en intervalles de 3 mois (trimestriels).

source: Compute the geomedian
fr: Calculer le géomédian

source: Below, we take the data which we just split into quarterly intervals, and we apply the ``xr_geomedian`` function to each interval. We store the result into the ``geomedian_resample`` variable.
fr: Ci-dessous, nous prenons les données que nous venons de diviser en intervalles trimestriels, et nous appliquons la fonction ``xr_geomedian`` à chaque intervalle. Nous stockons le résultat dans la variable ``geomedian_resample``.

source: Comparing the two datasets
fr: Comparaison des deux ensembles de données

source: In the next two cells, we simply print our datasets to screen. The first cell contains the data that we originally loaded from the Open Data Cube, and the second cell contains the data after resampling it into quarterly geomedian composites. Note that the first dataset contains many more time slices than the second.
fr: Dans les deux cellules suivantes, nous imprimons simplement nos ensembles de données à l'écran. La première cellule contient les données que nous avons initialement chargées à partir du cube de données ouvertes et la deuxième cellule contient les données après leur rééchantillonnage en composites géomédiens trimestriels. Notez que le premier ensemble de données contient beaucoup plus de tranches de temps que le second.

source: Session 4 Solution - Calculate NDVI Part 2 Exercise
fr: Solution de la session 4 - Calculer le NDVI, partie 2, exercice

source: Open and run notebook
fr: Ouvrir et exécuter le notebook

source: In the following cell, we set x and y equal to “tuples” (pairs) indicating the longitude and latitude extents of our region of interest, and then display a map showing the region.
fr: Dans la cellule suivante, nous définissons x et y égaux à «tuples» (paires) indiquant les étendues de longitude et de latitude de notre région d'intérêt, puis affichons une carte montrant la région.

source: Making changes to the load cell
fr: Apporter des modifications à la cellule de pesée

source: Adding nir measurement
fr: Ajout de la mesure nir

source: Here we load data via the ``load_ard`` function. We specify the instance of the datacube (``dc``), the product that we wish to load (``s2_l2a`` for Sentinel-2), the extents of our query (in x, y, and time), the list of bands to fetch (``['red' ,'green', 'blue', 'nir']``), the spatial resolution of our data (20 meters), and we group nearby results by solar day.
fr: Ici, nous chargeons les données via la fonction ``load_ard``. Nous spécifions l'instance du datacube (`` dc``), le produit que nous souhaitons charger (`` s2_l2a`` pour Sentinel-2), les étendues de notre requête (en x, y et en temps), le liste des bandes à récupérer (`` ['red', 'green', 'blue', 'nir'] ``), la résolution spatiale de nos données (20 mètres), et nous regroupons les résultats à proximité par jour solaire.

source: Manually calculate an index
fr: Calculer manuellement un index

source: Calculate NDVI
fr: Calculer le NDVI

source: In the following cell, we compute NDVI values from our resampled data using the formula:
fr: Dans la cellule suivante, nous calculons les valeurs NDVI à partir de nos données rééchantillonnées à l'aide de la formule:

source: NDVI = \frac{(NIR - Red) }{ (NIR + Red)}
fr: NDVI = \ frac {(NIR - Rouge)} {(NIR + Rouge)}

source: To keep our code tidy, we create variables ``nir`` and ``red`` and set them to equal ``geomedian_resample.nir`` and ``geomedian_resample.red`` respectively.
fr: Pour garder notre code bien rangé, nous créons les variables ``nir`` et ``red`` et les définissons sur respectivement ``geomedian_resample.nir`` et ``geomedian_resample.red``.

source: Plot NDVI for each geomedian
fr: Tracez le NDVI pour chaque géomédian

source: Here we call the ``plot`` function on our NDVI data, which gives us an image for each quarterly interval.
fr: Ici, nous appelons la fonction ``plot`` sur nos données NDVI, qui nous donne une image pour chaque intervalle trimestriel.

source: Plot time series of the NDVI area
fr: Tracer des séries chronologiques de la zone NDVI

source: The following cell generates a plot of the mean NDVI over time. Note that we specify the dimensions along which to take the mean (``dim=['x', 'y']``). It is important that we omitted the ``time`` dimension — if we had included it, our mean would collapse the data along *every* dimension, returning only a single value (the mean value in x, y, *and* time).
fr: La cellule suivante génère un graphique du NDVI moyen au fil du temps. Notez que nous spécifions les dimensions selon lesquelles prendre la moyenne (`` dim = ['x', 'y'] ``). Il est important que nous ayons omis la dimension ``time`` - si nous l'avions incluse, notre moyenne réduirait les données le long de * chaque * dimension, ne renvoyant qu'une seule valeur (la valeur moyenne en x, y, * et * temps ).

source: Finally, we decorate the plot from the previous cell by adding a title and a label for our Y axis.
fr: Enfin, nous décorons le tracé de la cellule précédente en ajoutant un titre et une étiquette pour notre axe Y.

source: Exercise: Vegetation change detection
fr: Exercice: détection des changements de végétation

source: Note that we have imported one new function for this exercise in the cell above: ``calculate indices``.
fr: Notez que nous avons importé une nouvelle fonction pour cet exercice dans la cellule ci-dessus: ``calculate indices``.

source: We create a new connection to the Open Data Cube, and store it as the variable ``dc``.
fr: Nous créons une nouvelle connexion à l'Open Data Cube et la stockons en tant que variable ``dc``.

source: For this exercise, we will select our area of interest by picking a centre point and specifying a ``buffer`` of space (in degrees) on all sides of it. We also create a variable called ``time_baseline`` which specifies a time in the middle of our date range which will be used to split the data into two groups later.
fr: Pour cet exercice, nous sélectionnerons notre zone d'intérêt en choisissant un point central et en spécifiant un ``buffer`` d'espace (en degrés) sur tous ses côtés. Nous créons également une variable appelée ``time_baseline`` qui spécifie une heure au milieu de notre plage de dates qui sera utilisée pour diviser les données en deux groupes plus tard.

source: We use the ``display_map`` function to visualize the extents which will be loaded.
fr: Nous utilisons la fonction ``display_map`` pour visualiser les étendues qui seront chargées.

source: Load data
fr: Charger des données

source: In the following cell, we use the ``load_ard`` function to request data from the Open Data Cube, and we store it into the ``landsat_ds`` variable. Loading the data will take a moment, but we should end up with 46 time steps.
fr: Dans la cellule suivante, nous utilisons la fonction ``load_ard`` pour demander des données à l'Open Data Cube, et nous les stockons dans la variable ``landsat_ds``. Le chargement des données prendra un moment, mais nous devrions nous retrouver avec 46 pas de temps.

source: Calculate Indices
fr: Calculer les indices
