Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Scroll to the bottom of the page and click **v: latest** to expand the menu.
fr: Faites défiler vers le bas de la page et cliquez sur **v: latest** pour développer le menu.

source: |Latest|
fr: | Dernières |

source: Select **PDF**. This will generate a PDF of the training website. Click **Save** or **Download** to save a copy to your computer.
fr: Sélectionnez **PDF**. Cela générera un PDF du site Web de formation. Cliquez sur **Enregistrer** ou **Télécharger** pour enregistrer une copie sur votre ordinateur.

source: Note Sandbox access requires an internet connection. You will not be able to complete Sandbox exercises offline.
fr: Remarque L'accès au bac à sable nécessite une connexion Internet. Vous ne pourrez pas terminer les exercices Sandbox hors ligne.

source: PDFs can be viewed using `Adobe Acrobat Reader DC <https://get.adobe.com/reader/>`__, which can be downloaded for free.
fr: Les fichiers PDF peuvent être consultés à l'aide de `Adobe Acrobat Reader DC <https://get.adobe.com/reader/>`__, qui peut être téléchargé gratuitement.

source: My kernel has crashed. What do I do?
fr: Mon noyau est tombé en panne. Que fais-je?

source: The Digital Earth Africa Sandbox has a finite amount of processing power allocated to each user. This means if you attempt to load or calculate a lot of data, the kernel may crash. You will see a message like this:
fr: Le bac à sable Digital Earth Africa dispose d'une puissance de traitement limitée allouée à chaque utilisateur. Cela signifie que si vous essayez de charger ou de calculer beaucoup de données, le noyau peut planter. Vous verrez un message comme celui-ci:

source: |Kernel error|
fr: | Erreur de noyau |

source: You will not lose any files, but will have to rerun your notebook to continue working. However, if the notebook is still demanding too many resources, it will crash again.
fr: Vous ne perdrez aucun fichier, mais devrez réexécuter votre notebook pour continuer à travailler. Cependant, si le portable demande encore trop de ressources, il se plantera à nouveau.

source: You can prevent kernel crashes by:
fr: Vous pouvez éviter les plantages du noyau en:

source: Decreasing the area selected for data processing
fr: Diminuer la zone sélectionnée pour le traitement des données

source: Shortening the time extent
fr: Raccourcir la durée

source: Shutting down kernels of notebooks you have finished using: open the notebook and select **Kernel -> Shut Down Kernel**
fr: Arrêter les noyaux des notebooks que vous avez fini d'utiliser: ouvrez le notebook et sélectionnez **Kernel -> Shut Down Kernel**

source: These actions reduce the memory load of your computation on the Sandbox.
fr: Ces actions réduisent la charge mémoire de votre calcul sur le bac à sable.

source: I am having Sandbox registration problems. What do I do?
fr: J'ai des problèmes d'enregistrement Sandbox. Que fais-je?

source: If you have specific Sandbox issues, please send an email to training@digitalearthafrica.org. These may include:
fr: Si vous rencontrez des problèmes spécifiques avec Sandbox, veuillez envoyer un e-mail à training@digitalearthafrica.org. Ceux-ci peuvent inclure:

source: Cannot register with the Sandbox
fr: Impossible de s'inscrire au Sandbox

source: Entered the wrong credentials during registration
fr: Vous avez entré les mauvaises informations d'identification lors de l'inscription

source: Need to change your email address
fr: Besoin de changer votre adresse e-mail

source: If you have forgotten your Sandbox password, please see `I forgot my DE Africa Sandbox password. How do I reset it? <#I-forgot-my-DE-Africa-Sandbox-password.-How-do-I-reset-it?>`__
fr: Si vous avez oublié votre mot de passe Sandbox, veuillez consulter `J'ai oublié mon mot de passe DE Africa Sandbox. Comment le réinitialiser? <#I-forgot-my-DE-Africa-Sandbox-password.-How-do-I-reset-it?>`__

source: If you have experienced a Sandbox kernel crash or kernel restart error message, please see `My kernel has crashed. What do I do? <#My-kernel-has-crashed.-What-do-I-do?>`__
fr: Si vous avez rencontré un crash du noyau Sandbox ou un message d'erreur de redémarrage du noyau, veuillez consulter `Mon noyau est tombé en panne. Que fais-je? <#My-kernel-has-crashed.-What-do-I-do?>`__

source: How do I join the Slack channel?
fr: Comment rejoindre la chaîne Slack?

source: Digital Earth Africa uses Slack as a communications platform for asking questions and general discussion. It is free to join.
fr: Digital Earth Africa utilise Slack comme plateforme de communication pour poser des questions et une discussion générale. C'est gratuit de rejoindre.

source: Go to http://slack.opendatacube.org/. If you do not have a Slack account, enter your email address to receive an invitation to sign up and log in. If you are already a Slack member, follow the prompts to log in.
fr: Allez sur http://slack.opendatacube.org/. Si vous n'avez pas de compte Slack, saisissez votre adresse e-mail pour recevoir une invitation à vous inscrire et à vous connecter. Si vous êtes déjà membre Slack, suivez les instructions pour vous connecter.

source: |ODC slack invite page|
fr: | Page d'invitation ODC slack |

source: Open Slack. Select the **+** button next to **Channels** and click **Browse channels**.
fr: Ouvrez Slack. Sélectionnez le bouton **+** à côté de **Chaînes** et cliquez sur **Parcourir les chaînes**.

source: |Add channels button|
fr: | Bouton Ajouter des chaînes |

source: |Browse channels button|
fr: | Bouton Parcourir les chaînes |

source: Hover over the channel called ``#de-africa-training`` and click **Join**.
fr: Survolez la chaîne intitulée ``#de-africa-training`` et cliquez sur **Rejoindre**.

source: |Join channel|
fr: | Rejoindre la chaîne |

source: Geomedian widget
fr: Widget Geomedian

source: Geomedian composites are introduced in `Session 3 <./session_3/01_intro_composites.ipynb>`__. Geomedians are a method of combining multiple timesteps of data into one image.
fr: Les composites géomédiens sont introduits dans `Session 3 <./session_3/01_intro_composites.ipynb>`__. Les géomédiens sont une méthode de combinaison de plusieurs pas de temps de données en une seule image.

source: Geomedians were defined as follows:
fr: Les géomédiens ont été définis comme suit:

source: A geomedian composite finds the median values of the bands for each pixel when considered **together**. This means they represent the data **better** than median composites.
fr: Un composite géomédian trouve les valeurs médianes des bandes pour chaque pixel lorsqu'ils sont considérés **ensemble**. Cela signifie qu'ils représentent les données **mieux** que les composites médians.

source: This gives rise to a few common questions.
fr: Cela soulève quelques questions courantes.

source: What does it mean to **consider the bands together**?
fr: Que signifie **considérer les groupes ensemble**?

source: What might that look like?
fr: À quoi cela peut-il ressembler?

source: How does it affect the colour of each pixel in my final composite image?
fr: Comment cela affecte-t-il la couleur de chaque pixel de mon image composite finale?

source: To explore the answers to these questions, we can use an interactive module known as a **widget**. Instead of looking at one whole image, the widget focuses on a single pixel.
fr: Pour explorer les réponses à ces questions, nous pouvons utiliser un module interactif appelé **widget**. Au lieu de regarder une image entière, le widget se concentre sur un seul pixel.

source: The geomedian widget gives three timesteps of data. You can click on the sliders to change the data for each timestep, which affects the pixel colour. In turn, this will impact the computation of the median and geomedian. As you will see, they are not always the same!
fr: Le widget geomedian donne trois pas temporels de données. Vous pouvez cliquer sur les curseurs pour modifier les données de chaque pas de temps, ce qui affecte la couleur des pixels. À son tour, cela aura un impact sur le calcul de la médiane et du géomédian. Comme vous le verrez, ils ne sont pas toujours les mêmes!

source: *An example of what the geomedian widget looks like. To interact with the widget, download and run the geomedian widget notebook.*
fr: * Un exemple de ce à quoi ressemble le widget geomedian. Pour interagir avec le widget, téléchargez et exécutez le bloc-notes du widget Geomedian. *

source: Follow the instructions below to download the widget notebook. It can help with understanding the following concepts:
fr: Suivez les instructions ci-dessous pour télécharger le bloc-notes de widgets. Cela peut aider à comprendre les concepts suivants:

source: In which cases are the median and geomedian very similar or the same?
fr: Dans quels cas la médiane et la géomédiane sont-elles très similaires ou identiques?

source: In which cases are the median and geomedian very different?
fr: Dans quels cas la médiane et la géomédiane sont-elles très différentes?

source: Why are geomedians more representative of the whole dataset, compared to medians?
fr: Pourquoi les géomédians sont-ils plus représentatifs de l'ensemble de données que les médianes?

source: Download geomedian widget notebook
fr: Télécharger le bloc-notes du widget Geomedian

source: `Download the geomedian widget notebook <./_static/other_information/Geomedian_interactive_extend1.ipynb>`__
fr: `Téléchargez le bloc-notes du widget Geomedian <./_static/other_information/Geomedian_interactive_extend1.ipynb>`__

source: To view this notebook on the Sandbox, you will need to first download it to your computer, then upload it to the Sandbox. Follow these instructions:
fr: Pour afficher ce bloc-notes sur le bac à sable, vous devez d'abord le télécharger sur votre ordinateur, puis le télécharger dans le bac à sable. Suivez ces instructions:

source: Download the notebook by clicking the link above.
fr: Téléchargez le cahier en cliquant sur le lien ci-dessus.

source: On the Sandbox, open the **Training** folder.
fr: Sur le bac à sable, ouvrez le dossier **Training**.

source: Click the **Upload Files** button as shown below.
fr: Cliquez sur le bouton **Télécharger les fichiers** comme indiqué ci-dessous.

source: Select the downloaded notebook using the file browser. Click **OK**.
fr: Sélectionnez le notebook téléchargé à l'aide du navigateur de fichiers. Cliquez sur OK**.

source: The solution notebook will appear in the **Training** folder. Double-click to open it.
fr: Le bloc-notes de solution apparaîtra dans le dossier **Training**. Double-cliquez pour l'ouvrir.

source: License information
fr: Informations sur la licence

source: Digital Earth Africa data and training material is licensed under the `Creative Commons by Attribution 4.0 <https://creativecommons.org/licenses/by/4.0/>`__ license.
fr: Les données et le matériel de formation de Digital Earth Africa sont sous la licence `Creative Commons by Attribution 4.0 <https://creativecommons.org/licenses/by/4.0/>`__.

source: The code featured in this site is licensed under the `Apache License, Version 2.0 <https://www.apache.org/licenses/LICENSE-2.0>`__.
fr: Le code présenté sur ce site est concédé sous la licence `Apache License, Version 2.0 <https://www.apache.org/licenses/LICENSE-2.0>`__.

source: Map portal user guide
fr: Guide de l'utilisateur du portail cartographique

source: This guide provides detailed instructions on how to use the different features of the Digital Earth Africa Map portal at https://maps.digitalearth.africa/.
fr: Ce guide fournit des instructions détaillées sur la façon d'utiliser les différentes fonctionnalités du portail Digital Earth Africa Map à l'adresse https://maps.digitalearth.africa/.

source: Get Started
fr: Commencer

source: To launch the DE Africa Map and display some basic data follow these steps.
fr: Pour lancer la DE Africa Map et afficher des données de base, procédez comme suit.

source: Launch the DE Africa Map at `maps.digitalearth.africa <https://maps.digitalearth.africa/>`__.
fr: Lancez la DE Africa Map sur `maps.digitalearth.africa <https://maps.digitalearth.africa/>`__.

source: In the left panel click the **Add Data** button to open the data catalogue (see image below).
fr: Dans le panneau de gauche, cliquez sur le bouton **Add Data** pour ouvrir le catalogue de données (voir l'image ci-dessous).

source: Find a dataset of interest such as water.
fr: Trouvez un ensemble de données d'intérêt tel que l'eau.

source: Select the dataset to see a preview of that data and description.
fr: Sélectionnez l'ensemble de données pour afficher un aperçu de ces données et de cette description.

source: To view your selected dataset on the map, click the **Add to the map** button.
fr: Pour afficher votre jeu de données sélectionné sur la carte, cliquez sur le bouton **Add to the map**.

source: Visualise and analyse your dataset:
fr: Visualisez et analysez votre ensemble de données:

source: The spatial data will be displayed in the map view, and a visual legend will appear in the Data workbench, on the left side of the page.
fr: Les données spatiales seront affichées dans la vue de la carte et une légende visuelle apparaîtra dans l'atelier de données, sur le côté gauche de la page.

source: It may not be immediately obvious where your selected spatial data has loaded on the map if it does not cover a large part of Africa. To locate loaded data on the map, go to the workbench, and select **Zoom to extent**.
fr: Il peut ne pas être immédiatement évident où vos données spatiales sélectionnées ont été chargées sur la carte si elles ne couvrent pas une grande partie de l'Afrique. Pour localiser les données chargées sur la carte, accédez à l'atelier et sélectionnez **Zoom to extent**.

source: The dataset should now be visible in the map view.
fr: L'ensemble de données doit maintenant être visible dans la vue de la carte.

source: To add additional datasets to the map, repeat the above steps.
fr: Pour ajouter des jeux de données supplémentaires à la carte, répétez les étapes ci-dessus.

source: Zoom manually by moving your mouse pointer over the map and using your mouse wheel to zoom in or out further.
fr: Zoomez manuellement en déplaçant le pointeur de votre souris sur la carte et en utilisant la molette de votre souris pour effectuer un zoom avant ou arrière.

source: Click and drag the map to further show the region in which you are interested.
fr: Cliquez et faites glisser la carte pour afficher davantage la région qui vous intéresse.

source: Explore the workbench
fr: Explorez l'établi

source: When a dataset is added to the map via the data catalogue, a legend for that dataset will appear in the workbench. From the workbench you can:
fr: Lorsqu'un jeu de données est ajouté à la carte via le catalogue de données, une légende pour ce jeu de données apparaît dans l'atelier. Depuis le plan de travail, vous pouvez:

source: Set the order data is shown on the map. To do this, click the title of a dataset and drag it to a new position in your workbench.
fr: Définir les données de commande sont affichées sur la carte. Pour ce faire, cliquez sur le titre d'un jeu de données et faites-le glisser vers une nouvelle position dans votre atelier.

source: Toggle the visibility of added datasets by selecting the checkbox opposite your prefered dataset title
fr: Basculez la visibilité des ensembles de données ajoutés en cochant la case en regard du titre de votre ensemble de données préféré

source: Zoom to the geographical extent of an added data set
fr: Zoomez sur l'étendue géographique d'un ensemble de données ajouté

source: Set the opacity of individual data sets
fr: Définir l'opacité des ensembles de données individuels

source: Remove data sets from the map. Note: they can be re-added via the data catalogue.
fr: Supprimez les ensembles de données de la carte. Remarque: ils peuvent être rajoutés via le catalogue de données.

source: Navigate the Map
fr: Naviguer sur la carte

source: There are multiple ways to navigate DE Africa Map’s map view:
fr: Il existe plusieurs façons de naviguer dans la vue cartographique de DE Africa Map:

source: Zooming
fr: Zoomer

source: Move your mouse pointer over the map and use the scroll wheel to zoom in or out. The location at the centre of the map display is the centre of the zooming. Right-click and drag upwards or downwards over the map to zoom about the centre point. Select the zoom control to zoom in or out quickly by a set amount.
fr: Déplacez le pointeur de votre souris sur la carte et utilisez la molette de défilement pour effectuer un zoom avant ou arrière. L'emplacement au centre de l'affichage de la carte est le centre du zoom. Cliquez avec le bouton droit de la souris et faites glisser vers le haut ou vers le bas sur la carte pour zoomer sur le point central. Sélectionnez la commande de zoom pour effectuer un zoom avant ou arrière rapidement d'une valeur définie.

source: Panning
fr: Panoramique

source: Click anywhere on the map and drag it to the required location.
fr: Cliquez n'importe où sur la carte et faites-la glisser vers l'emplacement souhaité.

source: Rotate the map
fr: Faire pivoter la carte

source: Use the compass control to rotate the map so North is no longer at the top. Select the “gyroscope” in the centre of the compass control and drag slowly to the left or right to rotate the map clockwise or anti-clockwise respectively. The further you drag, the faster it rotates. Release the mouse button when you reach the desired rotation.
fr: Utilisez la commande de la boussole pour faire pivoter la carte afin que le nord ne soit plus en haut. Sélectionnez le «gyroscope» au centre de la commande de la boussole et faites-le glisser lentement vers la gauche ou la droite pour faire pivoter la carte respectivement dans le sens horaire ou anti-horaire. Plus vous faites glisser loin, plus la rotation est rapide. Relâchez le bouton de la souris lorsque vous atteignez la rotation souhaitée.

source: Select the North Point or outer ring of the Compass Control and drag it around to set the desired rotation directly.
fr: Sélectionnez le point nord ou l'anneau extérieur de la commande de la boussole et faites-le glisser pour définir directement la rotation souhaitée.

source: Control + left-click and drag left or right over the map to rotate the view about the centre.
fr: Ctrl + clic gauche et glisser vers la gauche ou la droite sur la carte pour faire pivoter la vue autour du centre.

source: Perspective view
fr: Vue de perspective

source: Select the “gyroscope” in the centre of the compass control and drag slowly upwards to tilt the view into a perspective view. Drag downwards to tilt the view back to vertical. The further you drag, the faster it tilts. Release the mouse button when you reach the desired view.
fr: Sélectionnez le «gyroscope» au centre de la commande de la boussole et faites glisser lentement vers le haut pour incliner la vue dans une vue en perspective. Faites glisser vers le bas pour ramener la vue à la verticale. Plus vous tirez loin, plus il s'incline rapidement. Relâchez le bouton de la souris lorsque vous atteignez la vue souhaitée.

source: Control + left-click and drag upwards or downwards over the map to enter or adjust the perspective view.
fr: Ctrl + clic gauche et glisser vers le haut ou vers le bas sur la carte pour entrer ou ajuster la vue en perspective.

source: When you are in perspective view, control + left-click and drag left or right over the map to “orbit” around the centre of the view. You can also click and drag left or right over the “gyroscope” at the centre of the Compass Control to orbit about the centre of the view.
fr: Lorsque vous êtes en vue en perspective, appuyez sur Ctrl + clic gauche et faites glisser vers la gauche ou la droite sur la carte pour «orbiter» autour du centre de la vue. Vous pouvez également cliquer et faire glisser vers la gauche ou la droite sur le «gyroscope» au centre du contrôle de la boussole pour orbiter autour du centre de la vue.

source: Double-click the “gyroscope” in the centre of the Compass Control to return the view quickly to a vertical view with North to the top at the current location and scale.
fr: Double-cliquez sur le «gyroscope» au centre de la commande de la boussole pour ramener rapidement la vue à une vue verticale avec le nord en haut à l'emplacement et à l'échelle actuels.

source: Dragging to pan and using the mouse wheel to zoom still work while showing a perspective view.
fr: Faire glisser pour effectuer un panoramique et utiliser la molette de la souris pour zoomer fonctionnent toujours tout en affichant une vue en perspective.

source: Use the splitter functionality
fr: Utilisez la fonctionnalité de fractionnement

source: The splitter functionality allows you to compare a dataset for different time periods. To use it:
fr: La fonctionnalité de fractionnement vous permet de comparer un ensemble de données pour différentes périodes. Pour l'utiliser:

source: Select an area/location
fr: Sélectionnez une zone / un emplacement

source: Select a dataset from the catalogue to add it to the workbench
fr: Sélectionnez un jeu de données dans le catalogue pour l'ajouter à l'atelier

source: Select the **Split** link in the workbench to create a copy of the data already selected. Note that you can use the splitter with two different datasets, not just with copies of the same data
fr: Sélectionnez le lien **Fractionner** dans l'atelier pour créer une copie des données déjà sélectionnées. Notez que vous pouvez utiliser le séparateur avec deux ensembles de données différents, pas seulement avec des copies des mêmes données

source: Select different times (using the date picker) for the “left” and “right” sections of the screen
fr: Sélectionnez différentes heures (à l'aide du sélecteur de date) pour les sections «gauche» et «droite» de l'écran

source: Use the back and forward arrows to explore imagery and select cloud-free views
fr: Utilisez les flèches arrière et avant pour explorer les images et sélectionner des vues sans nuage

source: Drag the splitter on the screen to observe the differences
fr: Faites glisser le séparateur sur l'écran pour observer les différences

source: This video shows an example of the splitter used over a map of Australia, but the functionality is the same.
fr: Cette vidéo montre un exemple du séparateur utilisé sur une carte de l'Australie, mais la fonctionnalité est la même.

source: |Split functionality video|
fr: | Vidéo sur la fonctionnalité Split |

source: Upload Data to the Map
fr: Télécharger des données sur la carte

source: There are two ways to load your data:
fr: Il existe deux façons de charger vos données:

source: Drag your data file onto the DE Africa Map map view. The format of the data file will be auto-detected.
fr: Faites glisser votre fichier de données sur la vue cartographique DE Africa Map. Le format du fichier de données sera détecté automatiquement.

source: Select **Add Data** in the left panel. This will launch the data catalogue. Select the **My Data** tab at the top of the modal window and follow the provided instructions.
fr: Sélectionnez **Add Data** dans le panneau de gauche. Cela lancera le catalogue de données. Sélectionnez l'onglet **My Data** en haut de la fenêtre modale et suivez les instructions fournies.

source: As for DE Africa Map data sets, you can select regions or points to see the data available for that location. If the file is a CSV file, the data from all columns will be shown in the feature information dialogue.
fr: En ce qui concerne les ensembles de données DE Africa Map, vous pouvez sélectionner des régions ou des points pour voir les données disponibles pour cet emplacement. Si le fichier est un fichier CSV, les données de toutes les colonnes seront affichées dans la boîte de dialogue d'informations sur les fonctionnalités.
