Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Below, we will use the ``calculate_indices`` function to add a new variable called ``EVI`` to our dataset, and we replace the original ``landsat_ds`` with our modified version.
fr: Ci-dessous, nous utiliserons la fonction ``calculate_indices`` pour ajouter une nouvelle variable appelée ``EVI`` à notre ensemble de données, et nous remplacerons l'original ``landsat_ds`` par notre version modifiée.

source: Detect Changes
fr: Détecter les changements

source: Now we will use ``slice`` and ``sel`` to split our time series into two pieces and store the EVI data from each part into a variable:
fr: Nous allons maintenant utiliser ``slice`` et ``sel`` pour diviser notre série chronologique en deux parties et stocker les données EVI de chaque partie dans une variable:

source: ``baseline_sample`` will contain data between the *first* date in our ``time`` variable (``'2013-01-01'``) and the date we stored as ``time_baseline`` (``'2015-12-31'``)
fr: ``baseline_sample`` contiendra des données entre la *première* date de notre variable ``time`` (``'2013-01-0'``) et la date que nous avons stockée sous la forme ``time_baseline`` (``'2015-12-31'``)

source: ``postbaseline_sample`` will contain data between the ``time_baseline`` and the *second* date stored in our ``'time'`` variable (``'2018-12-01'``)
fr: ``postbaseline_sample`` contiendra des données entre la ``time_baseline`` et la *deuxième* date stockée dans notre variable ``'time`` (``' 2018-12-01'``)

source: Remember that Python numbering starts at zero, so ``time[0]`` is the first entry, and ``time[1]`` is the second.
fr: Rappelez-vous que la numérotation Python commence à zéro, donc ``time[0]`` est la première entrée et ``time[1]`` est la seconde.

source: Detect per-pixel changes
fr: Détecter les changements par pixel

source: First, we will use the ``mean`` function to find the average of all pixels in each of the new datasets along the time axis.
fr: Tout d'abord, nous utiliserons la fonction ``mean`` pour trouver la moyenne de tous les pixels dans chacun des nouveaux ensembles de données le long de l'axe des temps.

source: Next, we will calculate the difference between the two mean mosaics and store that as ``diff_mean_composites``.
fr: Ensuite, nous calculerons la différence entre les deux mosaïques moyennes et la stockerons sous la forme ``diff_mean_composites``.

source: Finally, we plot the difference.
fr: Enfin, nous traçons la différence.

source: Exercise: Determining the extent of water bodies
fr: Exercice: déterminer l'étendue des plans d'eau

source: We begin this notebook with our standard set of initial configuration lines to import packages and functions we need. We also import one new function for this exercise: ``wofs_fuser``. The ``wofs_fuser`` function is used to combine WOfS data from multiple scenes.
fr: Nous commençons ce cahier avec notre ensemble standard de lignes de configuration initiale pour importer les packages et les fonctions dont nous avons besoin. Nous importons également une nouvelle fonction pour cet exercice: ``wofs_fuser``. La fonction ``wofs_fuser`` est utilisée pour combiner les données WOfS de plusieurs scènes.

source: We create a new connection to the Open Data Cube, and save it into the variable ``dc``.
fr: Nous créons une nouvelle connexion à l'Open Data Cube et la sauvegardons dans la variable ``dc``.

source: Select area of interest
fr: Sélectionnez la zone d'intérêt

source: Below, we save the lat/lon extents of our area of interest into variables that we will use to load the data. We use the ‘buffer method’ to define the area in terms of a center point plus or minus a buffer of 0.2 degrees. In the previous exercie we used a single buffer variable for both latitude and longitude; this time we will define both a ``lat_buffer`` and a ``lon_buffer`` so that we can easily define a rectangular region of interest.
fr: Ci-dessous, nous sauvegardons les étendues lat / lon de notre zone d'intérêt dans des variables que nous utiliserons pour charger les données. Nous utilisons la «méthode tampon» pour définir la zone en termes d'un point central plus ou moins un tampon de 0,2 degrés. Dans l'exercice précédent, nous avons utilisé une seule variable tampon pour la latitude et la longitude; cette fois, nous définirons à la fois un ``lat_buffer`` et un ``lon_buffer`` afin de pouvoir définir facilement une région rectangulaire d'intérêt.

source: Create query object
fr: Créer un objet de requête

source: In the following cell, we create a Python dictionary and assign it to the variable ``query``. Dictionaries are key-value stores, which means that a value stored in a dictionary can be retrieved using the key under which it was stored. In the dictionary below, for example, we define a key called ``'x'``, and store the ``lon_range`` under that key. Creating a dictionary to store some or all of the values that we use to load our data can help to keep our code organized, and makes it easier to reuse the parameters in subsequent loads. Below, we will use ``query`` in two separate calls to ``load_ard`` to load two sets of data (Landsat 8 and WOfS).
fr: Dans la cellule suivante, nous créons un dictionnaire Python et l'affectons à la variable ``query``. Les dictionnaires sont des magasins clé-valeur, ce qui signifie qu'une valeur stockée dans un dictionnaire peut être récupérée à l'aide de la clé sous laquelle elle a été stockée. Dans le dictionnaire ci-dessous, par exemple, nous définissons une clé appelée ``'x'``, et stockons le ``lon_range`` sous cette clé. La création d'un dictionnaire pour stocker tout ou partie des valeurs que nous utilisons pour charger nos données peut aider à garder notre code organisé et faciliter la réutilisation des paramètres dans les chargements suivants. Ci-dessous, nous utiliserons ``query`` dans deux appels distincts à ``load_ard`` pour charger deux ensembles de données (Landsat 8 et WOfS).

source: Load Landsat 8
fr: Charger Landsat 8

source: Note that the following call to ``load_ard`` omits several of the parameters we’re used to seeing (such as the extents and resolution). Instead we use the ``query`` variable that we defined above. Passing ``**query`` tells Python to send each of the values stored in the dictionary to ``load_ard`` as if we had supplied that value for the parameter identified by the corresponding key. For example, since the ``query`` dictionary defines ``'x'`` to be ``lon_range``, it is as if we had included the usual ``x = lon_range,`` line in our call to ``load_ard``.
fr: Notez que l'appel suivant à ``load_ard`` omet plusieurs des paramètres que nous avons l'habitude de voir (tels que les étendues et la résolution). À la place, nous utilisons la variable ``requête`` que nous avons définie ci-dessus. Passer ``**query`` indique à Python d'envoyer chacune des valeurs stockées dans le dictionnaire à ``load_ard`` comme si nous avions fourni cette valeur pour le paramètre identifié par la clé correspondante. Par exemple, puisque le dictionnaire ``query`` définit ``'x'`` comme étant ``lon_range``, c'est comme si nous avions inclus la ligne habituelle ``x = lon_range,`` dans notre appel à ``load_ard``.

source: Load WOfS
fr: Charger WOfS

source: For the WOfS product, we use the ``dc.load`` call. We can also pass the ``query`` dictionary to ``dc.load``, which will reuse the same values that we used in the previous cell.
fr: Pour le produit WOfS, nous utilisons l'appel ``dc.load ``. Nous pouvons également passer le dictionnaire ``query`` à ``dc.load``, qui réutilisera les mêmes valeurs que nous avons utilisées dans la cellule précédente.

source: Calculating water extent
fr: Calcul de l'étendue de l'eau

source: Extract the water pixels
fr: Extraire les pixels d'eau

source: Using the table shown in the exercise, we determined that we want to examine all pixels in the WOfS product which have a value equal to 128. We create a new variable, ``ds_valid_water``, which stores the locations of all pixels in the dataset which are equal to 128. Note this requires the double equals sign ``==``.
fr: En utilisant le tableau présenté dans l'exercice, nous avons déterminé que nous voulons examiner tous les pixels du produit WOfS qui ont une valeur égale à 128. Nous créons une nouvelle variable, ``ds_valid_water``, qui stocke les emplacements de tous les pixels dans le ensemble de données égal à 128. Notez que cela nécessite le double signe égal ``==``.

source: When we view the contents of the ``ds_valid_water`` variable, we can see that it contains a grid of True/False values. Wherever ``ds_wofs.water`` was equal to 128, the array will be True. Note that the preview below only shows a small subset of the full DataArray, and there may not be any True pixels visible in the preview output.
fr: Lorsque nous visualisons le contenu de la variable ``ds_valid_water``, nous pouvons voir qu'elle contient une grille de valeurs True / False. Partout où ``ds_wofs.water`` était égal à 128, le tableau sera True. Notez que l'aperçu ci-dessous ne montre qu'un petit sous-ensemble du DataArray complet et qu'il se peut qu'il n'y ait pas de vrais pixels visibles dans la sortie d'aperçu.

source: Calculate the area per pixel
fr: Calculez la surface par pixel

source: We can calculate the area of a pixel by converting its resolution (which we specified in meters per pixel in our ``query`` variable’s ``'resolution'`` key) into square kilometers per pixel:
fr: Nous pouvons calculer l'aire d'un pixel en convertissant sa résolution (que nous avons spécifiée en mètres par pixel dans la clé ``résolution`` de notre variable ``query``) en kilomètres carrés par pixel:

source: Calculate area of water pixels
fr: Calculer la surface des pixels d'eau

source: Now that we know how many square kilometers a pixel represents, we can take that number and multiply it by the count of all pixels containing water in order to get the total water area in our dataset.
fr: Maintenant que nous savons combien de kilomètres carrés un pixel représente, nous pouvons prendre ce nombre et le multiplier par le nombre de tous les pixels contenant de l'eau afin d'obtenir la superficie totale de l'eau dans notre ensemble de données.

source: Plot Time Series
fr: Tracer la série chronologique

source: The following lines of code create a new ``figure`` which will contain a plot of our water area data, complete with custom titles, axis labels, etc.
fr: Les lignes de code suivantes créent une nouvelle ``figure`` qui contiendra un tracé de nos données de surface d'eau, avec des titres personnalisés, des étiquettes d'axe, etc.

source: Display of water coverage for a selected timestep
fr: Affichage de la couverture d'eau pour un pas de temps sélectionné

source: Finally, we choose one of the times in our time series to generate more customised plots of both the Landsat and WOfS datasets. Here we have chosen timestep ``4`` (the fifth time in the series, since we start counting at zero) but you are encouraged to experiment with other time indices to find times where the lake has dried out (the line plot above may provide some hints!).
fr: Enfin, nous choisissons l'un des moments de notre série chronologique pour générer des graphiques plus personnalisés des ensembles de données Landsat et WOfS. Ici, nous avons choisi le pas de temps ``4`` (la cinquième fois de la série, puisque nous commençons à compter à zéro) mais vous êtes encouragé à expérimenter avec d'autres indices de temps pour trouver les moments où le lac s'est desséché (le graphique en ligne donnez quelques indices!).

source: Sandbox help documentation
fr: Documentation d'aide de Sandbox

source: The Digital Earth Africa Sandbox, by default, will load several folders containing helpful notebooks and source code. They are essential to the Sandbox’s operation, so do not delete or move any of the files.
fr: Le bac à sable Digital Earth Africa, par défaut, chargera plusieurs dossiers contenant des blocs-notes utiles et du code source. Ils sont essentiels au fonctionnement du Sandbox, donc ne supprimez ni ne déplacez aucun des fichiers.

source: The Beginner’s Guide notebooks cover similar material to the explanations and exercises in this workshop series. However, they also provides more in-depth detail on how to perform data extraction and analysis. The Beginner’s Guide notebooks, along with the ‘frequently used code’ notebooks, are a great reference tool.
fr: Les cahiers du Guide du débutant couvrent des éléments similaires aux explications et aux exercices de cette série d’ateliers. Cependant, ils fournissent également des détails plus détaillés sur la façon d'exécuter l'extraction et l'analyse des données. Les blocs-notes du Guide du débutant, ainsi que les blocs-notes «code fréquemment utilisé», sont un excellent outil de référence.

source: This section provides a summary of these folders and their contents. It also contains some recommended but **not compulsory** activities that will help increase your familiarity with Digital Earth Africa and the Sandbox.
fr: Cette section fournit un résumé de ces dossiers et de leur contenu. Il contient également des activités recommandées mais **non obligatoires** qui vous aideront à vous familiariser avec Digital Earth Africa et le bac à sable.

source: For tips on how to access files and folders in the Sandbox, check out the section on `navigating the Sandbox <./session_1/03_navigate_the_sandbox.ipynb>`__.
fr: Pour obtenir des conseils sur la façon d'accéder aux fichiers et aux dossiers dans le bac à sable, consultez la section sur `navigation dans le bac à sable <./session_1/03_navigate_the_sandbox.ipynb>`__.

source: For a review on how to execute code in a notebook, see this section on `running a notebook <./session_1/04_running_a_notebook.ipynb>`__.
fr: Pour savoir comment exécuter du code dans un bloc-notes, consultez cette section sur `l'exécution d'un bloc-notes <./session_1/04_running_a_notebook.ipynb>`__.

source: Beginner’s Guide - start here
fr: Guide du débutant - commencez ici

source: The **Beginners_guide** folder contains step-by-step tutorials to help you become more familiar with the Digital Earth Africa Sandbox. The tutorials contain background information and context, as well as code and data examples and explanations. The guide covers a range of basic Sandbox functions, including how to load data and plot it.
fr: Le dossier **Beginners_guide** contient des didacticiels étape par étape pour vous aider à vous familiariser avec le bac à sable Digital Earth Africa. Les didacticiels contiennent des informations générales et du contexte, ainsi que des exemples de code et de données et des explications. Le guide couvre une gamme de fonctions de base de Sandbox, y compris comment charger des données et les tracer.

source: If you are still unclear on the scope and focus of Digital Earth Africa and the Sandbox, this is also a great place to read more about it and see some hands-on demonstrations of Earth observation data at work.
fr: Si vous n'êtes toujours pas clair sur la portée et l'objectif de Digital Earth Africa et du bac à sable, c'est également un endroit idéal pour en savoir plus à ce sujet et voir des démonstrations pratiques des données d'observation de la Terre au travail.

source: The notebooks are numbered in progress order; start at ``01_Jupyter_notebooks.ipynb``. There are no prerequisites to be able to complete this notebook.
fr: Les cahiers sont numérotés par ordre de progression; commencez par ``01_Jupyter_notebooks.ipynb``. Il n'y a aucune condition préalable pour pouvoir compléter ce cahier.

source: **Suggested activity:** Read and follow examples in the Beginner’s Guide notebooks, starting with ``01_Jupyter_notebooks.ipynb``. This can be done interactively (recommended), as detailed in `running a notebook <./session_1/04_running_a_notebook.ipynb>`__. Open the file and from the horizontal menu bar select **Kernel -> Restart Kernel and Clear All Outputs**, then follow instructions in the notebook.
fr: **Activité suggérée:** Lisez et suivez des exemples dans les blocs-notes du Guide du débutant, en commençant par ``01_Jupyter_notebooks.ipynb``. Cela peut être fait de manière interactive (recommandé), comme détaillé dans `exécuter un notebook <./session_1/04_running_a_notebook.ipynb>`__. Ouvrez le fichier et dans la barre de menu horizontale, sélectionnez **Kernel -> Kernel -> Restart Kernel and Clear All Outputs**, puis suivez les instructions du bloc-notes.

source: Take your time — it is not necessary to review all of the notebooks in one sitting. If you are new to Python coding, there will be a fair amount of content. Some of it will be covered in subsequent sessions of this workshop series.
fr: Prenez votre temps - il n'est pas nécessaire de revoir tous les cahiers en une seule séance. Si vous êtes nouveau dans le codage Python, il y aura une bonne quantité de contenu. Une partie sera couverte dans les sessions ultérieures de cette série d'ateliers.

source: Frequently used code
fr: Code fréquemment utilisé

source: The **Frequently_used_code** folder contains a series of notebooks that demonstrate code snippets doing useful and common functions. For example, want to calculate the Normalised Difference Vegetation Index (NDVI)? You could set up your own formula — but it would be faster and easier to use the NDVI function as shown in ``Calculating_band_indices.ipynb``. How about drawing a contour line between water and land? Check out ``Contour_extraction.ipynb``. There are many useful tips and tricks in the **Frequently_used_code** folder.
fr: Le dossier **Frequently_used_code** contient une série de blocs-notes illustrant des extraits de code exécutant des fonctions utiles et courantes. Par exemple, vous voulez calculer l'indice de végétation par différence normalisée (NDVI)? Vous pouvez configurer votre propre formule - mais il serait plus rapide et plus facile d'utiliser la fonction NDVI comme indiqué dans ``Calculating_band_indices.ipynb``. Que diriez-vous de dessiner une ligne de contour entre l'eau et la terre? Consultez ``Contour_extraction.ipynb``. Il existe de nombreux trucs et astuces utiles dans le dossier **Frequently_used_code**.

source: It is helpful to know what is in this folder, so you can draw upon the code if you need to do something similar when writing your own notebooks.
fr: Il est utile de savoir ce qu'il y a dans ce dossier, afin que vous puissiez vous inspirer du code si vous devez faire quelque chose de similaire lorsque vous écrivez vos propres blocs-notes.

source: **Suggested activity:** Read all the titles of the notebooks in the folder. Open ``Masking_data.ipynb`` and run through its contents by selecting **Kernel -> Restart Kernel and Clear All Outputs** and then executing cells as you go.
fr: **Activité suggérée:** Lisez tous les titres des cahiers dans le dossier. Ouvrez ``Masking_data.ipynb`` et parcourez son contenu en sélectionnant **Kernel -> Restart Kernel and Clear All Outputs**, puis en exécutant les cellules au fur et à mesure.

source: Real world examples
fr: Exemples du monde réel

source: The analytical power of the Sandbox is shown in the folder **Real_world_examples**. This folder contains multiple notebooks which cater to ‘real world’ use cases, from monitoring crop health to detecting water.
fr: La puissance analytique du Sandbox est indiquée dans le dossier **Real_world_examples**. Ce dossier contient plusieurs blocs-notes qui répondent à des cas d’utilisation «réels», de la surveillance de la santé des cultures à la détection de l’eau.

source: The code in these notebooks is more complex, but it is exciting to see what Digital Earth Africa can do.
fr: Le code de ces carnets est plus complexe, mais il est passionnant de voir ce que Digital Earth Africa peut faire.

source: **Suggested activity:** Pick a notebook that interests you and run through it.
fr: **Activité suggérée:** Choisissez un cahier qui vous intéresse et parcourez-le.

source: Datasets
fr: Ensembles de données

source: The notebooks in the Sandbox are all based on Earth observation data available to Digital Earth Africa. These datasets are explained in individual notebooks in the **Datasets** folder. Each notebook contains background information about the dataset and examples of use.
fr: Les cahiers dans le bac à sable sont tous basés sur les données d'observation de la Terre disponibles pour Digital Earth Africa. Ces ensembles de données sont expliqués dans des blocs-notes individuels dans le dossier **Datasets**. Chaque carnet contient des informations générales sur l'ensemble de données et des exemples d'utilisation.

source: Some of the datasets are based directly on satellite measurements. For example, information on the Landsat and Sentinel satellite datasets can be found in their respective notebooks:
fr: Certains des ensembles de données sont directement basés sur des mesures satellitaires. Par exemple, des informations sur les jeux de données satellites Landsat et Sentinel peuvent être trouvées dans leurs carnets respectifs:

source: Other datasets refer to derived products which have been created to show a particular environmental feature. These include:
fr: D'autres ensembles de données font référence à des produits dérivés qui ont été créés pour montrer une caractéristique environnementale particulière. Ceux-ci inclus:

source: More dataset notebooks are added to this folder as the Digital Earth Africa collection expands. Use the notebooks in this folder to familiarise yourself with the available data and products.
fr: D'autres blocs-notes de jeux de données sont ajoutés à ce dossier à mesure que la collection Digital Earth Africa s'agrandit. Utilisez les blocs-notes de ce dossier pour vous familiariser avec les données et les produits disponibles.

source: **Suggested activity:** Run through the notebook on Sentinel 2 data, ``Sentinel_2.ipynb``.
fr: **Activité suggérée:** Parcourez le bloc-notes sur les données Sentinel 2, ``Sentinel_2.ipynb``.

source: Other folders
fr: Autres dossiers

source: There are a few other folders in the home folder, such as **Scripts** and **DCAL**. Feel free to have a browse, but they are not important to know about when you are starting out.
fr: Il existe quelques autres dossiers dans le dossier de départ, tels que **Scripts** et **DCAL**. N'hésitez pas à parcourir, mais il n'est pas important de savoir quand vous débutez.

source: **Suggested activity:** Ignore these folders for now.
fr: **Activité suggérée:** Ignorez ces dossiers pour le moment.

source: Help! I deleted a file…
fr: Aidez-moi! J'ai supprimé un fichier…

source: See the `Frequently asked questions <./Frequently_asked_questions.ipynb>`__ section on restoring pre-loaded notebooks.
fr: Consultez la section `Questions fréquemment posées <./Frequently_asked_questions.ipynb>`__ sur la restauration de blocs-notes préchargés.

source: What is Digital Earth Africa?
fr: Qu'est-ce que Digital Earth Africa?

source: Africa is a continent with a rich and diverse environment that faces many challenges such as ready access to drinking water, rapid urban development, active deforestation and food insecurity. Our understanding of these challenges connects directly to how well we understand its natural resources, and the human and climate impact on them.
fr: L'Afrique est un continent avec un environnement riche et diversifié qui fait face à de nombreux défis tels que l'accès facile à l'eau potable, le développement urbain rapide, la déforestation active et l'insécurité alimentaire. Notre compréhension de ces défis est directement liée à notre compréhension de ses ressources naturelles et de l'impact humain et climatique sur celles-ci.
