Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: To learn more about geomedians, you can read the following paper: `High-Dimensional Pixel Composites From Earth Observation Time Series <https://ieeexplore.ieee.org/abstract/document/8004469>`__.
fr: Pour en savoir plus sur les géomédiens, vous pouvez lire l'article suivant: `High-Dimensional Pixel Composites from Earth Observation Time Series <https://ieeexplore.ieee.org/abstract/document/8004469>`__.

source: You now know we can perform cloud masking using the ``load_ard()`` function, and that we should combine different timesteps of data using a geomedian calculation.
fr: Vous savez maintenant que nous pouvons effectuer un masquage des nuages en utilisant la fonction ``load_ard()``, et que nous devons combiner différents pas de temps de données en utilisant un calcul géomédian.

source: The exercise for this session is covered in the next two sections.
fr: L'exercice de cette session est couvert dans les deux sections suivantes.

source: We will walk through the process of using ``load_ard()`` to load data with a cloud mask.
fr: Nous allons parcourir le processus d'utilisation de ``load_ard()`` pour charger des données avec un masque de nuage.

source: We will then use the loaded data to make and plot geomedians.
fr: Nous utiliserons ensuite les données chargées pour créer et tracer des géomédiens.

source: This technique will be useful in future sessions for conducting analysis on cloud-free images.
fr: Cette technique sera utile dans les prochaines sessions pour mener des analyses sur des images sans nuage.

source: Cloud masking with ``load_ard()``
fr: Masquage cloud avec ``load_ard()``

source: In this exercise, we will apply a cloud mask to Sentinel-2 data off the coast of Ghana. Cloud masks are important as they remove bad data points from our dataset, so we can form a reliable composite image.
fr: Dans cet exercice, nous appliquerons un masque de nuage aux données Sentinel-2 au large des côtes du Ghana. Les masques cloud sont importants car ils suppriment les mauvais points de données de notre ensemble de données, afin que nous puissions former une image composite fiable.

source: Like in the last exercise, we will begin by making a new, blank Jupyter notebook. If you want more detailed instructions on making a new notebook, see `this section in the exercise on loading data in the Sandbox <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__ from the previous session. Otherwise, follow the steps below.
fr: Comme dans le dernier exercice, nous commencerons par créer un nouveau cahier Jupyter vierge. Si vous voulez des instructions plus détaillées sur la création d'un nouveau bloc-notes, consultez `cette section de l'exercice sur le chargement de données dans le bac à sable <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__ de la session précédente. Sinon, suivez les étapes ci-dessous.

source: Navigate to the **Training** folder (or create this folder following the instructions in `Session 1 <../session_1/04_running_a_notebook.ipynb>`__).
fr: Accédez au dossier **Training** (ou créez ce dossier en suivant les instructions de `Session 1 <../session_1/04_running_a_notebook.ipynb>`__).

source: Click the **+** button and click **Python 3** under the **Notebook** section.
fr: Cliquez sur le bouton **+**, puis sur **Python 3** sous la section **Notebook**.

source: Rename your file so you know it is from this exercise. We will use this notebook for working with geomedians, so let us call it ``Geomedian_composite.ipynb``.
fr: Renommez votre fichier pour savoir qu'il provient de cet exercice. Nous utiliserons ce notebook pour travailler avec des géomédiens, appelons-le donc ``Geomedian_composite.ipynb``.

source: Open the notebook.
fr: Ouvrez le cahier.

source: In the first cell, type the following code and then run the cell. Recall that cells can be run by pressing ``Shift + Enter`` on your keyboard.
fr: Dans la première cellule, tapez le code suivant, puis exécutez la cellule. Rappelez-vous que les cellules peuvent être exécutées en appuyant sur ``Maj + Entrée`` sur votre clavier.

source: We used most of these packages and functions in the previous exercise on loading data in the Sandbox. ``rgb`` is for plotting true-colour images. ``display_map`` is for visualising the area we are mapping.
fr: Nous avons utilisé la plupart de ces packages et fonctions dans l'exercice précédent sur le chargement de données dans le bac à sable. ``rgb`` sert à tracer des images en vraies couleurs. ``display_map`` sert à visualiser la zone que nous cartographions.

source: In this session we introduce two new functions: ``load_ard`` and ``xr_geomedian``. We will use ``load_ard`` to load data so it is cloud masked, and ``xr_geomedian`` is used in the next section to compute the geomedian.
fr: Dans cette session, nous introduisons deux nouvelles fonctions: ``load_ard`` et ``xr_geomedian``. Nous utiliserons ``load_ard`` pour charger les données afin qu'elles soient masquées par le nuage, et ``xr_geomedian`` est utilisé dans la section suivante pour calculer le géomédian.

source: Enter the following code and run the cell to create our ``dc`` object, which provides access to the datacube.
fr: Entrez le code suivant et exécutez la cellule pour créer notre objet ``dc``, qui permet d'accéder au datacube.

source: Your notebook is now set up. Next, we will load cloud-masked data using ``load_ard()``.
fr: Votre notebook est maintenant configuré. Ensuite, nous chargerons les données masquées par le cloud en utilisant ``load_ard()``.

source: Load data with ``load_ard()``
fr: Charger des données avec ``load_ard()``

source: If you experience errors when running cells, check out the `troubleshooting code guide <../session_2/04_load_data_exercise.ipynb#Troubleshooting-code>`_ from the previous session.
fr: Si vous rencontrez des erreurs lors de l'exécution de cellules, consultez le `guide de code de dépannage <../session_2/04_load_data_exercise.ipynb#Troubleshooting-code>`__ de la session précédente.

source: Let us take a look at a coastal area in Ghana. Enter the following code and run it to display a map of the area. As before, ``x`` denotes longitude and ``y`` denotes latitude.
fr: Jetons un coup d'œil à une zone côtière du Ghana. Entrez le code suivant et exécutez-le pour afficher une carte de la zone. Comme précédemment, ``x`` désigne la longitude et ``y`` la latitude.

source: In the new cell below, enter the following code, and then run it to load Sentinel-2 data. It will generate the output text ``Using pixel quality parameters for Sentinel 2 ...``. The output text tells us we have loaded 4 timesteps.
fr: Dans la nouvelle cellule ci-dessous, entrez le code suivant, puis exécutez-le pour charger les données Sentinel-2. Il générera le texte de sortie ``Using pixel quality parameters for Sentinel 2 ...``. Le texte de sortie nous indique que nous avons chargé 4 pas de temps.

source: Take note of some of the differences between ``dc.load()`` and ``load_ard``.
fr: Prenez note de certaines des différences entre ``dc.load()`` et ``load_ard``.

source: ``dc=dc`` is a required parameter for ``load_ard()``. This links the data search to the datacube connection, which we defined in the notebook setup as ``dc``.
fr: ``dc=dc`` est un paramètre obligatoire pour ``load_ard()``. Cela lie la recherche de données à la connexion du datacube, que nous avons définie dans la configuration du notebook comme ``dc``.

source: The paramter for loading products is ``products`` (plural) not ``product`` as it is in ``dc.load()``.
fr: Le paramètre de chargement des produits est ``products`` (pluriel) et non ``product`` comme c'est le cas dans ``dc.load()``.

source: Product items must be listed inside square brackets ``[]``, which is not required for ``dc.load()``.
fr: Les éléments du produit doivent être listés entre crochets ``[]``, ce qui n'est pas obligatoire pour ``dc.load()``.

source: ``min_gooddata`` stands for ‘minimum good data’ and discards observations with less than the fractional requisite of good quality pixels.
fr: ``min_gooddata`` signifie 'minimum good data' et rejette les observations avec moins que la fraction requise de pixels de bonne qualité.

source: We can use the same ``rgb`` plotting code as in the last session to show an RGB image of one of the timesteps. Let’s start with the first timestep, which has an ``index`` of ``0``.
fr: Nous pouvons utiliser le même code de traçage ``rgb`` que lors de la dernière session pour afficher une image RVB de l'un des pas de temps. Commençons par le premier pas temporel, qui a un ``index`` de ``0``.

source: This should produce a single RGB image as shown below. What happens if you try changing the ``index`` number?
fr: Cela devrait produire une seule image RVB comme indiqué ci-dessous. Que se passe-t-il si vous essayez de changer le numéro ``index``?

source: If we want to see RGB images of all the timesteps at once, we can replace the ``index`` parameter with the ``col`` parameter. The parameter ``col`` stands for ‘column’. Specifying ``col='time'`` creates a row of images for the timesteps.
fr: Si nous voulons voir des images RVB de tous les pas de temps à la fois, nous pouvons remplacer le paramètre ``index`` par le paramètre ``col``. Le paramètre «col» signifie «colonne». Spécifier ``col='time'`` crée une ligne d'images pour les pas temporels.

source: The output should look like this.
fr: La sortie devrait ressembler à ceci.

source: Good work — you have now loaded data using ``load_ard()``, which has an automatic cloud mask. We can see that the images at different timesteps have different cloud cover, so they have been masked in different places. This is why having data at different timesteps can allow us to create a composite image without any cloud.
fr: Bon travail - vous avez maintenant chargé les données en utilisant ``load_ard()``, qui a un masque de nuage automatique. Nous pouvons voir que les images à différents pas de temps ont une couverture nuageuse différente, elles ont donc été masquées à différents endroits. C'est pourquoi avoir des données à des pas de temps différents peut nous permettre de créer une image composite sans aucun nuage.

source: In the next section, we will use this loaded data to create a geomedian composite.
fr: Dans la section suivante, nous utiliserons ces données chargées pour créer un composite géomédien.

source: Create a geomedian composite
fr: Créer un composite géomédian

source: This exercise follows on from the previous section. In the previous section, we loaded Sentinel-2 data using ``load_ard()``. This applied a cloud mask to the data by identifying and removing cloudy data points. We can now use this data to create a geomedian composite.
fr: Cet exercice fait suite à la section précédente. Dans la section précédente, nous avons chargé les données Sentinel-2 en utilisant ``load_ard()``. Cela a appliqué un masque de nuage aux données en identifiant et en supprimant les points de données nuageux. Nous pouvons maintenant utiliser ces données pour créer un composite géomédien.

source: In this section, we will re-run the notebook from the previous section, and extend it to create a geomedian composite. First, we will open and run our ``Geomedian_composite.ipynb`` notebook. This will ensure it loads the Sentinel-2 cloud-masked data. Then, we will use a function called ``xr_geomedian`` to calculate geomedians. This will allow us to plot a cloud-free geomedian composite image.
fr: Dans cette section, nous réexécuterons le bloc-notes de la section précédente et l'étendrons pour créer un composite géomédien. Tout d'abord, nous allons ouvrir et exécuter notre notebook ``Geomedian_composite.ipynb``. Cela garantira qu'il charge les données masquées par le cloud Sentinel-2. Ensuite, nous utiliserons une fonction appelée ``xr_geomedian`` pour calculer les géomédiens. Cela nous permettra de tracer une image composite géomédienne sans nuage.

source: We will be using the notebook we created in the `previous section <./02_cloud_masking.ipynb>`_, **Cloud masking with load_ard()**. If you have not already set up a notebook called ``Geomedian_composite.ipynb`` with the required packages and functions, follow the instructions in previous section. Ensure you have completed all the steps, including loading the Sentinel-2 dataset for the Ghanaian coast.
fr: Nous utiliserons le notebook que nous avons créé dans la `section précédente <./ 02_cloud_masking.ipynb>`_, **Masquage du cloud avec load_ard()**. Si vous n'avez pas encore configuré un notebook appelé ``Geomedian_composite.ipynb`` avec les packages et les fonctions requis, suivez les instructions de la section précédente. Assurez-vous d'avoir terminé toutes les étapes, y compris le chargement de l'ensemble de données Sentinel-2 pour la côte ghanéenne.

source: If you are following directly on from the last section, you can skip this step. If you have closed your Sandbox browser tab or disconnected from the Internet between exercises, follow these steps to ensure correct package imports and connection to the datacube.
fr: Si vous suivez directement à partir de la dernière section, vous pouvez ignorer cette étape. Si vous avez fermé l'onglet de votre navigateur Sandbox ou vous êtes déconnecté d'Internet entre les exercices, suivez ces étapes pour vous assurer que les importations de packages et la connexion au datacube sont correctes.

source: Navigate to the **Training** folder.
fr: Accédez au dossier **Training**.

source: Double-click ``Geomedian_composite.ipynb``. It will open in the Launcher.
fr: Double-cliquez sur ``Geomedian_composite.ipynb``. Il s'ouvrira dans le lanceur.

source: Select **Kernel -> Restart Kernel and Run All Cells…**
fr: Sélectionnez **Kernel -> Restart Kernel and Run All Cells…**

source: When prompted, select **Restart**.
fr: Lorsque vous y êtes invité, sélectionnez **Restart**.

source: The notebook may take a little while to run. Check all the cells have run successfully with no error messages.
fr: L'exécution du notebook peut prendre un peu de temps. Vérifiez que toutes les cellules ont été exécutées avec succès sans message d'erreur.

source: Check the Sentinel-2 dataset
fr: Vérifiez le jeu de données Sentinel-2

source: Let’s confirm we have successfully loaded our Sentinel-2 dataset. Recall we named it ``sentinel_2_ds``. Scroll to the bottom of the notebook and run the dataset name in the next empty cell.
fr: Confirmons que nous avons correctement chargé notre ensemble de données Sentinel-2. Rappelez-vous que nous l'avons nommé ``sentinel_2_ds``. Faites défiler vers le bas du bloc-notes et exécutez le nom du jeu de données dans la cellule vide suivante.

source: The output should show we have 4 timesteps.
fr: La sortie devrait montrer que nous avons 4 pas de temps.

source: If you encounter a ``NameError`` error message, you might need to reload your packages and functions. Follow the steps above, under **Open and run notebook**.
fr: Si vous rencontrez un message d'erreur ``NameError``, vous devrez peut-être recharger vos packages et fonctions. Suivez les étapes ci-dessus, sous **Ouvrir et exécuter le notebook**.

source: Now we will create a geomedian composite using the ``xr_geomedian`` function. In the next empty cell below, enter the following code, and then run it.
fr: Nous allons maintenant créer un composite géomédien en utilisant la fonction ``xr_geomedian``. Dans la cellule vide suivante ci-dessous, entrez le code suivant, puis exécutez-le.

source: This generates a dataset called ``geomedian_composite`` which contains one geomedian value for every pixel.
fr: Cela génère un ensemble de données appelé ``geomedian_composite`` qui contient une valeur géomédiane pour chaque pixel.

source: Create an RGB image of the composite
fr: Créer une image RVB du composite

source: In the new cell below, enter the following code, and then run it to generate an RGB image of the composite.
fr: Dans la nouvelle cellule ci-dessous, entrez le code suivant, puis exécutez-le pour générer une image RVB du composite.

source: Excellent! There are no clouds or cloud shadows in the geomedian composite.
fr: Excellent! Il n'y a pas de nuages ou d'ombres de nuages dans le composite géomédien.

source: There are some visual anomalies, but most of the image accurately represents the area. Note that this image is a representation of what the area looked like over the loaded time range, so from the 1st of February, 2018, to the 15th of March, 2018.
fr: Il y a quelques anomalies visuelles, mais la plupart de l'image représente exactement la zone. Notez que cette image est une représentation de ce à quoi ressemblait la zone sur la plage de temps chargée, donc du 1er février 2018 au 15 mars 2018.

source: Save your work by clicking **File -> Save Notebook** or pressing ``Ctrl + S``.
fr: Enregistrez votre travail en cliquant sur **File -> Save Notebook** ou en appuyant sur ``Ctrl + S``.

source: We have created a geomedian composite of Sentinel-2 data and seen that it is an accurate representation of an area. It fills in missing or masked data, such as clouds and cloud shadows.
fr: Nous avons créé un composite géomédien de données Sentinel-2 et vu qu'il s'agit d'une représentation précise d'une zone. Il remplit les données manquantes ou masquées, telles que les nuages et les ombres des nuages.

source: This is the end of Session 3. In this session, you have been introduced to the concept of using composite datasets and images to fill in data gaps. We have also learned the best statistical method of combining datasets is the geomedian. Good work!
fr: C'est la fin de la session 3. Dans cette session, vous avez été initié au concept d'utilisation d'ensembles de données et d'images composites pour combler les lacunes de données. Nous avons également appris que la meilleure méthode statistique pour combiner des ensembles de données est le géomédian. Bon travail!

source: Session 3 Quiz and Solution
fr: Session 3 Quiz et solution

source: In Session 3, you loaded Sentinel-2 data into the Sandbox using ``load_ard()``. The first section of the exercise showed that ``load_ard()`` applies a cloud mask to each timestep in the dataset. The second part of the exercise used the same dataset to calculate and plot a cloud-free geomedian, using ``xr_geomedian()`` and ``rgb()``.
fr: Dans la session 3, vous avez chargé les données Sentinel-2 dans le bac à sable en utilisant ``load_ard()``. La première section de l'exercice a montré que ``load_ard()`` applique un masque de nuage à chaque pas de temps dans l'ensemble de données. La deuxième partie de l'exercice a utilisé le même jeu de données pour calculer et tracer un géomédian sans nuage, en utilisant ``xr_geomedian()`` et ``rgb()``.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://docs.google.com/forms/d/e/1FAIpQLSfrW9iPikaKStkWRvp7o0CjmPeXj_xQatR58xQPDPEq_Et0CA/viewform?usp=sf_link>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `répondre au quiz <https://docs.google.com/forms/d/e/1FAIpQLSfrW9iPikaKStkWRvp7o0CjmPeXj_xQatR58xQPDPEq_Et0CA/view_flink?usp=slink?usp= >`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: We strongly encourage you to attempt the exercises on the previous two pages before downloading the solution below. This will help you learn how to use the Sandbox independently for your own analyses.
fr: Nous vous encourageons fortement à essayer les exercices des deux pages précédentes avant de télécharger la solution ci-dessous. Cela vous aidera à apprendre à utiliser le bac à sable indépendamment pour vos propres analyses.

source: `Download the solution notebook for the Session 3 exercises <../_static/session_3/Geomedian_composite_solution.ipynb>`__
fr: `Téléchargez le cahier de solution pour les exercices de la session 3 <../_static/session_3/Geomedian_composite_solution.ipynb>`__

source: In this session, we will explore the advantages of having satellite data available over a long period of time. We can fill in missing or bad data from one day with data from another day. This creates a complete image known as a **composite**. The most scientifically rigorous way of combining data is to use a **geomedian**.
fr: Dans cette session, nous explorerons les avantages de disposer de données satellitaires sur une longue période. Nous pouvons remplir les données manquantes ou incorrectes d'un jour avec des données d'un autre jour. Cela crée une image complète appelée **composite**. La manière la plus scientifiquement rigoureuse de combiner des données consiste à utiliser un **géomédian**.

source: First, we will introduce composites and geomedians. Then, the exercise will walk through removing cloudy data points from our datasets, and show you how to produce cloud-free geomedian composite images.
fr: Tout d'abord, nous présenterons les composites et les géomédians. Ensuite, l'exercice vous expliquera la suppression des points de données nuageux de nos ensembles de données et vous montrera comment produire des images composites géomédiennes sans nuage.

source: Band indices
fr: Indices de bande

source: True-colour images, like the RGB ones we created in Session 2 and Session 3, are an intuitive way of displaying spatial data as it appears to our eyes. However, satellites capture many more layers of data: their range extends outside the visible spectrum. We can also make use of these measurements to perform various kinds of data analysis.
fr: Les images en vraies couleurs, comme celles RVB que nous avons créées dans les sessions 2 et 3, sont une manière intuitive d'afficher les données spatiales telles qu'elles apparaissent à nos yeux. Cependant, les satellites capturent beaucoup plus de couches de données: leur portée s'étend en dehors du spectre visible. Nous pouvons également utiliser ces mesures pour effectuer différents types d'analyse de données.

source: One established analysis technique for identifying specific terrain features, such as water or bare soil, is to calculate a **band index**.
fr: Une technique d'analyse établie pour identifier des caractéristiques spécifiques du terrain, comme l'eau ou le sol nu, consiste à calculer un **indice de bande**.

source: Video: Band indices
fr: Vidéo: indices de bande

source: Watch the short video below to learn about band indices. Then, read the text below for more detail.
fr: Regardez la courte vidéo ci-dessous pour en savoir plus sur les indices de bande. Ensuite, lisez le texte ci-dessous pour plus de détails.

source: `Download the video slides as a PDF <../_static/session_4/Week4_Band-indices.pdf>`__
fr: `Téléchargez les diapositives vidéo au format PDF <../_static/session_4/Week4_Band-indices.pdf>`__

source: What is a band?
fr: Qu'est-ce qu'un groupe?

source: *A section of the electromagnetic spectrum showing some of the Landsat 8 bands.* [`Source <http://www.geocarto.com.hk/edu/PJ-BCMBLSAT/main_BCLS.html>`__]
fr: * Une section du spectre électromagnétique montrant certaines des bandes Landsat 8. * [`Source <http://www.geocarto.com.hk/edu/PJ-BCMBLSAT/main_BCLS.html>`__]
