Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: The base product for WOfS is the feature layers product, `ga_ls8c_wofs_2 <https://explorer.digitalearth.africa/ga_ls8c_wofs_2>`__. It has a single measurement called ``water``, which indicates how the algorithm classifies each pixel in the image. ``water=0`` means a dry pixel, and ``water=128`` is a water pixel.
fr: Le produit de base pour WOfS est le produit de couches de caractéristiques, `ga_ls8c_wofs_2 <https://explorer.digitalearth.africa/ga_ls8c_wofs_2>`__. Il a une seule mesure appelée ``water``, qui indique comment l'algorithme classe chaque pixel de l'image. ``water=0`` signifie un pixel sec et ``water=128`` est un pixel d'eau.

source: There are a few different classifications for other types of pixels, such as cloud. These are also mapped to unique values.
fr: Il existe quelques classifications différentes pour d'autres types de pixels, tels que le cloud. Ceux-ci sont également mappés à des valeurs uniques.

source: ``water=128`` - Water
fr: ``water=128`` - Eau

source: ``water=64`` - Cloud
fr: ``water=64`` - Nuage

source: ``water=0`` - Dry
fr: ``water=0`` - Sec

source: Don't worry if this seems confusing, or you're not sure how to use this to find water in an image. We'll cover this during the exercise on the next page. If you want to read more about feature layers, open the **Frequently_used_code** folder on the Sandbox, then double-click the **Applying_WOfS_bitmasking.ipynb** notebook to open it.
fr: Ne vous inquiétez pas si cela semble déroutant ou si vous ne savez pas comment l'utiliser pour trouver de l'eau dans une image. Nous en parlerons lors de l'exercice de la page suivante. Si vous voulez en savoir plus sur les couches d'entités, ouvrez le dossier **Frequently_used_code** sur le bac à sable, puis double-cliquez sur le bloc-notes **Applying_WOfS_bitmasking.ipynb** pour l'ouvrir.

source: Annual summary
fr: Résumé annuel

source: Digital Earth Africa also has an annual summary WOfS product called `ga_ls8c_wofs_2_annual_summary <https://explorer.digitalearth.africa/ga_ls8c_wofs_2_annual_summary>`__. This product records how often a pixel was classified as water in a given year. This is useful for comparing the presence of water over different years. The WOfS annual summary dataset contains three measurements:
fr: Digital Earth Africa propose également un résumé annuel du produit WOfS appelé `ga_ls8c_wofs_2_annual_summary <https://explorer.digitalearth.africa/ga_ls8c_wofs_2_annual_summary>`__. Ce produit enregistre la fréquence à laquelle un pixel a été classé comme eau au cours d'une année donnée. Ceci est utile pour comparer la présence d'eau sur différentes années. L'ensemble de données récapitulatives annuelles WOfS contient trois mesures:

source: ``count_wet``: The number of times a given pixel was wet during the year.
fr: ``count_wet``: Le nombre de fois qu'un pixel donné a été mouillé au cours de l'année.

source: ``count_clear``: The number times a given pixel was clear (not cloudy) during the year. A clear pixel could be either wet or dry.
fr: ``count_clear``: Le nombre de fois qu'un pixel donné était clair (pas nuageux) au cours de l'année. Un pixel clair peut être humide ou sec.

source: ``frequency``: The ratio of ``count_wet`` to ``count_clear``, which describes the percentage of time a pixel was wet out of all the times it could be seen during the year.
fr: ``frequency``: le rapport de ``count_wet`` à ``count_clear``, qui décrit le pourcentage de temps pendant lequel un pixel a été mouillé par rapport à toutes les fois où il a pu être vu au cours de l'année.

source: With a rapidly changing climate, it is incredibly important to be able to understand and analyse water resources. This can easily be done in the Digital Earth Africa Sandbox, which allows access to satellite datasets and products such as WOfS.
fr: Avec un climat en évolution rapide, il est extrêmement important de pouvoir comprendre et analyser les ressources en eau. Cela peut facilement être fait dans le bac à sable Digital Earth Africa, qui permet d'accéder à des ensembles de données satellites et à des produits tels que WOfS.

source: In the next section, we will see how to construct a case study investigating water extent using WOfS.
fr: Dans la section suivante, nous verrons comment construire une étude de cas sur l'étendue de l'eau à l'aide de WOfS.

source: In this exercise, we will create a new notebook to determine the extent of water bodies using the `Water Observation from Space (WOfS) product <https://www.ga.gov.au/scientific-topics/community-safety/flood/wofs/about-wofs>`__. The WOfS product uses an automated water mapping algorithm to identify water in Landsat 8 images.
fr: Dans cet exercice, nous créerons un nouveau cahier pour déterminer l'étendue des plans d'eau à l'aide du produit `Water Observation from Space (WOfS) <https://www.ga.gov.au/scientific-topics/community-safety/flood/wofs/about-wofs>`__. Le produit WOfS utilise un algorithme automatisé de cartographie de l'eau pour identifier l'eau dans les images Landsat 8.

source: Load the WOfS feature layer product and Landsat 8 data
fr: Charger le produit de couche d'entités WOfS et les données Landsat 8

source: Identify water pixels from WOfS
fr: Identifier les pixels d'eau de WOfS

source: Plot a true-colour image using Landsat data
fr: Tracez une image en couleurs vraies à l'aide des données Landsat

source: Plot the water body area for the same area using WOfS data
fr: Tracez la superficie du plan d'eau pour la même zone à l'aide des données WOfS

source: Customise the plots
fr: Personnalisez les tracés

source: At the conclusion of this exercise, you will be able to determine the extent of water bodies using the WOfS product.
fr: À l'issue de cet exercice, vous serez en mesure de déterminer l'étendue des plans d'eau à l'aide du produit WOfS.

source: In your **Training folder**, create a new Python 3 notebook. Name it ``Water_extent_exercise.ipynb``. For more instructions on creating a new notebook, see the `instructions from Session 2 <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__.
fr: Dans votre dossier de **Training**, créez un nouveau bloc-notes Python 3. Nommez-le ``Water_extent_exercise.ipynb``. Pour plus d'instructions sur la création d'un nouveau bloc-notes, consultez les `instructions de la session 2 <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__.

source: In this exercise, we import one new function, ``wofs_fuser``. ``wofs_fuser`` ensures WOfS data between scenes is combined correctly.
fr: Dans cet exercice, nous importons une nouvelle fonction, ``wofs_fuser``. ``wofs_fuser`` garantit que les données WOfS entre les scènes sont correctement combinées.

source: In the next cell, enter the following code, and then run it to select an area and time. In this exercise, we use a central point and buffer to define our area of interest, similar to what we did in the `Session 5 exercise <../session_5/02_vegetation_exercise.ipynb#Select-area-of-interest>`__.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour sélectionner une zone et une heure. Dans cet exercice, nous utilisons un point central et un tampon pour définir notre zone d'intérêt, similaire à ce que nous avons fait dans l'exercice `Session 5 <../session_5/02_vegetation_exercise.ipynb#Select-area-of-interest>`__.

source: The only difference here is that we provide a latitude buffer and a longitude buffer. In this example, they have the same value. However, choosing different buffer values allows you to select rectangular areas of interest, rather than squares.
fr: La seule différence ici est que nous fournissons un tampon de latitude et un tampon de longitude. Dans cet exemple, ils ont la même valeur. Cependant, le choix de différentes valeurs de tampon vous permet de sélectionner des zones d'intérêt rectangulaires plutôt que des carrés.

source: Recall code lines beginning with ``#`` are comments. They help explain the code, and can be removed or added without impacting the actual Python scripts.
fr: Les lignes de code de rappel commençant par ``#`` sont des commentaires. Ils aident à expliquer le code et peuvent être supprimés ou ajoutés sans affecter les scripts Python réels.

source: In the next cell, enter the following code, and then run it to show the area on a map. Since we have defined our area using the variables ``lon_range`` and ``lat_range``, we can use those instead of typing out ``(lat - lat_buffer, lat + lat_buffer)`` and ``(lon - lon_buffer, lon + lon_buffer)`` again.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour afficher la zone sur une carte. Puisque nous avons défini notre zone en utilisant les variables ``lon_range`` et ``lat_range``, nous pouvons les utiliser au lieu de taper ``(lat - lat_buffer, lat + lat_buffer)`` et ``(lon - lon_buffer, lon + lon_buffer)`` à nouveau.

source: Notice ``lat_range``, ``lon_range`` and ``time`` were all defined in the previous cell, so we can use them as variables here. We will use them to create a **query**.
fr: Remarquez que ``lat_range``, ``lon_range`` et ``time`` ont tous été définis dans la cellule précédente, nous pouvons donc les utiliser comme variables ici. Nous les utiliserons pour créer une **query**.

source: The ``query`` variable below is a Python dictionary. It can be used to store parameters. Creating an object variable such as ``query`` makes it possible to reuse parameters in various functions that accept the same input parameters.
fr: La variable ``query`` ci-dessous est un dictionnaire Python. Il peut être utilisé pour stocker des paramètres. La création d'une variable objet telle que ``query`` permet de réutiliser des paramètres dans diverses fonctions qui acceptent les mêmes paramètres d'entrée.

source: This is useful to us because we can use it to load the Landsat 8 data, and then use it again to load the WOfS data.
fr: Cela nous est utile car nous pouvons l'utiliser pour charger les données Landsat 8, puis l'utiliser à nouveau pour charger les données WOfS.

source: In the next cell, enter the following code, and then run it.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le.

source: Notice the structure of the ``query`` dictionary is slightly different from ``dc.load`` or ``load_ard``. Each parameter name is in quotes ``''`` and is followed by a colon ``:``.
fr: Notez que la structure du dictionnaire ``query`` est légèrement différente de ``dc.load`` ou ``load_ard``. Chaque nom de paramètre est entre guillemets ``''`` et est suivi de deux points ``:``.

source: In the next cell, we load the Landsat and WOfS datasets, naming them ``ds_landsat`` and ``ds_wofs`` respectively.
fr: Dans la cellule suivante, nous chargeons les ensembles de données Landsat et WOfS, en les nommant respectivement ``ds_landsat`` et ``ds_wofs``.

source: In the functions below, we can directly pass the ``query`` object using ``**query`` — this will give all the settings defined in ``query`` to the function.
fr: Dans les fonctions ci-dessous, nous pouvons directement passer l'objet ``query`` en utilisant ``**query`` - cela donnera tous les paramètres définis dans ``query`` à la fonction.

source: The main benefit is that we can use the same ``query`` for both Landsat 8 and WOfS, which saves us typing it again and prevents us from making mistakes.
fr: Le principal avantage est que nous pouvons utiliser la même ``query`` pour Landsat 8 et WOfS, ce qui nous évite de la taper à nouveau et nous évite de faire des erreurs.

source: For Landsat 8, we can use the ``load_ard`` function.
fr: Pour Landsat 8, nous pouvons utiliser la fonction ``load_ard``.

source: For WOfS, we need to use the ``dc.load`` function.
fr: Pour WOfS, nous devons utiliser la fonction ``dc.load``.

source: Understanding the WOfS feature layers
fr: Comprendre les couches d'entités WOfS

source: WOfS feature layers are stored as a binary number, where each digit of the number is independantly set or not based on the presence (1) or absence (0) of a particular feature. Below is a breakdown of which decimal value represent which features.
fr: Les couches d'entités WOfS sont stockées sous forme de nombre binaire, où chaque chiffre du nombre est défini indépendamment ou non en fonction de la présence (1) ou de l'absence (0) d'une entité particulière. Vous trouverez ci-dessous une ventilation de la valeur décimale représentant les fonctionnalités.

source: Attribute
fr: Attribut

source: Decimal value
fr: Valeur décimale

source: No data
fr: Pas de données

source: Non contiguous
fr: Non contigu

source: Sea
fr: Mer

source: Terrain or low solar angle
fr: Terrain ou faible angle solaire

source: High slope
fr: Pente élevée

source: Cloud shadow
fr: Ombre de nuage

source: Cloud
fr: Nuage

source: Water
fr: L'eau

source: For example, a value of 128 indicates that water were observed for the pixel, whereas a value of 32 would indicate cloud shadow.
fr: Par exemple, une valeur de 128 indique que de l'eau a été observée pour le pixel, tandis qu'une valeur de 32 indiquerait une ombre de nuage.

source: In the next cell we will extract only the water features from the WOfS data. This is done by finding values where the ``water`` measurement equals 128. In Python, we can find which pixels have a value of 128 by using the ``==`` expression:
fr: Dans la cellule suivante, nous extrairons uniquement les caractéristiques de l'eau des données WOfS. Cela se fait en trouvant des valeurs où la mesure ``water`` est égale à 128. En Python, nous pouvons trouver quels pixels ont une valeur de 128 en utilisant l'expression ``==``

source: The ``ds_valid_water`` array does not contain the decimal values of the WOfS feature layers. Instead, it has a value of ``False`` if the pixel was not water, and ``True`` if it was water. You can check this by viewing the ``ds_valid_water`` DataArray.
fr: Le tableau ``ds_valid_water`` ne contient pas les valeurs décimales des couches d'entités WOfS. Au lieu de cela, il a la valeur ``False`` si le pixel n'était pas de l'eau et ``True`` s'il s'agissait de l'eau. Vous pouvez vérifier cela en consultant le DataArray ``ds_valid_water``.

source: The number of pixels can be used for the area of the waterbody if the pixel area is known. We can extract the size of a pixel from the ``resolution`` setting in our ``query``, then divide the area of a single pixel (in square metres) by the number of square meters in a square kilometre.
fr: Le nombre de pixels peut être utilisé pour la zone du plan d'eau si la zone de pixels est connue. Nous pouvons extraire la taille d'un pixel du paramètre ``resolution`` dans notre ``query``, puis diviser la surface d'un pixel unique (en mètres carrés) par le nombre de mètres carrés dans un kilomètre carré.

source: In Python, ``number**2`` returns the squared value of ``number``.
fr: En Python, ``nombre**2`` renvoie la valeur au carré de ``nombre``.

source: Now that we know how much area is covered by one pixel, we can count up the number of water pixels, and multiply it by this value to get the total area covered by water.
fr: Maintenant que nous savons combien de surface est couverte par un pixel, nous pouvons compter le nombre de pixels d'eau et le multiplier par cette valeur pour obtenir la surface totale couverte par l'eau.

source: As we saw above, the ``ds_valid_water`` array contains ``True`` values for water pixels, and ``False`` otherwise. When we use the ``.sum`` function, it counts ``True`` values as 1, and ``False`` as 0. Therefore, the sum will be equal to the total number of water pixels for that timestep.
fr: Comme nous l'avons vu ci-dessus, le tableau ``ds_valid_water`` contient des valeurs ``True`` pour les pixels d'eau, et ``False`` sinon. Lorsque nous utilisons la fonction ``.sum``, elle compte les valeurs ``True`` comme 1 et ``False`` comme 0. Par conséquent, la somme sera égale au nombre total de pixels d'eau pour ce pas de temps.

source: Below, we set the dimensions as ``x`` and ``y`` to make sure we sum up all the pixels over the spatial dimensions. This means we get one pixel sum for each timestep. This will let us track how the water area changes over time.
fr: Ci-dessous, nous définissons les dimensions comme ``x`` et ``y`` pour nous assurer que nous additionnons tous les pixels sur les dimensions spatiales. Cela signifie que nous obtenons une somme de pixels pour chaque pas de temps. Cela nous permettra de suivre l'évolution de la zone d'eau au fil du temps.

source: Plot time series
fr: Tracer des séries chronologiques

source: Now that we have the area of water in each observation, we can plot a time series to help us identify dates where the was more or less water within the area of interest.
fr: Maintenant que nous avons la superficie de l'eau dans chaque observation, nous pouvons tracer une série chronologique pour nous aider à identifier les dates où il y avait plus ou moins d'eau dans la zone d'intérêt.

source: Below, there is code to set-up, display and customise the plot. The settings are as follows:
fr: Ci-dessous, il y a un code pour configurer, afficher et personnaliser le tracé. Les paramètres sont les suivants:

source: ``plt.figure(figsize=(18, 4))``: set up a figure object to contain the plot, and make it 18 inches long and 4 inches high
fr: ``plt.figure(figsize=(18, 4))``: configurez un objet figure pour contenir l'intrigue, et faites-le 18 pouces de long et 4 pouces de haut

source: ``ds_valid_water_area.plot(marker='o', color='#9467bd')``: plot the water area data with circular markers in purple (HEX colour code ``#9467bd``)
fr: ``ds_valid_water_area.plot(marker='o', color='#9467bd')``: tracez les données de surface d'eau avec des marqueurs circulaires en violet (code couleur HEX ``#9467bd``)

source: ``plt.title('Time Series Analysis of water observed area')``: Give the plot a title
fr: ``plt.title('Time Series Analysis of Water Observation Area')``: Donnez un titre à la parcelle

source: ``plt.xlabel('Dates')``: Label the x-axis
fr: ``plt.xlabel('Dates')``: étiqueter l'axe des x

source: ``plt.ylabel('Waterbody area (km$^2$)')``: Label the y-axis. The ``$`` symbols allow the use of LaTeX, a mathematical typesetting language
fr: ``plt.ylabel('Waterbody area (km$^2$)')``: Nommez l'axe des y. Les symboles ``$`` permettent l'utilisation de LaTeX, un langage de composition mathématique

source: ``plt.tight_layout()``: Formats the image so that all axes can be clearly seen
fr: ``plt.tight_layout()``: Formate l'image pour que tous les axes soient clairement visibles

source: From the graph above you can choose any timestep (between 0 and 45) to display the result on the for both WOfS and Landsat 8.
fr: À partir du graphique ci-dessus, vous pouvez choisir n'importe quel pas de temps (entre 0 et 45) pour afficher le résultat sur WOfS et Landsat 8.

source: For example, let us look at the fifth timestep, ``timestep = 4``.
fr: Par exemple, regardons le cinquième pas de temps, ``timestep = 4``.

source: This code uses some additional settings to customise the plot, including allowing to have two plots together. If you want to know more about making this kind of plot, please ask the instructors during a live session.
fr: Ce code utilise des paramètres supplémentaires pour personnaliser le tracé, notamment en permettant d'avoir deux tracés ensemble. Si vous souhaitez en savoir plus sur la réalisation de ce type d'intrigue, veuillez demander aux instructeurs lors d'une session en direct.

source: Try different ``timestep`` values — can you find an image where the lake is dried out?
fr: Essayez différentes valeurs de ``timestep`` - pouvez-vous trouver une image où le lac est asséché?

source: Congratulations! You have made your own water extent notebook. It is comparible to `the existing Sandbox water extent notebook <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/blob/master/Real_world_examples/Water_extent.ipynb>`__.
fr: Toutes nos félicitations! Vous avez créé votre propre carnet d'étendue d'eau. Il est comparable au «cahier d'étendue d'eau Sandbox existant <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/blob/master/Real_world_examples/Water_extent.ipynb>« __.

source: You’ve now built your second case study! You make like to reflect on what was similar and different between the two. Are there any pieces of code you could reuse for a new analysis? How might you modify your case studies to do more complex analysis?
fr: Vous avez maintenant construit votre deuxième étude de cas! Vous avez envie de réfléchir à ce qui était similaire et différent entre les deux. Y a-t-il des morceaux de code que vous pourriez réutiliser pour une nouvelle analyse? Comment pourriez-vous modifier vos études de cas pour faire des analyses plus complexes?

source: Double-click the **Water_extent.ipynb** notebook to open it
fr: Double-cliquez sur le bloc-notes **Water_extent.ipynb** pour l'ouvrir

source: If you want to significantly modify it, we recommend you make a copy, like you did in `Session 1 <../session_1/04_running_a_notebook.ipynb#Create-a-copy-of-the-notebook>`_.
fr: Si vous souhaitez le modifier de manière significative, nous vous recommandons d'en faire une copie, comme vous l'avez fait dans `Session 1 <../session_1/04_running_a_notebook.ipynb#Create-a-copy-of-the-notebook>`__.

source: Session 6 Quiz and Solution
fr: Session 6 Quiz et solution

source: In Session 6, you used the case study framework to construct an analysis on water extent. This involved using the Water Observations from Space (WOfS) dataset. The WOfS dataset identifies water pixels, which you used to calculate the area of water. The water extent was plotted next to an RGB map of the same area.
fr: Dans la session 6, vous avez utilisé le cadre d'étude de cas pour construire une analyse sur l'étendue de l'eau. Cela impliquait l'utilisation du jeu de données d'observation de l'eau depuis l'espace (WOfS). L'ensemble de données WOfS identifie les pixels d'eau, que vous avez utilisés pour calculer la superficie de l'eau. L'étendue de l'eau a été tracée à côté d'une carte RVB de la même zone.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://docs.google.com/forms/d/e/1FAIpQLSfUWOI56hUsK-nrbtUd_r39DqXD2oXm7ULgdmhGp6YvYlvGtg/viewform?usp=sf_link>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `compléter le quiz <https://docs.google.com/forms/d/e/1FAIpQLSfUWOI56hUsK-nrbtUd_r39DqXD2oXm7ULgdmhGp6YvYlvGtg/viewform?usp=sf_link>`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: The quiz will ask you to use the notebook you developed for this session’s exercise on plotting water extent using WOfS data. If you would like to confirm that your notebook works as expected, you can check it against the solution notebook provided below.
fr: Le quiz vous demandera d'utiliser le cahier que vous avez développé pour l'exercice de cette session sur le traçage de l'étendue de l'eau à l'aide des données WOfS. Si vous souhaitez confirmer que votre ordinateur portable fonctionne comme prévu, vous pouvez le comparer au bloc-notes de solution fourni ci-dessous.

source: `Download the solution notebook for the Session 6 exercise <../_static/session_6/Water_extent_exercise-solution.ipynb>`__
fr: `Téléchargez le cahier de solution pour l'exercice Session 6 <../_static/session_6/Water_extent_exercise-solution.ipynb>`__
