Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: You may recall from the `introduction to satellite products <../session_2/01_products_intro.ipynb>`__ that the range of data acquired by a satellite is defined by its **bands**. Bands are subdivisions of the electromagnetic spectrum dependent on the sensors on the satellite.
fr: Vous vous souviendrez peut-être de `l'introduction aux produits satellites <../session_2/01_products_intro.ipynb>`__ que la plage de données acquises par un satellite est définie par ses **bandes**. Les bandes sont des subdivisions du spectre électromagnétique dépendant des capteurs du satellite.

source: A selection of commonly-used Landsat 8 and Sentinel-2 bands are shown in the table below. We can see the spectral ranges between Landsat 8 and Sentinel-2 are similar, but not the same. Also note the band numbers do not always correspond to the same spectral range.
fr: Une sélection de bandes Landsat 8 et Sentinel-2 couramment utilisées est présentée dans le tableau ci-dessous. Nous pouvons voir que les plages spectrales entre Landsat 8 et Sentinel-2 sont similaires, mais pas les mêmes. Notez également que les numéros de bande ne correspondent pas toujours à la même plage spectrale.

source: *Sources:* `Landsat 8 bands <https://www.usgs.gov/media/images/landsat-8-band-designations>`__, `Sentinel-2 bands <https://earth.esa.int/web/sentinel/technical-guides/sentinel-2-msi/msi-instrument>`__
fr: * Sources: * `bandes Landsat 8 <https://www.usgs.gov/media/images/landsat-8-band-designations>`__, `bandes Sentinel-2 <https://earth.esa.int/web/sentinel/technical-guides/sentinel-2-msi/msi-instrument>`__

source: Bands and terrain features
fr: Bandes et caractéristiques du terrain

source: Different types of ground cover absorb and reflect different amounts of radiation along the electromagnetic spectrum. This is dependent on the physical and chemical properties of the surface.
fr: Différents types de couverture du sol absorbent et réfléchissent différentes quantités de rayonnement le long du spectre électromagnétique. Cela dépend des propriétés physiques et chimiques de la surface.

source: For example:
fr: Par exemple:

source: **Water:** Open water bodies generally reflect light in the visible spectrum, and absorb more short-wave infrared than near-infrared radiation. This can change if the water is turbid.
fr: **Eau:** Les plans d'eau ouverts reflètent généralement la lumière dans le spectre visible et absorbent plus d'infrarouge à ondes courtes que le rayonnement proche infrarouge. Cela peut changer si l'eau est trouble.

source: **Snow:** Ice and snow reflect most visible radiation, but do not reflect much short-wave infrared. Reflectance measurements depend on snow granule size and liquid water content.
fr: **Neige:** La glace et la neige reflètent la plupart des radiations visibles, mais ne reflètent pas beaucoup l'infrarouge à ondes courtes. Les mesures de réflectance dépendent de la taille des granules de neige et de la teneur en eau liquide.

source: **Green vegetation:** Chlorophyll, a pigment in plants, absorbs a lot of visible light, including red light. When plants are healthy, they strongly reflect near-infrared light.
fr: **Végétation verte:** La chlorophylle, pigment des plantes, absorbe beaucoup de lumière visible, y compris la lumière rouge. Lorsque les plantes sont saines, elles réfléchissent fortement la lumière proche infrarouge.

source: **Bare soil:** The mineral composition of soil can be characterised using the visible and near-infrared spectrum. Soil moisture content can greatly influence the results.
fr: **Sol nu:** La composition minérale du sol peut être caractérisée à l'aide du spectre visible et proche infrarouge. La teneur en humidité du sol peut grandement influencer les résultats.

source: Using these spectral differences, we can calculate ratios between bands to isolate and accentuate the specific terrain feature we are interested in. These metrics are known as band ratios or **band indices**.
fr: En utilisant ces différences spectrales, nous pouvons calculer les rapports entre les bandes pour isoler et accentuer la caractéristique spécifique du terrain qui nous intéresse. Ces mesures sont appelées rapports de bande ou **indices de bande**.

source: In practice, variation within terrain feature classes, as well as the presence of multiple features in one area, can make different types of ground cover difficult to distinguish. This is one of the challenges of spectral data analysis.
fr: En pratique, la variation au sein des classes d'entités de terrain, ainsi que la présence de plusieurs entités dans une zone, peuvent rendre différents types de couverture du sol difficiles à distinguer. C'est l'un des défis de l'analyse des données spectrales.

source: Example: Normalised Difference Vegetation Index (NDVI)
fr: Exemple: Indice de végétation par différence normalisée (NDVI)

source: One of the most widely-used band indices is the Normalised Difference Vegetation Index (NDVI). It is used to show the presence of live green vegetation. Generally, green vegetation has a low red band measurement, as red light is absorbed by chlorophyll. In addition to this, healthy leaf cell structures reflect near-infrared light, giving a high near-infrared (NIR) band measurement.
fr: L'un des indices de bande les plus utilisés est l'indice de végétation par différence normalisée (NDVI). Il est utilisé pour montrer la présence de végétation verte vivante. En général, la végétation verte a une faible bande rouge, car la lumière rouge est absorbée par la chlorophylle. En plus de cela, les structures cellulaires saines des feuilles réfléchissent la lumière proche infrarouge, donnant une mesure de bande proche infrarouge (NIR) élevée.

source: NDVI is therefore typically calculated using a satellite’s NIR band and red band. One value is calculated per pixel.
fr: Le NDVI est donc généralement calculé en utilisant la bande NIR et la bande rouge d’un satellite. Une valeur est calculée par pixel.

source: :nbsphinx-math:`\begin{equation} \text{NDVI} \ = \ \frac{\text{NIR} - \text{Red}}{\text{NIR} + \text{Red}} \end{equation}`
fr: : nbsphinx-math: `\ begin {equation} \ text {NDVI} \ = \ \ frac {\ text {NIR} - \ text {Red}} {\ text {NIR} + \ text {Red}} \ end { équation} `

source: We see the index is calculated by the difference :math:`(\text{NIR} - \text{Red})` divided by the sum :math:`(\text{NIR} + \text{Red})`. This normalises the index: all values will fall between :math:`-1` and :math:`1`.
fr: Nous voyons que l'indice est calculé par la différence: math:`(\text{NIR} - \text{Red})` divisé par la somme: math:`(\text{NIR} + \text{Red})`. Cela normalise l'index: toutes les valeurs seront comprises entre: math:`-1` et: math:`1`.

source: Large values of NDVI will occur for pixels where NIR is high and red is low. Conversely, NDVI can be close to 0 or even negative where NIR is low and red is high. This means we interpret NDVI as follows:
fr: De grandes valeurs de NDVI se produiront pour les pixels où NIR est élevé et rouge est faible. Inversement, le NDVI peut être proche de 0 ou même négatif lorsque le NIR est faible et le rouge est élevé. Cela signifie que nous interprétons le NDVI comme suit:

source: :nbsphinx-math:`\begin{align} \text{NDVI} &> 0, \text{ or close to }1 = \text{green vegetation}\\ \text{NDVI} &\leq 0 = \text{not green vegetation; water, soil, etc.} \end{align}`
fr: : nbsphinx-math: `\ begin {align} \ text {NDVI} &> 0, \ text {ou proche de} 1 = \ text {végétation verte} \\ \ text {NDVI} & \ leq 0 = \ text { pas de végétation verte; eau, sol, etc.} \ end {align} `

source: But what is green vegetation? The US Geological Survey provides a more specific `guide to interpreting NDVI <https://www.usgs.gov/land-resources/eros/phenology/science/ndvi-foundation-remote-sensing-phenology?qt-science_center_objects=0#qt-science_center_objects>`__.
fr: Mais qu'est-ce que la végétation verte? Le US Geological Survey fournit un `guide plus spécifique pour interpréter le NDVI <https://www.usgs.gov/land-resources/eros/phenology/science/ndvi-foundation-remote-sensing-phenology?qt-science_center_objects=0# qt-science_center_objects>`__.

source: Areas of barren rock, sand, or snow usually show very low NDVI values (for example, 0.1 or less). Sparse vegetation such as shrubs and grasslands or senescing crops may result in moderate NDVI values (approximately 0.2 to 0.5). High NDVI values (approximately 0.6 to 0.9) correspond to dense vegetation such as that found in temperate and tropical forests or crops at their peak growth stage.
fr: Les zones de roche stérile, de sable ou de neige affichent généralement des valeurs NDVI très faibles (par exemple, 0,1 ou moins). Une végétation clairsemée telle que des arbustes et des prairies ou des cultures sénescentes peut entraîner des valeurs NDVI modérées (environ 0,2 à 0,5). Des valeurs NDVI élevées (environ 0,6 à 0,9) correspondent à une végétation dense telle que celle trouvée dans les forêts tempérées et tropicales ou les cultures à leur stade de croissance maximal.

source: You can see even this definition does not exhaustively cover every kind of vegetation. It is important to remember that Earth observation data analysis is sensitive to the dataset location and time. The nature of climate and environment variations across the globe, and even just within the African continent, mean that band indices like NDVI need to be interpreted with knowledge and context of the area.
fr: Vous pouvez voir que même cette définition ne couvre pas de manière exhaustive tous les types de végétation. Il est important de se rappeler que l'analyse des données d'observation de la Terre est sensible à l'emplacement et à l'heure de l'ensemble de données. La nature des variations climatiques et environnementales à travers le monde, et même uniquement sur le continent africain, signifie que les indices de bande comme le NDVI doivent être interprétés avec les connaissances et le contexte de la zone.

source: Normalising band indices so their values fall between -1 and 1 gives a relative scale that allows for easier data analysis. Values of the index can be better compared between different points in the area of analysis, and across time periods.
fr: La normalisation des indices de bande afin que leurs valeurs se situent entre -1 et 1 donne une échelle relative qui permet une analyse des données plus facile. Les valeurs de l'indice peuvent être mieux comparées entre différents points de la zone d'analyse et entre les périodes.

source: Below we have two plots of an area with river distributaries in Guinea-Bissau, a country that experiences monsoonal-like seasons. We see the amount of vegetation as detected by NDVI fluctuates over time. The top image shows NDVI in April, at the end of the dry season. NDVI readings are much lower than when compared to the same area in November (bottom image), after several months of rain during the wet season.
fr: Ci-dessous, nous avons deux parcelles d'une zone de distribution fluviale en Guinée-Bissau, un pays qui connaît des saisons de mousson. Nous constatons que la quantité de végétation détectée par NDVI fluctue avec le temps. L'image du haut montre le NDVI en avril, à la fin de la saison sèche. Les lectures de NDVI sont bien inférieures à celles de la même zone en novembre (image du bas), après plusieurs mois de pluie pendant la saison des pluies.

source: Notice the RGB images may show parts of the area to be visibly ‘dry’ or ‘lush’, but in places where this is less obvious, it is easier to analyse NDVI than the multispectral RGB dataset.
fr: Notez que les images RVB peuvent montrer que certaines parties de la zone sont visiblement «sèches» ou «luxuriantes», mais dans les endroits où cela est moins évident, il est plus facile d’analyser le NDVI que le jeu de données RVB multispectral.

source: *NDVI calculated from Sentinel-2 data in Guinea-Bissau in April 2018 (top left) and November 2018 (bottom left). The NDVI values reflect typical seasonal patterns in a quantitative manner.*
fr: * NDVI calculé à partir des données Sentinel-2 en Guinée-Bissau en avril 2018 (en haut à gauche) et en novembre 2018 (en bas à gauche). Les valeurs NDVI reflètent les tendances saisonnières typiques de manière quantitative. *

source: We see in the table above that satellites have slightly different band ranges for the same band name (e.g. 'Red' for Landsat 8 is slightly different than 'Red' for Sentinel-2). This means they will produce different band index values even at approximately the same time and place. It is best practice to compare like datasets only.
fr: Nous voyons dans le tableau ci-dessus que les satellites ont des gammes de bande légèrement différentes pour le même nom de bande (par exemple, ``Red`` pour Landsat 8 est légèrement différent de ``Red`` pour Sentinel-2). Cela signifie qu'ils produiront des valeurs d'indice de bande différentes, même approximativement au même moment et au même endroit. Il est recommandé de comparer uniquement des ensembles de données similaires.

source: Band indices in research
fr: Indices de bande dans la recherche

source: NDVI is just one example of a useful band index. There are many other band indices used in Earth observation research to draw out terrain features. Selecting a band index is often dependent on environmental conditions and research purpose.
fr: NDVI n'est qu'un exemple d'indice de bande utile. Il existe de nombreux autres indices de bande utilisés dans la recherche d'observation de la Terre pour identifier les caractéristiques du terrain. Le choix d'un indice de bande dépend souvent des conditions environnementales et du but de la recherche.

source: **Vegetation:** As described above, NDVI is a good baseline vegetation index. It is simple to calculate, and only requires two bands — red and NIR. However, the Enhanced Vegetation Index (EVI) is often more accurate. EVI is calculated with three bands — red, blue and NIR — and requires some coefficients for scaling.
fr: **Végétation:** Tel que décrit ci-dessus, le NDVI est un bon indice de végétation de base. Il est simple à calculer et ne nécessite que deux bandes - rouge et NIR. Cependant, l'indice de végétation amélioré (EVI) est souvent plus précis. L'EVI est calculé avec trois bandes - rouge, bleu et NIR - et nécessite certains coefficients pour la mise à l'échelle.

source: In arid regions, where vegetative cover is low, consider using the Soil Adjusted Vegetation Index (SAVI), which incorporates a soil brightness correction factor.
fr: Dans les régions arides, où la couverture végétale est faible, envisagez d'utiliser l'indice de végétation ajusté au sol (SAVI), qui intègre un facteur de correction de la luminosité du sol.

source: **Urbanisation:** Human settlements can be identified through urbanisation indices, one of which is the Normalised Difference Built-up Index (NDBI). NDBI uses SWIR 1 and NIR bands:
fr: **Urbanisation:** Les établissements humains peuvent être identifiés grâce aux indices d'urbanisation, dont l'un est l'indice de construction par différence normalisée (NDBI). NDBI utilise les bandes SWIR 1 et NIR:

source: However, NDBI can be confused between built-up areas and bare soil, so in arid and semi-arid regions where this is problematic, it may be better to use the Dry Bare Soil Index (DBSI).
fr: Cependant, le NDBI peut être confondu entre les zones bâties et le sol nu, donc dans les régions arides et semi-arides où cela est problématique, il peut être préférable d'utiliser l'indice de sol sec et nu (DBSI).

source: \text{DBSI} \ = \ \frac{\text{SWIR 1} - \text{Green}}{\text{SWIR 1} + \text{Green}} \ - \ \text{NDVI}
fr: \ text {DBSI} \ = \ \ frac {\ text {SWIR 1} - \ text {Vert}} {\ text {SWIR 1} + \ text {Vert}} \ - \ \ text {NDVI}

source: **Water bodies:** Delineation between water and land can be defined using the Modified Normalised Difference Water Index (MNDWI). It is calculated using green and SWIR 1 bands:
fr: **Plans d'eau:** La délimitation entre l'eau et la terre peut être définie à l'aide de l'indice des eaux à différence normalisée modifiée (MNDWI). Il est calculé en utilisant les bandes vertes et SWIR 1:

source: \text{MNDWI} \ = \ \frac{\text{Green} - \text{SWIR 1}}{\text{Green} + \text{SWIR 1}}
fr: \ text {MNDWI} \ = \ \ frac {\ text {Vert} - \ text {SWIR 1}} {\ text {Vert} + \ text {SWIR 1}}

source: This should not be confused with indices for monitoring water content in vegetation.
fr: Cela ne doit pas être confondu avec les indices de surveillance de la teneur en eau de la végétation.

source: It is important to remember band indices are not infallible; their usefulness relies on appropriate index selection and sensible interpretation. However, as the field of remote sensing grows, ongoing research into differentiating terrain types with different band combinations give rise to more nuanced and accurate data analysis. For instance, it is common to use more than one index to help distinguish feature classes with similar spectral characteristics.
fr: Il est important de se rappeler que les indices de bande ne sont pas infaillibles; leur utilité repose sur une sélection d'indices appropriée et une interprétation sensée. Cependant, à mesure que le domaine de la télédétection se développe, les recherches en cours pour différencier les types de terrain avec différentes combinaisons de bandes donnent lieu à une analyse des données plus nuancée et plus précise. Par exemple, il est courant d'utiliser plus d'un index pour aider à distinguer les classes d'entités ayant des caractéristiques spectrales similaires.

source: Band indices are an integral part of spatial data analysis, and are an efficient method of distinguishing different types of land cover. In the following sections, we will calculate NDVI for a cloud-free composite using the Sandbox.
fr: Les indices de bande font partie intégrante de l'analyse des données spatiales et constituent une méthode efficace pour distinguer différents types de couverture terrestre. Dans les sections suivantes, nous calculerons le NDVI pour un composite sans cloud à l'aide du bac à sable.

source: Calculating NDVI: Part 1
fr: Calcul du NDVI: partie 1

source: This exercise follows on from the previous section. In the `final exercise of the previous session <../session_3/03_geomedian_exercise.ipynb>`__, you constructed a notebook to create geomedian composite.
fr: Cet exercice fait suite à la section précédente. Dans le `dernier exercice de la session précédente <../session_3/03_geomedian_exercise.ipynb>`__, vous avez construit un cahier pour créer un composite géomédien.

source: In this section, we will create a new notebook based on the notebook from the previous section. Most of the code will remain unchanged, but we will change the area of interest and time extent. We will also add steps to resample the new dataset and create a geomedian. In the next section, we will calculate and plot NDVI.
fr: Dans cette section, nous allons créer un nouveau bloc-notes basé sur le bloc-notes de la section précédente. La plupart du code restera inchangé, mais nous changerons la zone d'intérêt et la durée. Nous ajouterons également des étapes pour rééchantillonner le nouvel ensemble de données et créer un géomédian. Dans la section suivante, nous calculerons et tracerons le NDVI.

source: We will be using the notebook we created in the previous section, `Create a geomedian composite <../session_3/03_geomedian_exercise.ipynb>`_. If you have not already set up a copy of the notebook called ``Geomedian_composite.ipynb`` with the required packages and functions, follow the instructions in previous section. Ensure you have completed all the steps, including loading the Sentinel-2 dataset.
fr: Nous utiliserons le notebook que nous avons créé dans la section précédente, `Créer un composite géomédien <../session_3/03_geomedian_exercise.ipynb>`__. Si vous n'avez pas encore configuré une copie du notebook appelée ``Geomedian_composite.ipynb`` avec les packages et fonctions requis, suivez les instructions de la section précédente. Assurez-vous d'avoir terminé toutes les étapes, y compris le chargement de l'ensemble de données Sentinel-2.

source: Before you continue with the next step,
fr: Avant de passer à l'étape suivante,

source: Log in to the Sandbox and open the **Training** folder.
fr: Connectez-vous au Sandbox et ouvrez le dossier **Training**.

source: Make a copy of the ``Geomedian_composite.ipynb`` notebook.
fr: Faites une copie du cahier ``Geomedian_composite.ipynb``.

source: Rename the notebook to ``Calculate_ndvi.ipynb``.
fr: Renommez le notebook en ``Calculate_ndvi.ipynb``.

source: More details on how to `create a copy of a notebook and rename it <https://training.digitalearthafrica.org/en/latest/session_1/04_running_a_notebook.html#Create-a-copy-of-the-notebook>`__.
fr: Plus de détails sur la façon de `créer une copie d'un carnet de notes et de le renommer <https://training.digitalearthafrica.org/en/latest/session_1/04_running_a_notebook.html#Create-a-copy-of-the-notebook>`__ .

source: Clearing the notebook
fr: Effacer le cahier

source: We will need to remove any output from previous runs of the notebook.
fr: Nous devrons supprimer toute sortie des exécutions précédentes du notebook.

source: Select **Kernel -> Restart Kernel and Clear All Outputs…**.
fr: Sélectionnez **Kernel -> Restart Kernel and Clear All Outputs…**.

source: This notebook is still set up to run the Session 3 exercise, so you’ll need to follow the instructions below to modify it. Work cell by cell and pay attention to what needs to be changed.
fr: Ce bloc-notes est toujours configuré pour exécuter l'exercice Session 3. Vous devrez donc suivre les instructions ci-dessous pour le modifier. Travaillez cellule par cellule et faites attention à ce qui doit être changé.

source: Run the first cell, which contains the packages and functions for the analysis. No need to change anything here.
fr: Exécutez la première cellule, qui contient les packages et les fonctions pour l'analyse. Pas besoin de changer quoi que ce soit ici.

source: For the ``dc = datacube.Datacube`` command, change the app name to ``"Calculate_ndvi"``. It should look like:
fr: Pour la commande ``dc = datacube.Datacube``, changez le nom de l'application en ``"Calculate_ndvi"``. Cela devrait ressembler à:

source: Change the x and y values to those shown below and run the cell.
fr: Remplacez les valeurs x et y par celles indiquées ci-dessous et exécutez la cellule.

source: Change the time in the ``load_ard`` function to ``("2019-01", "2019-12")``.
fr: Changez l'heure dans la fonction ``load_ard`` en ``("2019-01", "2019-12")``.

source: Remove the option ``min_gooddata=0.7``.
fr: Supprimez l'option ``min_gooddata = 0.7``.

source: If you completed steps 2, 3 and 4, your load cell should look like
fr: Si vous avez terminé les étapes 2, 3 et 4, votre cellule de pesée devrait ressembler à

source: Run the cell. The load should return 71 time steps.
fr: Exécutez la cellule. La charge doit renvoyer 71 pas de temps.

source: The fifth cell of the notebook contains an ``rgb`` command to plot the loaded data. To match our example below, modify this cell so that it matches the code below:
fr: La cinquième cellule du notebook contient une commande ``rgb`` pour tracer les données chargées. Pour correspondre à notre exemple ci-dessous, modifiez cette cellule afin qu'elle corresponde au code ci-dessous:

source: This will plot images for the 1st, 6th and 8th timestep of the loaded data (remember that Python starts counting at 0). Your image should match the one below.
fr: Cela tracera les images pour le 1er, le 6e et le 8e pas de temps des données chargées (rappelez-vous que Python commence à compter à 0). Votre image doit correspondre à celle ci-dessous.
