Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: ``slice()`` specifies which part of the coordinate we are taking. In this case, we want to slice ``time`` between 2013 – 2015, and then again 2016 – 2018. Recall we named the halfway point ``time_baseline``.
fr: ``slice()`` spécifie quelle partie de la coordonnée nous prenons. Dans ce cas, nous voulons découper le ``time`` entre 2013 - 2015, puis à nouveau 2016 - 2018. Rappelons que nous avons nommé le point à mi-chemin ``time_baseline``.

source: We use ``sel()`` and ``slice()`` to create two new datasets:
fr: Nous utilisons ``sel()`` et ``slice()`` pour créer deux nouveaux ensembles de données:

source: ``baseline_sample``: EVI from 2013 to 2015
fr: ``baseline_sample``: EVI de 2013 à 2015

source: ``postbaseline_sample``: EVI from 2016 to 2018
fr: ``postbaseline_sample``: EVI de 2016 à 2018

source: To do this, enter the following code in the next cell.
fr: Pour ce faire, entrez le code suivant dans la cellule suivante.

source: Here, using ``time[0]`` will give us the first date that we stored in the ``time`` variable (``'2013-01-01'``), and ``time[1]`` will give us the second date we stored in the ``time`` variable (``'2018-12-0'``). By using the ``time`` variable directly, we ensure that the code will work if those dates are changed and the notebook is rerun.
fr: Ici, utiliser ``time[0]`` nous donnera la première date que nous avons stockée dans la variable ``time`` (``'2013-01-01'``), et ``time[1]`` nous donnera la deuxième date que nous avons stockée dans la variable ``time`` (``'2018-12-0'``). En utilisant directement la variable ``time``, nous nous assurons que le code fonctionnera si ces dates sont modifiées et que le notebook est réexécuté.

source: Carefully check all your ``.``, ``,``, ``()`` pairs, and ``' '`` pairs in the above code to avoid generating errors.
fr: Vérifiez soigneusement toutes vos paires ``.``, ``,``, ``()`` et ``' '`` dans le code ci-dessus pour éviter de générer des erreurs.

source: Now we have our ‘before’ and ‘after’ datasets, we can compare them for change in EVI. To do this, we will form a composite for each half of the dataset. Then we will calculate the differences in the average EVI for each pixel.
fr: Maintenant que nous avons nos ensembles de données «avant» et «après», nous pouvons les comparer pour le changement dans EVI. Pour ce faire, nous allons former un composite pour chaque moitié de l'ensemble de données. Ensuite, nous calculerons les différences de l'EVI moyen pour chaque pixel.

source: The composite method we are using is the **mean** (average).
fr: La méthode composite que nous utilisons est la **moyenne** (mean).

source: In the next cell, enter the following code, and then run it to create mean composites for the two time periods.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour créer des composites moyens pour les deux périodes.

source: Now we need to subtract the first time period EVI mean composite, ``baseline_composite``, from the second time period EVI mean composite, ``postbaseline_composite``. This will determine the change in EVI between the two time periods.
fr: Maintenant, nous devons soustraire la première période de temps EVI moyenne composite, ``baseline_composite``, de la deuxième période EVI moyenne composite, ``postbaseline_composite``. Cela déterminera le changement d'EVI entre les deux périodes.

source: In the next cell, enter the following code, and then run it to determine the change in the vegetation index.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour déterminer la modification de l'indice de végétation.

source: In the next cell, enter the following code, and then run it to show the difference between the mean composites for the time periods. This will allow us to see where the vegetation index increased or decreased and by how much.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour afficher la différence entre les composites moyens pour les périodes. Cela nous permettra de voir où l'indice de végétation a augmenté ou diminué et de combien.

source: Your plot should look like the image below.
fr: Votre intrigue doit ressembler à l'image ci-dessous.

source: Interpreting the plot
fr: Interpréter l'intrigue

source: In the code above, the colour for the plot is set using the ``cmap='RdBu'`` setting in the ``diff_mean_composites.plot.imshow()`` function call. Here, ``RdBu`` corresponds to a Red-Blue colour-map, with lower values appearing as red, and higher values appearing as blue.
fr: Dans le code ci-dessus, la couleur du tracé est définie à l'aide du paramètre ``cmap='RdBu'`` 'dans l'appel de fonction ``diff_mean_composites.plot.imshow()``. Ici, ``RdBu`` correspond à une carte de couleurs rouge-bleu, avec des valeurs inférieures apparaissant en rouge et des valeurs plus élevées en bleu.

source: The areas in **blue** (positive change) correspond to **vegetation increase** as measured by EVI. There is more vegetation in these areas in the 2016-2018 sample than the 2013-2015 sample.
fr: Les zones en **bleu** (changement positif) correspondent à **l'augmentation de la végétation** telle que mesurée par EVI. Il y a plus de végétation dans ces zones dans l'échantillon 2016-2018 que dans l'échantillon 2013-2015.

source: The areas in **red** (negative change) correspond to **vegetation decrease** as measured by EVI. There is less vegetation in these areas in the 2016-2018 sample than the 2013-2015 sample.
fr: Les zones en **rouge** (changement négatif) correspondent à la **diminution de la végétation** telle que mesurée par EVI. Il y a moins de végétation dans ces zones dans l'échantillon 2016-2018 que dans l'échantillon 2013-2015.

source: What conclusions can you draw about the changes in the landscape from this plot? What other information might you need to help you assess it?
fr: Quelles conclusions pouvez-vous tirer des changements du paysage à partir de cette intrigue? De quelles autres informations pourriez-vous avoir besoin pour vous aider à l'évaluer?

source: Congratulations! You have made your own vegetation change detection notebook. It is comparable to `the existing Sandbox vegetation change detection notebook <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/blob/master/Real_world_examples/Vegetation_change_detection.ipynb>`__. The existing notebook may look daunting, but it includes many of the steps that you have just done!
fr: Toutes nos félicitations! Vous avez créé votre propre cahier de détection des changements de végétation. Il est comparable au «cahier de détection des changements de végétation Sandbox existant <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/blob/master/Real_world_examples/Vegetation_change_detection.ipynb>« __. Le cahier existant peut sembler intimidant, mais il comprend de nombreuses étapes que vous venez de faire!

source: You now understand how to structure a complete case study – you can calculate a relevant band index and indentify meaningful changes in that index over time.
fr: Vous savez maintenant comment structurer une étude de cas complète - vous pouvez calculer un indice de bande pertinent et identifier les changements significatifs de cet index au fil du temps.

source: If you’re curious about how the existing case study works, you can open and run it in the Sandbox:
fr: Si vous êtes curieux de savoir comment fonctionne l'étude de cas existante, vous pouvez l'ouvrir et l'exécuter dans le bac à sable:

source: From the main Sandbox folder, open the **Real_world_examples** folder
fr: Depuis le dossier Sandbox principal, ouvrez le dossier **Real_world_examples**

source: Double-click the **Vegetation_change_detection.ipynb** notebook to open it
fr: Double-cliquez sur le notebook **Vegetation_change_detection.ipynb** pour l'ouvrir

source: The notebook has already been run, so you can read through it step by step. However, you may find it valuable to clear the outputs and run each cell step by step to see how it works. You can do this by clicking **Kernel -> Restart Kernel and Clear All Outputs**. When asked whether you want to restart the kernel, click **Restart**.
fr: Le notebook a déjà été exécuté, vous pouvez donc le lire pas à pas. Cependant, vous pouvez trouver utile d'effacer les sorties et d'exécuter chaque cellule étape par étape pour voir comment cela fonctionne. Vous pouvez le faire en cliquant sur **Kernel -> Restart Kernel and Clear All Outputs**. Lorsqu'on vous demande si vous souhaitez redémarrer le noyau, cliquez sur **Restart**.

source: There are many similarities between the notebook you built in this session, and the existing Sandbox notebook. Maybe make a note of what is similar and what is different. If you have any questions about how the existing notebook works, please ask the instructors during a live session.
fr: Il existe de nombreuses similitudes entre le bloc-notes que vous avez créé dans cette session et le bloc-notes Sandbox existant. Notez peut-être ce qui est similaire et ce qui est différent. Si vous avez des questions sur le fonctionnement du bloc-notes existant, veuillez demander aux instructeurs lors d'une session en direct.

source: Session 5 Quiz and Solution
fr: Session 5 Quiz et solution

source: In Session 5, you looked at the framework of a case study. Building on elements from previous sessions — such as loading data, calculating an index, and plotting results — you used a new index, the Enhanced Vegetation Index (EVI), to show differences over time. The first half of EVI data was compared to the second half, and mapped to show relative increase or decrease.
fr: À la session 5, vous avez examiné le cadre d'une étude de cas. En vous basant sur des éléments des sessions précédentes, comme le chargement de données, le calcul d'un index et le traçage des résultats, vous avez utilisé un nouvel index, l'indice de végétation amélioré (EVI), pour montrer les différences au fil du temps. La première moitié des données EVI a été comparée à la seconde moitié et cartographiée pour montrer une augmentation ou une diminution relative.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://docs.google.com/forms/d/e/1FAIpQLSfAck3EJgxeYDfTyseB0VwVmcyDMNq_PiFCnm3-JIoSRae3xw/viewform?usp=sf_link>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `compléter le quiz <https://docs.google.com/forms/d/e/1FAIpQLSfAck3EJgxeYDfTyseB0VwVmcyDMNq_PiFCnm3-JIoSRae3xp/view = lien_sf>`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: This quiz does not require a notebook to solve. However, you may find the EVI vegetation change detection notebook useful as a reference. If you would like to confirm that your vegetation change notebook works as expected, you can check it against the solution notebook provided below.
fr: Ce quiz ne nécessite pas de cahier pour être résolu. Cependant, vous pouvez trouver le cahier de détection des changements de végétation EVI utile comme référence. Si vous souhaitez confirmer que votre carnet de changement de végétation fonctionne comme prévu, vous pouvez le comparer au carnet de solutions fourni ci-dessous.

source: The solution notebook below does not contain the answer to the quiz. Use it to check that you implemented the exercise correctly, then use your exercise notebook to help with the quiz. Accessing the solution notebook will not affect your progression towards the certificate.
fr: Le cahier de solutions ci-dessous ne contient pas la réponse au quiz. Utilisez-le pour vérifier que vous avez correctement mis en œuvre l'exercice, puis utilisez votre cahier d'exercices pour vous aider avec le quiz. L'accès au carnet de solutions n'affectera pas votre progression vers le certificat.

source: `Download the solution notebook for the Session 5 exercise <../_static/session_5/Vegetation_exercise.ipynb>`__
fr: `Téléchargez le cahier de solution pour l'exercice Session 5 <../_static/session_5/Vegetation_exercise.ipynb>`__

source: Session 5: Vegetation Analyses
fr: Session 5: Analyses de la végétation

source: In this session, we will combine many of the techniques you've learned during the training course to build a complete case study. This is where you have a question in mind that you want to answer, load and analyse the appropriate data, then draw conclusions to try and answer your question.
fr: Dans cette session, nous combinerons plusieurs des techniques que vous avez apprises pendant le cours de formation pour construire une étude de cas complète. C'est là que vous avez une question en tête à laquelle vous souhaitez répondre, charger et analyser les données appropriées, puis tirer des conclusions pour essayer de répondre à votre question.

source: This session will focus on case studies related to vegetation. First, we'll cover the available vegetation case studies on the Sandbox, as well as how to structure your own case study. Then, you'll work through building your own case study to detect changes in vegetation over time.
fr: Cette session se concentrera sur des études de cas liées à la végétation. Tout d'abord, nous aborderons les études de cas de végétation disponibles sur le bac à sable, ainsi que la manière de structurer votre propre étude de cas. Ensuite, vous travaillerez à la construction de votre propre étude de cas pour détecter les changements de végétation au fil du temps.

source: Introduction to water analyses
fr: Introduction aux analyses de l'eau

source: In the `last session <../session_5/02_vegetation_exercise.ipynb>`__, we learned how to construct a complete case study, focusing on vegetation. In this session, we will look at another vital resource — water. Using the same case study techniques, we will construct a new case study focusing on water. This includes learning to use the Water Observations from Space (WOfS) dataset.
fr: Dans la `dernière session <../session_5/02_vegetation_exercise.ipynb>`__, nous avons appris comment construire une étude de cas complète, en se concentrant sur la végétation. Dans cette session, nous examinerons une autre ressource vitale - l'eau. En utilisant les mêmes techniques d'étude de cas, nous construirons une nouvelle étude de cas axée sur l'eau. Cela comprend l'apprentissage de l'utilisation de l'ensemble de données d'observation de l'eau depuis l'espace (WOfS).

source: The significance of water
fr: L'importance de l'eau

source: *Water is a key concern across the African continent. Many countries are experiencing extreme conditions, such as drought or floods. Water case study analyses can pave the way towards data-driven policy and mitigation strategies.* [`Image source <https://www.aljazeera.com/news/2018/01/16/cape-town-confronts-looming-day-zero-water-crisis/>`__]
fr: *L'eau est une préoccupation majeure sur le continent africain. De nombreux pays connaissent des conditions extrêmes, telles que la sécheresse ou les inondations. Les analyses d'études de cas sur l'eau peuvent ouvrir la voie à des politiques et des stratégies d'atténuation fondées sur les données.* [`Source de l'image <https://www.aljazeera.com/news/2018/01/16/cape-town-confronts-looming-day-zero-water-crisis/>`__]

source: There are many useful analyses that involve water, such as:
fr: Il existe de nombreuses analyses utiles qui impliquent l'eau, telles que:

source: Detection of drought
fr: Détection de la sécheresse

source: Flood modelling and prediction
fr: Modélisation et prévision des crues

source: Mangrove analysis: mangroves can lessen damage from water surges such as those from storms and tsunamis
fr: Analyse des mangroves: les mangroves peuvent réduire les dommages causés par les crues d'eau telles que celles des tempêtes et des tsunamis

source: Detection of coastal erosion
fr: Détection de l'érosion côtière

source: Reporting for indicators in the United Nations (UN) Sustainable Development Goals (SDGs) that involve water. For example, `Goal 6 <https://sdgs.un.org/goals/goal6>`__ is about water and sanitation. Some example indicators that the Open Data Cube can facilitate reporting for include:
fr: Rapports pour les indicateurs des objectifs de développement durable (ODD) des Nations Unies (ONU) qui concernent l'eau. Par exemple, `l'Objectif 6 <https://sdgs.un.org/goals/goal6>`__ concerne l'eau et l'assainissement. Voici quelques exemples d'indicateurs pour lesquels l'Open Data Cube peut faciliter la création de rapports:

source: Indicator 6.3.2: Proportion of bodies of water with good ambient water quality
fr: Indicateur 6.3.2: Proportion de plans d'eau avec une bonne qualité de l'eau ambiante

source: Indicator 6.6.1: Change in the extent of water-related ecosystems over time
fr: Indicateur 6.6.1: Changement de l'étendue des écosystèmes liés à l'eau au fil du temps

source: There are several notebooks in the Digital Earth Africa Sandbox that analyse water bodies. These case study notebooks can be found in the Sandbox folder called **Real_world_examples**.
fr: Il existe plusieurs carnets dans le bac à sable Digital Earth Africa qui analysent les plans d'eau. Ces cahiers d'études de cas se trouvent dans le dossier Sandbox appelé **Real_world_examples**.

source: The **Real_world_examples** folder contains many case studies; the notebooks related to water are summarised below.
fr: Le dossier **Real_world_examples** contient de nombreuses études de cas; les cahiers relatifs à l'eau sont résumés ci-dessous.

source: ``Chlorophyll_monitoring.ipynb``
fr: ``Chlorophylle_monitoring.ipynb``

source: This notebook monitors chlorophyll-a in water bodies using Sentinel-2 data. Chlorophyll-a can indicate the presence of algal blooms, and monitoring this with satellite imagery can provide insights into water quality. The notebook plots the value of the Normalised Difference Chlorophyll Index (NDCI) along with water body area to understand how the presence of clorophyll-a changes with time.
fr: Cet ordinateur portable surveille la chlorophylle-a dans les plans d'eau à l'aide des données Sentinel-2. La chlorophylle-a peut indiquer la présence de proliférations d'algues, et la surveillance de celles-ci avec des images satellite peut fournir des informations sur la qualité de l'eau. Le cahier trace la valeur de l'indice de chlorophylle par différence normalisée (NDCI) ainsi que la superficie du plan d'eau pour comprendre comment la présence de clorophylle-a change avec le temps.

source: This notebook monitors coastal erosion with Landsat 8 data. Using satellites to monitor coastal change over large areas can be a cost-effective method of tracking change and preempting infrastructure needs. This notebook extracts shorelines from composite measures of the Modified Normalised Difference Water Index (MNDWI) and plots how they change from year to year.
fr: Ce portable surveille l'érosion côtière avec les données Landsat 8. L'utilisation de satellites pour surveiller les changements côtiers sur de vastes zones peut être une méthode rentable pour suivre les changements et anticiper les besoins en infrastructures. Ce cahier extrait les rives des mesures composites de l'indice de l'eau par différence normalisée modifiée (MNDWI) et montre comment elles changent d'une année à l'autre.

source: This notebook models tides with Landsat 5, 7, and 8 data. By examining the presence of water between low and high tide, the notebook builds up a 3D elevation map of inter-tidal zones such as sandy beaches and rocky shores.
fr: Ce portable modélise les marées avec les données Landsat 5, 7 et 8. En examinant la présence d'eau entre la marée basse et la marée haute, le cahier construit une carte d'élévation en 3D des zones intertidales telles que les plages de sable et les côtes rocheuses.

source: This notebook detects water using Sentinel-1 data. Sentinel-1 is a radar satellite, which is unaffected by cloud cover. This allows the detection of water in cloudy conditions, such as during heavy rain events.
fr: Ce portable détecte l'eau à l'aide des données Sentinel-1. Sentinel-1 est un satellite radar, qui n'est pas affecté par la couverture nuageuse. Cela permet la détection de l'eau dans des conditions nuageuses, comme lors de fortes pluies.

source: This notebook determines the extent of water bodies using the WOfS dataset, which is derived from Landsat data. This notebook relates to Sustainable Development Goals around the spatial extent of water systems, such as UN SDG Indicator 6.6.1. This is an important first step in monitoring the change of water systems over time.
fr: Ce cahier détermine l'étendue des plans d'eau à l'aide du jeu de données WOfS, qui est dérivé des données Landsat. Ce cahier concerne les objectifs de développement durable concernant l'étendue spatiale des systèmes d'eau, tels que l'indicateur 6.6.1 des ODD des Nations Unies. Il s'agit d'une première étape importante dans la surveillance du changement des systèmes d'eau au fil du temps.

source: The exercise in this session, Session 6, will contain instructions to create a similar notebook.
fr: L'exercice de cette session, Session 6, contiendra des instructions pour créer un cahier similaire.

source: Water detection with WOfS
fr: Détection d'eau avec WOfS

source: *An example of the Water Observations from Space (WOfS) dataset over Senegal.*
fr: * Un exemple de l'ensemble de données d'observation de l'eau depuis l'espace (WOfS) sur le Sénégal. *

source: While we can detect water using band indices, Digital Earth Africa provides the Water Observations from Space (WOfS) dataset. The algorithm that generates this dataset has been trained to detect water in Landsat 8 imagery. You can learn more about WOfS and its algorithm by accessing the **Datasets** folder on the Sandbox, and double-clicking the ``Water_Observations_from_Space.ipynb`` notebook to open it.
fr: Bien que nous puissions détecter l'eau à l'aide d'indices de bande, Digital Earth Africa fournit le jeu de données d'observation de l'eau depuis l'espace (WOfS). L'algorithme qui génère cet ensemble de données a été formé pour détecter l'eau dans les images Landsat 8. Vous pouvez en savoir plus sur WOfS et son algorithme en accédant au dossier **Datasets** du Sandbox, et en double-cliquant sur le notebook ``Water_Observations_from_Space.ipynb`` pour l'ouvrir.

source: There are several WOfS products available through the Digital Earth Africa Sandbox. They can be used for analysis in the same way we have been loading and using Landsat and Sentinel satellite products. We summarise two WOfS products below — **feature layers** and **annual summary**.
fr: Il existe plusieurs produits WOfS disponibles via le bac à sable Digital Earth Africa. Ils peuvent être utilisés pour l'analyse de la même manière que nous avons chargé et utilisé les produits satellites Landsat et Sentinel. Nous résumons ci-dessous deux produits WOfS - **couches de fonctionnalités** et **résumé annuel**.

source: Feature layers
fr: Couches d'entités
