Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: The Digital Earth Africa (DE Africa) program aims to increase this understanding through three main tenets:
fr: Le programme Digital Earth Africa (DE Africa) vise à accroître cette compréhension à travers trois principes principaux:

source: **Explore**: Allow access to satellite data in ways that address Africa’s needs
fr: **Explorer**: autorisez l'accès aux données satellitaires de manière à répondre aux besoins de l'Afrique

source: **Learn**: Provide avenues for learning about Earth observation technology and its significance for policymaking and improving the lives of Africans
fr: **Apprendre**: Fournir des pistes d'apprentissage sur la technologie d'observation de la Terre et son importance pour l'élaboration des politiques et l'amélioration de la vie des Africains

source: **Engage**: Stimulate participation and collaboration in events that will help implement, scale and sustain the program
fr: **Engager**: Stimuler la participation et la collaboration à des événements qui aideront à mettre en œuvre, à étendre et à soutenir le programme

source: As such, Digital Earth Africa is a platform designed to:
fr: À ce titre, Digital Earth Africa est une plateforme conçue pour:

source: Catalogue large amounts of Earth observation data
fr: Cataloguer de grandes quantités de données d'observation de la Terre

source: Allow users the ability to easily perform exploratory data analysis
fr: Permettre aux utilisateurs d'effectuer facilement une analyse exploratoire des données

source: Allow scalable continent-wide processing of stored data
fr: Permettre un traitement évolutif des données stockées à l'échelle du continent

source: Monitor contained data for quality control and updates
fr: Surveiller les données contenues pour le contrôle qualité et les mises à jour

source: For more details on the Digital Earth Africa program, visit the `Digital Earth Africa homepage <https://www.digitalearthafrica.org/>`__.
fr: Pour plus de détails sur le programme Digital Earth Africa, visitez la page d'accueil de `Digital Earth Africa <https://www.digitalearthafrica.org/>`__.

source: Create a Digital Earth Africa account
fr: Créer un compte Digital Earth Africa

source: Overview
fr: Aperçu

source: The Digital Earth Africa Sandbox is a learning and analysis environment for accessing Digital Earth Africa data. During this course, you will learn how to use this environment to write and run analyses using Earth observation data.
fr: Le bac à sable Digital Earth Africa est un environnement d'apprentissage et d'analyse permettant d'accéder aux données Digital Earth Africa. Au cours de ce cours, vous apprendrez à utiliser cet environnement pour écrire et exécuter des analyses à l'aide de données d'observation de la Terre.

source: The Sandbox is free to use. Watch the video for a quick introduction. Then follow the step-by-step instructions below to create an account.
fr: Le bac à sable est gratuit. Regardez la vidéo pour une introduction rapide. Suivez ensuite les instructions étape par étape ci-dessous pour créer un compte.

source: If you have an existing account, you can sign in at https://sandbox.digitalearth.africa/.
fr: Si vous disposez d'un compte existant, vous pouvez vous connecter à l'adresse https://sandbox.digitalearth.africa/.

source: Video: Signing up to the Sandbox
fr: Vidéo: inscription au bac à sable

source: This video contains a short introduction to the Sandbox. After watching the video, follow the written steps below for detailed instructions on how to sign up.
fr: Cette vidéo contient une brève introduction au bac à sable. Après avoir regardé la vidéo, suivez les étapes écrites ci-dessous pour obtenir des instructions détaillées sur la façon de vous inscrire.

source: Create an account
fr: Créer un compte

source: Visit https://sandbox.digitalearth.africa/ and click **Login or Sign up**.
fr: Visitez https://sandbox.digitalearth.africa/ et cliquez sur **Login or Sign up**.

source: Click **Sign up**.
fr: Cliquez sur **Sign up**.

source: Fill in the **Username**, **Name**, **Email** and **Password** fields. Passwords must be at least 8 characters, and contain at minimum a lower case letter, an upper case letter and a number. Record your username securely as it will be required to reset your password should you forget it.
fr: Remplissez les champs **Username** (Nom d'utilisateur), **Name** (Nom), **Email** et **Password** (Mot de passe). Les mots de passe doivent comporter au moins 8 caractères et contenir au minimum une lettre minuscule, une lettre majuscule et un chiffre. Enregistrez votre nom d'utilisateur en toute sécurité car il sera nécessaire de réinitialiser votre mot de passe si vous l'oubliez.

source: A verification code will have been sent to your nominated email address. Enter the verification code and click **Confirm Account**. This will automatically log you in.
fr: Un code de vérification aura été envoyé à votre adresse e-mail désignée. Saisissez le code de vérification et cliquez sur **Confirm Account**. Cela vous connectera automatiquement.

source: You will be prompted to select a sever from Server Options. For regular users, only the default environment is available. Select **Default environment** and click **Start**.
fr: Vous serez invité à sélectionner un serveur dans les options du serveur. Pour les utilisateurs réguliers, seul l'environnement par défaut est disponible. Sélectionnez **Default environment** et cliquez sur **Start**.

source: The server will start up; this can take a few minutes. You will automatically be redirected to the Sandbox environment.
fr: Le serveur démarrera; cela peut prendre quelques minutes. Vous serez automatiquement redirigé vers l'environnement Sandbox.

source: The Sandbox runs completely in-browser and all necessary software is provided. No additional installation or configuration is required.
fr: Le bac à sable fonctionne entièrement dans le navigateur et tous les logiciels nécessaires sont fournis. Aucune installation ou configuration supplémentaire n'est requise.

source: You now have a user account on the Digital Africa Sandbox. The next section will cover how to open the existing Jupyter notebook files that are available in the Sandbox.
fr: Vous disposez désormais d'un compte utilisateur sur le Digital Africa Sandbox. La section suivante explique comment ouvrir les fichiers de bloc-notes Jupyter existants disponibles dans le bac à sable.

source: Navigating the Sandbox
fr: Naviguer dans le bac à sable

source: Now you have created a user account and successfully logged in, this session will teach you about the main elements of the Sandbox.
fr: Maintenant que vous avez créé un compte utilisateur et que vous vous êtes connecté avec succès, cette session vous apprendra les principaux éléments du Sandbox.

source: If you do not yet have a Digital Earth Africa account, follow the steps in `Create a Digital Earth Africa account <02_create_a_user_account.ipynb>`__.
fr: Si vous ne possédez pas encore de compte Digital Earth Africa, suivez les étapes de `Créer un compte Digital Earth Africa <02_create_a_user_account.ipynb>`__.

source: The Digital Earth Africa Sandbox uses a JupyterLab interface. JupyterLab is a web-based interactive coding environment. It has a user-friendly interface to make file navigation and workflows more intuitive. Within the Sandbox, we create Jupyter Notebooks to contain and execute code.
fr: Le bac à sable Digital Earth Africa utilise une interface JupyterLab. JupyterLab est un environnement de codage interactif basé sur le Web. Il dispose d'une interface conviviale pour rendre la navigation dans les fichiers et les flux de travail plus intuitifs. Dans le bac à sable, nous créons des notebooks Jupyter pour contenir et exécuter du code.

source: The JupyterLab interface
fr: L'interface JupyterLab

source: When the Sandbox starts up, you will be presented with three main sections, as numbered in the diagram below:
fr: Lorsque le bac à sable démarre, trois sections principales vous seront présentées, comme numérotées dans le diagramme ci-dessous:

source: **Main work area:** Enables you to arrange documents and other windows (such as terminals or code consoles) into panels of tabs that can be resized or subdivided. Open files will be displated in this area. Most of your work will be done here.
fr: **Zone de travail principale:** Vous permet d'organiser des documents et d'autres fenêtres (telles que des terminaux ou des consoles de code) dans des panneaux d'onglets qui peuvent être redimensionnés ou subdivisés. Les fichiers ouverts seront déplacés dans cette zone. La plupart de votre travail se fera ici.

source: **Left sidebar:** Contains a file browser, the list of running kernels and terminals, the command palette, the notebook cell tools inspector, and the tabs list. By default, the file browser is selected; this will be the most useful toolbar for new users.
fr: **Barre latérale gauche:** Contient un navigateur de fichiers, la liste des noyaux et des terminaux en cours d'exécution, la palette de commandes, l'inspecteur des outils de la cellule du notebook et la liste des onglets. Par défaut, le navigateur de fichiers est sélectionné; ce sera la barre d'outils la plus utile pour les nouveaux utilisateurs.

source: **Horizontal menu bar:** Exposes actions available in JupyterLab, including actions related to saving, editing, viewing and running notebooks. When you are done, you can select **File -> Log Out** to quit your Sandbox session and free up server space.
fr: **Barre de menus horizontale:** Expose les actions disponibles dans JupyterLab, y compris les actions liées à l'enregistrement, la modification, l'affichage et l'exécution des blocs-notes. Lorsque vous avez terminé, vous pouvez sélectionner **File -> Log Out** pour quitter votre session Sandbox et libérer de l'espace sur le serveur.

source: Open a Jupyter Notebook
fr: Ouvrez un bloc-notes Jupyter

source: The Sandbox comes with many example notebooks that you can learn from and use. Follow the instructions in this section to learn how to open a notebook.
fr: Le bac à sable est fourni avec de nombreux exemples de blocs-notes dont vous pouvez tirer des leçons et les utiliser. Suivez les instructions de cette section pour savoir comment ouvrir un bloc-notes.

source: In JupyterLab, double-clicking in the left sidebar file browser opens folders and files. Double-click the **Beginners_guide** folder in the left sidebar to open the folder and view its contents. This is shown in the figure below.
fr: Dans JupyterLab, un double-clic dans le navigateur de fichiers de la barre latérale gauche ouvre les dossiers et les fichiers. Double-cliquez sur le dossier **Beginners_guide** dans la barre latérale gauche pour ouvrir le dossier et afficher son contenu. Ceci est illustré dans la figure ci-dessous.

source: Jupyter notebooks can be identified by the file extension ``.ipynb``. Choose a notebook (for example, ``01_Jupyter_notebooks.ipynb``) and double-click to open it in the main work area.
fr: Les notebooks Jupyter peuvent être identifiés par l'extension de fichier ``.ipynb``. Choisissez un bloc-notes (par exemple, ``01_Jupyter_notebooks.ipynb``) et double-cliquez pour l'ouvrir dans la zone de travail principale.

source: To navigate back to the home folder, click the folder icon at the start of the folder path. The folder path is near the top of the left sidebar.
fr: Pour revenir au dossier de départ, cliquez sur l'icône de dossier au début du chemin du dossier. Le chemin du dossier se trouve en haut de la barre latérale gauche.

source: For more information, refer to this section of the JupyterLab documentation on `Working with Files <https://jupyterlab.readthedocs.io/en/stable/user/files.html>`__.
fr: Pour plus d'informations, reportez-vous à cette section de la documentation JupyterLab sur `Utilisation de fichiers <https://jupyterlab.readthedocs.io/en/stable/user/files.html>`__.

source: Close a Jupyter Notebook
fr: Fermer un bloc-notes Jupyter

source: Closing a notebook browser tab will not shut down its ‘computational engine’ (called the kernel). It is good practice to shut down the kernel of any notebooks you aren’t using, as it will free up memory in your Sandbox session. Follow the instructions below to completely shut down the notebook you opened in the previous section.
fr: La fermeture d’un onglet de navigateur de notebook n’arrêtera pas son «moteur de calcul» (appelé noyau). Il est conseillé d’arrêter le noyau de tous les blocs-notes que vous n’utilisez pas, car cela libèrera de la mémoire dans votre session Sandbox. Suivez les instructions ci-dessous pour arrêter complètement le portable que vous avez ouvert dans la section précédente.

source: With the notebook open, click on the menu option **File -> Close and Shutdown Notebook**.
fr: Avec le notebook ouvert, cliquez sur l'option de menu **File -> Close and Shutdown Notebook**.

source: When asked whether you want to shut down the notebook, click **OK**.
fr: Lorsqu'on vous demande si vous souhaitez arrêter le notebook, cliquez sur **OK**.

source: You can now open and close existing Jupyter notebook files. The next section will cover how to run an existing Jupyter notebook.
fr: Vous pouvez maintenant ouvrir et fermer les fichiers de bloc-notes Jupyter existants. La section suivante expliquera comment exécuter un notebook Jupyter existant.

source: Running a Notebook
fr: Exécuter un ordinateur portable

source: Now that you have learned to open and close notebooks, this section will teach you how to run an analysis using one of the existing Jupyter notebooks.
fr: Maintenant que vous avez appris à ouvrir et à fermer les blocs-notes, cette section vous apprendra comment exécuter une analyse à l'aide de l'un des blocs-notes Jupyter existants.

source: Jupyter is an interactive coding environment compatible with the programming language Python. Digital Earth Africa is based on a Python library called the `Open Data Cube <https://www.opendatacube.org/>`__, so the Sandbox contains Python-based notebooks.
fr: Jupyter est un environnement de codage interactif compatible avec le langage de programmation Python. Digital Earth Africa est basé sur une bibliothèque Python appelée `Open Data Cube <https://www.opendatacube.org/>`__, donc le Sandbox contient des blocs-notes basés sur Python.

source: It is helpful, but not required, to be familiar with Python programming.
fr: Il est utile, mais pas obligatoire, de se familiariser avec la programmation Python.

source: Video: Working with notebooks
fr: Vidéo: Travailler avec des blocs-notes

source: This video gives an overview of the notebook we will be working with. Watch the video, and then follow the written instructions below to complete the exercise.
fr: Cette vidéo donne un aperçu du bloc-notes avec lequel nous allons travailler. Regardez la vidéo, puis suivez les instructions écrites ci-dessous pour terminer l'exercice.

source: Exercise: Run the Crop Health notebook
fr: Exercice: Exécutez le bloc-notes Crop Health

source: This activity will demonstrate how to run one of the Digital Earth Africa Sandbox notebooks. The notebook is a real world example showing how to measure crop health. Follow the instructions below to run the notebook.
fr: Cette activité montrera comment exécuter l'un des blocs-notes Digital Earth Africa Sandbox. Le cahier est un exemple concret montrant comment mesurer la santé des cultures. Suivez les instructions ci-dessous pour exécuter le notebook.

source: Create a copy of the notebook
fr: Créer une copie du cahier

source: The Sandbox comes with a large number of existing notebooks, which you can use as reference material. To keep these in their original format, we recommend making a copy of a notebook when you want to run it. For the rest of this training material, we will ask you to make copies of notebooks and store them in a new **Training** folder. Follow the instructions below to set up this folder and add a copy of the notebook for this session.
fr: Le bac à sable est livré avec un grand nombre de blocs-notes existants, que vous pouvez utiliser comme matériel de référence. Pour les conserver dans leur format d'origine, nous vous recommandons de faire une copie d'un bloc-notes lorsque vous souhaitez l'exécuter. Pour le reste de ce matériel de formation, nous vous demanderons de faire des copies de cahiers et de les stocker dans un nouveau dossier **Training**. Suivez les instructions ci-dessous pour configurer ce dossier et ajouter une copie du bloc-notes pour cette session.

source: Click the **Folder icon** in the folder path to make sure you’re in the **Home** folder.
fr: Cliquez sur l'icône **Dossier** dans le chemin du dossier pour vous assurer que vous vous trouvez dans le dossier **Accueil**.

source: Click the **New Folder icon** and name the new folder **Training**. Press **Enter** to finish creating the folder.
fr: Cliquez sur l'icône **Nouveau dossier** et nommez le nouveau dossier **Training**. Appuyez sur **Entrée** pour terminer la création du dossier.

source: The next step is to identify and copy the notebook you want to work on. For this exercise, this will be the ``Crop_health.ipynb`` notebook, which is in the **Real_world_examples** folder. Follow the steps below to copy it.
fr: L'étape suivante consiste à identifier et copier le bloc-notes sur lequel vous souhaitez travailler. Pour cet exercice, ce sera le bloc-notes ``Crop_health.ipynb``, qui se trouve dans le dossier **Real_world_examples**. Suivez les étapes ci-dessous pour le copier.

source: Double-click the **Real_world_examples** folder to open it. The ``Crop_health.ipynb`` notebook is selected in the image below.
fr: Double-cliquez sur le dossier **Real_world_examples** pour l'ouvrir. Le notebook ``Crop_health.ipynb`` est sélectionné dans l'image ci-dessous.

source: Next, right-click on the notebook and click **Duplicate** to create a copy. By default, this will be called ``Crop_health-Copy1.ipynb``.
fr: Ensuite, faites un clic droit sur le bloc-notes et cliquez sur **Duplicate** pour créer une copie. Par défaut, cela s'appellera ``Crop_health-Copy1.ipynb``.

source: Click and drag ``Crop_health-Copy1.ipynb`` to the **Folder icon** to move it to the **Home** folder.
fr: Cliquez et faites glisser ``Crop_health-Copy1.ipynb`` vers l'icône **Dossier** pour le déplacer vers le dossier **Accueil**.

source: Return to the **Home** folder by clicking the **Folder icon**. You should see the ``Crop_health-Copy1.ipynb`` notebook. Click and drag this file to the **Training** folder you created.
fr: Revenez au dossier **Accueil** en cliquant sur l'icône **Dossier**. Vous devriez voir le cahier ``Crop_health-Copy1.ipynb``. Cliquez et faites glisser ce fichier vers le dossier **Training** que vous avez créé.

source: Double-click the **Training** folder. Right-click the copied notebook and click **Rename**. Rename the notebook to ``Crop_health.ipynb``.
fr: Double-cliquez sur le dossier **Training**. Cliquez avec le bouton droit sur le bloc-notes copié et cliquez sur **Rename**. Renommez le notebook en ``Crop_health.ipynb``.

source: You can now run this notebook, as well as make edits to it.
fr: Vous pouvez maintenant exécuter ce bloc-notes et y apporter des modifications.

source: Starting the notebook
fr: Démarrer le notebook

source: Notebooks on the Sandbox come pre-run. It is best practice to restart and clear the notebook before running.
fr: Les ordinateurs portables sur le bac à sable sont pré-exécutés. Il est recommandé de redémarrer et d'effacer le notebook avant de l'exécuter.

source: Double-click your copied ``Crop_health.ipynb`` notebook to open it.
fr: Double-cliquez sur votre cahier ``Crop_health.ipynb`` copié pour l'ouvrir.

source: In the main menu, click **Kernel -> Restart Kernel and Clear All Outputs**. When asked whether you want to restart the kernel, click **Restart**.
fr: Dans le menu principal, cliquez sur **Kernel -> Restart Kernel and Clear All Outputs**. Lorsqu'on vous demande si vous souhaitez redémarrer le noyau, cliquez sur **Restart**.

source: Read the **Background** and **Description** sections to learn more about the notebook.
fr: Lisez les sections **Context** et **Description** pour en savoir plus sur le notebook.

source: Loading packages and functions
fr: Chargement des packages et des fonctions

source: This notebook uses Python packages and functions to conduct the analysis. These are contained in the first code cell, which looks like:
fr: Ce notebook utilise des packages et des fonctions Python pour effectuer l'analyse. Ceux-ci sont contenus dans la première cellule de code, qui ressemble à:

source: To load the necessary packages and functions:
fr: Pour charger les packages et fonctions nécessaires:

source: In the ``Crop_health.ipynb`` notebook, click on the code cell that matches the one above.
fr: Dans le notebook ``Crop_health.ipynb``, cliquez sur la cellule de code qui correspond à celle ci-dessus.

source: Press ``Shift + Enter`` on your keyboard to run the cell.
fr: Appuyez sur ``Maj + Entrée`` sur votre clavier pour exécuter la cellule.

source: When the cell has finished running, the ``[ ]`` icon to the left of the cell should change to ``[1]``, as shown below. This indicates that the cell has finished running. The number ``1`` indicates that this was the first cell run in the notebook.
fr: Lorsque la cellule a fini de fonctionner, l'icône ``[ ]`` à gauche de la cellule doit devenir ``[1]``, comme indiqué ci-dessous. Cela indique que la cellule a fini de fonctionner. Le nombre ``1`` indique qu'il s'agissait de la première cellule exécutée dans le cahier.

source: Pick a study site
fr: Choisissez un site d'étude

source: Next, we have to provide the area of interest using latitude, longitude, and a buffer, which describes how many square degrees to load around the set latitude and longitude values. For now, keep the values that have been set. The notebook will turn this into a bounding box, which will be used to load the data.
fr: Ensuite, nous devons fournir la zone d'intérêt en utilisant la latitude, la longitude et un tampon, qui décrit le nombre de degrés carrés à charger autour des valeurs de latitude et de longitude définies. Pour l'instant, gardez les valeurs qui ont été définies. Le bloc-notes le transformera en une boîte englobante, qui sera utilisée pour charger les données.

source: Click on the cell corresponding to the image below in the notebook.
fr: Cliquez sur la cellule correspondant à l'image ci-dessous dans le carnet.

source: When the cell has finished running, the ``[ ]`` icon to the left of the cell should change to ``[2]``.
fr: Lorsque la cellule a fini de fonctionner, l'icône ``[ ]`` à gauche de la cellule doit devenir ``[2]``.

source: Loading the data
fr: Chargement des données

source: This notebook uses a special function called ``load_crophealth_data`` to load the required data. Later in this training course, you will learn how to write your own data loading commands.
fr: Ce notebook utilise une fonction spéciale appelée ``load_crophealth_data`` pour charger les données requises. Plus tard dans ce cours de formation, vous apprendrez à écrire vos propres commandes de chargement de données.

source: The cell containing this function is shown in the image below:
fr: La cellule contenant cette fonction est montrée dans l'image ci-dessous:
