Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: The ``load_crophealth_data`` function goes through a number of steps. It identifies the available Landsat 8 data over the last two years, then masks the bad quality pixels such as cloud and cloud shadow. After the masking step, the function only keeps images where more than half the pixels are good. Finally, it calculates the Normalized Difference Vegetation Index (NDVI) and returns the data. The returned data are stored in the ``dataset`` object.
fr: La fonction ``load_crophealth_data`` passe par un certain nombre d'étapes. Il identifie les données Landsat 8 disponibles au cours des deux dernières années, puis masque les pixels de mauvaise qualité tels que les nuages et l'ombre des nuages. Après l'étape de masquage, la fonction ne conserve que les images où plus de la moitié des pixels sont bons. Enfin, il calcule l'indice de végétation par différence normalisée (NDVI) et renvoie les données. Les données renvoyées sont stockées dans l'objet ``dataset``.

source: To run the cell:
fr: Pour exécuter la cellule:

source: Click on the cell corresponding to the image above in the notebook.
fr: Cliquez sur la cellule correspondant à l'image ci-dessus dans le cahier.

source: Press ``Shift + Enter`` on your keyboard to run the cell. Outputs should start to appear below the cell.
fr: Appuyez sur ``Maj + Entrée`` sur votre clavier pour exécuter la cellule. Les sorties devraient commencer à apparaître sous la cellule.

source: When the cell has finished running, the ``[ ]`` icon to the left of the cell should change to ``[3]``.
fr: Lorsque la cellule a fini de fonctionner, l'icône ``[ ]`` à gauche de la cellule doit se changer en ``[3]``.

source: As the cell is running, you should see outputs describing the function’s actions. The output is shown in the image below:
fr: Lorsque la cellule est en cours d’exécution, vous devriez voir des sorties décrivant les actions de la fonction. La sortie est affichée dans l'image ci-dessous:

source: In this case, the function identified 30 observations over the last 2 years, then kept and loaded 19 that met the quality requirements.
fr: Dans ce cas, la fonction a identifié 30 observations au cours des 2 dernières années, puis conservé et chargé 19 qui répondaient aux exigences de qualité.

source: Run the Crop Health App
fr: Exécutez l'application Crop Health

source: After loading the data, you can visualize the health of various fields using the ``run_crophealth_app`` function. This is a special function for this notebook, which takes the ``dataset`` you loaded, as well as the latitude, longitude and buffer parameters that define the area of interest. It then starts an interactive app that you can use to measure the average NDVI in different fields.
fr: Après avoir chargé les données, vous pouvez visualiser l'état de santé de différents champs à l'aide de la fonction ``run_crophealth_app``. Il s'agit d'une fonction spéciale pour ce notebook, qui prend le ``jeu de données`` que vous avez chargé, ainsi que les paramètres de latitude, longitude et tampon qui définissent la zone d'intérêt. Il démarre ensuite une application interactive que vous pouvez utiliser pour mesurer le NDVI moyen dans différents domaines.

source: Press ``Shift + Enter`` on your keyboard to run the cell. An interactive app should appear, as shown in the image below:
fr: Appuyez sur ``Maj + Entrée`` sur votre clavier pour exécuter la cellule. Une application interactive devrait apparaître, comme le montre l'image ci-dessous:

source: The left-hand side of the app contains a map, which will allow you to draw a polygon around a field of interest. Click the **Polygon icon**, then click points on the map to outline an area, as shown below:
fr: Le côté gauche de l'application contient une carte, qui vous permettra de dessiner un polygone autour d'un champ d'intérêt. Cliquez sur l'icône **Polygone**, puis cliquez sur des points sur la carte pour délimiter une zone, comme indiqué ci-dessous:

source: The map in this app shows an ESRI basemap which is higher resolution than the Landsat 8 data used to calculate the NDVI index. The purpose of the map is to guide you in drawing field boundaries.
fr: La carte de cette application montre un fond de carte ESRI dont la résolution est plus élevée que les données Landsat 8 utilisées pour calculer l'indice NDVI. Le but de la carte est de vous guider dans le dessin des limites de champ.

source: Click the first point of the polygon to finish selecting the area. The app will then calculate the average NDVI for that area and display it on the right-hand side of the app, as shown below:
fr: Cliquez sur le premier point du polygone pour terminer la sélection de la zone. L'application calculera ensuite le NDVI moyen pour cette zone et l'affichera sur le côté droit de l'application, comme indiqué ci-dessous:

source: The cycles in the graph are likely related to growth and harvesting events.
fr: Les cycles du graphique sont probablement liés à des événements de croissance et de récolte.

source: It is possible to draw multiple polygons and compare the vegetation index over time of different fields. Click the **Polygon icon** to draw a second polygon:
fr: Il est possible de dessiner plusieurs polygones et de comparer l'indice de végétation dans le temps de différents champs. Cliquez sur l'icône **Polygone** pour dessiner un deuxième polygone:

source: Congratulations! You have finished the first session of this training! You now know how to open and close notebooks, make copies of notebooks and run them.
fr: Toutes nos félicitations! Vous avez terminé la première session de cette formation! Vous savez maintenant comment ouvrir et fermer des blocs-notes, faire des copies de blocs-notes et les exécuter.

source: Optional activity
fr: Activité optionnelle

source: If you’d like to re-run this notebook using a different area of interest, follow these steps:
fr: Si vous souhaitez réexécuter ce bloc-notes en utilisant un autre domaine d'intérêt, procédez comme suit:

source: Restart the notebook and clear all outputs.
fr: Redémarrez le notebook et effacez toutes les sorties.

source: Run the cell that imports packages and fuctions.
fr: Exécutez la cellule qui importe les packages et les fonctions.

source: Change the latitude, longitude and buffer values in the second code cell. You can either use the values suggested above the cell, or provide your own. Then run the cell.
fr: Modifiez les valeurs de latitude, de longitude et de tampon dans la deuxième cellule de code. Vous pouvez utiliser les valeurs suggérées au-dessus de la cellule ou fournir les vôtres. Ensuite, exécutez la cellule.

source: If you're going to use your own area of interest, make sure data is available by looking at the Sandbox Metadata Explorer for Landsat 8 at https://explorer.digitalearth.africa/ls8_usgs_sr_scene. You will also need to make sure you provide latitude and longitude values (rather than Easting and Northing values).
fr: Si vous envisagez d'utiliser votre propre domaine d'intérêt, assurez-vous que les données sont disponibles en consultant l'explorateur de métadonnées Sandbox pour Landsat 8 à l'adresse https://explorer.digitalearth.africa/ls8_usgs_sr_scene. Vous devrez également vous assurer que vous fournissez des valeurs de latitude et de longitude (plutôt que des valeurs Est et Nord).

source: Run the rest of the notebook as described in the tutorial, drawing in areas of interest using the **Polygon icon** on the map.
fr: Exécutez le reste du bloc-notes comme décrit dans le didacticiel, en dessinant dans les zones d'intérêt à l'aide de l'icône **Polygone** sur la carte.

source: Did you learn anything interesting about the fields for your area of interest?
fr: Avez-vous appris quelque chose d'intéressant sur les domaines de votre domaine d'intérêt?

source: Session 1 Quiz
fr: Quiz de la session 1

source: In Session 1, you learned about the mission and purpose of Digital Earth Africa. You also created an account on the Digital Earth Africa Sandbox, a platform where you can retrieve and analyse Earth observation data over Africa. The exercise was to copy, open and run the Crop Health notebook.
fr: Au cours de la session 1, vous avez découvert la mission et le but de Digital Earth Africa. Vous avez également créé un compte sur le Digital Earth Africa Sandbox, une plateforme où vous pouvez récupérer et analyser des données d'observation de la Terre en Afrique. L'exercice consistait à copier, ouvrir et exécuter le carnet de santé des cultures.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://forms.gle/ShuYhKvhjhg1rKqA7>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `remplir le quiz <https://forms.gle/ShuYhKvhjhg1rKqA7>`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: The quiz will ask you to use the Crop Health notebook you developed for this session’s exercise. To review the exercise, visit the section **Running a Notebook** or click the **Previous** button.
fr: Le quiz vous demandera d’utiliser le cahier sur la santé des cultures que vous avez développé pour l’exercice de cette session. Pour revoir l'exercice, visitez la section **Lancer un bloc-notes** ou cliquez sur le bouton **Précédent**.

source: Welcome to the first session of the Digital Earth Africa training course!
fr: Bienvenue à la première session du cours de formation Digital Earth Africa!

source: This session introduces the Digital Earth Africa program and shows you how to sign up to the Digital Earth Africa Sandbox, our data analysis platform. We will then walk through an exercise exploring crop health data.
fr: Cette session présente le programme Digital Earth Africa et vous montre comment vous inscrire au Digital Earth Africa Sandbox, notre plateforme d'analyse de données. Nous ferons ensuite un exercice explorant les données sur la santé des cultures.

source: It is not required to have previous experience in Earth observation data or Python coding. Every section includes instructions and screenshots on how to perform each task.
fr: Il n'est pas nécessaire d'avoir une expérience préalable des données d'observation de la Terre ou du codage Python. Chaque section comprend des instructions et des captures d'écran sur la façon d'effectuer chaque tâche.

source: To get started, click on **What is Digital Earth Africa?** or select the **Next** button below.
fr: Pour commencer, cliquez sur **Qu'est-ce que Digital Earth Africa?** ou sélectionnez le bouton **Suivant** ci-dessous.

source: Digital Earth Africa products
fr: Produits Digital Earth Africa

source: The Digital Earth Africa Sandbox allows users to access a variety of Earth observation products. These products are comprehensive datasets that form the basis of all analysis conducted in the Sandbox. As a Sandbox user, it is helpful to know more about the available products: each has its own strengths and limitations that can impact results.
fr: Le bac à sable Digital Earth Africa permet aux utilisateurs d'accéder à une variété de produits d'observation de la Terre. Ces produits sont des ensembles de données complets qui constituent la base de toutes les analyses effectuées dans le bac à sable. En tant qu'utilisateur Sandbox, il est utile d'en savoir plus sur les produits disponibles: chacun a ses propres forces et limites qui peuvent avoir un impact sur les résultats.

source: The Digital Earth Africa products can be split into two types:
fr: Les produits Digital Earth Africa peuvent être divisés en deux types:

source: Satellite products: datasets of measurements taken by satellites
fr: Produits satellites: ensembles de données de mesures prises par les satellites

source: Derived products: datasets created by applying algorithms to satellite products
fr: Produits dérivés: ensembles de données créés en appliquant des algorithmes à des produits satellites

source: For now, we will focus on satellite products. This section describes the two main datasets we will see in this training course — **Landsat 8** and **Sentinel-2**.
fr: Pour l'instant, nous allons nous concentrer sur les produits satellites. Cette section décrit les deux principaux ensembles de données que nous verrons dans ce cours de formation - **Landsat 8** et **Sentinel-2**.

source: Video: Satellite products
fr: Vidéo: produits satellites

source: Watch this short video for an overview of Digital Earth Africa satellite products. Then, read the text below for more detail.
fr: Regardez cette courte vidéo pour un aperçu des produits satellitaires Digital Earth Africa. Ensuite, lisez le texte ci-dessous pour plus de détails.

source: `Download the video slides as a PDF <../_static/session_2/Week2_Satellite-products.pdf>`__
fr: `Téléchargez les diapositives vidéo au format PDF <../_static/session_2/Week2_Satellite-products.pdf>`__

source: Satellite products
fr: Produits satellites

source: *An artistic rendering of one of the Sentinel-2 satellites.* [`Source <https://www.esa.int/Enabling_Support/Operations/Sentinel-2_operations>`__]
fr: * Un rendu artistique de l'un des satellites Sentinel-2. * [`Source <https://www.esa.int/Enabling_Support/Operations/Sentinel-2_operations>`__]

source: Satelllite products are datasets output from satellites orbiting Earth. These datasets have undergone some pre-processing by the satellite operators, but are otherwise ‘raw’ data, measuring quantities such as reflectance, radiation and surface temperature.
fr: Les produits Satelllite sont des ensembles de données provenant de satellites en orbite autour de la Terre. Ces ensembles de données ont subi un certain prétraitement par les opérateurs de satellites, mais sont par ailleurs des données «brutes», mesurant des quantités telles que la réflectance, le rayonnement et la température de surface.

source: These products are fundamental to Earth observation analytics. They are distinguished by a few key attributes:
fr: Ces produits sont fondamentaux pour l'analyse de l'observation de la Terre. Ils se distinguent par quelques attributs clés:

source: **Spatial resolution (how detailed):** Spatial resolution refers to the pixel size of the satellite product. It is the smallest thing the satellite can ‘see’. A 30 m :math:`\times` 30 m spatial resolution means the satellite product cannot pick up any details smaller than 30 m :math:`\times` 30 m.
fr: **Résolution spatiale (niveau de détail):** La résolution spatiale fait référence à la taille de pixel du produit satellite. C’est la plus petite chose que le satellite puisse «voir». Une résolution spatiale de 30 m: `\times` 30 m signifie que le produit satellite ne peut pas capter des détails inférieurs à 30 m: math:` \times` 30 m.

source: **Temporal resolution (how often):** Satellites pass over different parts of the Earth at different times of the day and month. The frequency of measurements depends on how many satellites are contributing to the product.
fr: **Résolution temporelle (à quelle fréquence):** Les satellites passent sur différentes parties de la Terre à différents moments de la journée et du mois. La fréquence des mesures dépend du nombre de satellites qui contribuent au produit.

source: **Spectral resolution (how versatile):** Spectral resolution refers to the sensors on the satellite. The sensors are calibrated to collect measurements in certain wavelengths of the electromagnetic spectrum, known as ‘bands’. Different bands are used for identifying different features on Earth, so the more bands a product has, the more versatile it is.
fr: **Résolution spectrale (quelle polyvalence):** La résolution spectrale fait référence aux capteurs du satellite. Les capteurs sont calibrés pour collecter des mesures dans certaines longueurs d’onde du spectre électromagnétique, appelées «bandes». Différentes bandes sont utilisées pour identifier différentes caractéristiques sur Terre, de sorte que plus un produit a de bandes, plus il est polyvalent.

source: Digital Earth Africa hosts several satellite products available to Sandbox users. The two products used most in this training course are the Landsat 8 product and the Sentinel-2 product.
fr: Digital Earth Africa héberge plusieurs produits satellites disponibles pour les utilisateurs de Sandbox. Les deux produits les plus utilisés dans cette formation sont le produit Landsat 8 et le produit Sentinel-2.

source: Satellite product: Landsat 8
fr: Produit satellite: Landsat 8

source: Landsat 8 is the latest iteration of the Landsat program run jointly by the United States Geological Survey (USGS) and National Aeronautics and Space Administration (NASA). It consists of one satellite in a polar orbit, launched on February 11, 2013, and is still in operation today.
fr: Landsat 8 est la dernière version du programme Landsat géré conjointement par le United States Geological Survey (USGS) et la National Aeronautics and Space Administration (NASA). Il consiste en un satellite en orbite polaire, lancé le 11 février 2013, et est toujours en service aujourd'hui.

source: The Landsat data is organised by collections. Until recently, only Collection 1 was available, but USGS upgraded their pre-processing methodology. This gave rise to a new version of the Landsat data, titled ‘Collection 2’. Collection 2 is planned for public release soon.
fr: Les données Landsat sont organisées par collections. Jusqu'à récemment, seule la collection 1 était disponible, mais l'USGS a amélioré sa méthodologie de prétraitement. Cela a donné lieu à une nouvelle version des données Landsat, intitulée «Collection 2». La collection 2 est prévue pour une sortie publique prochainement.

source: Each collection contains the data at two levels; Level-1 and Level-2. Level-1 data is surface reflectance measured at the top of the atmosphere. Level-2 has been pre-processed for atmospheric corrections, and gives surface reflectance at bottom-of-atmosphere. Since the corrections increase data quality and usability, Level-2 data is generally used.
fr: Chaque collection contient les données à deux niveaux; Niveau 1 et niveau 2. Les données de niveau 1 sont la réflectance de surface mesurée au sommet de l'atmosphère. Le niveau 2 a été prétraité pour les corrections atmosphériques et donne une réflectance de surface au fond de l'atmosphère. Étant donné que les corrections augmentent la qualité et la facilité d'utilisation des données, les données de niveau 2 sont généralement utilisées.

source: The Digital Earth Africa Landsat 8 product uses Collection 1 Level-2 data, and holds the following characteristics:
fr: Le produit Digital Earth Africa Landsat 8 utilise les données de la collection 1 niveau 2 et possède les caractéristiques suivantes:

source: **Sandbox alias:** ``ls8_usgs_sr_scene``
fr: **Alias du bac à sable:** ``ls8_usgs_sr_scene``

source: **Data type:** Surface reflectance
fr: **Type de données:** Réflexion de surface

source: **Data timespan:** March 2013 – December 2019
fr: **Période de données:** Mars 2013 - décembre 2019

source: **Available regions:** Tanzania, Senegal, Sierra Leone, Ghana and Kenya
fr: **Régions disponibles:** Tanzanie, Sénégal, Sierra Leone, Ghana et Kenya

source: **Spatial resolution:** 30 :math:`\times` 30 m (size of one pixel)
fr: **Résolution spatiale:** 30: math: `\times` 30 m (taille d'un pixel)

source: **Temporal resolution:** 16 days (one flyover every 16 days, or approximately twice a month)
fr: **Résolution temporelle:** 16 jours (un survol tous les 16 jours, soit environ deux fois par mois)

source: **Spectral resolution:** 7 spectral bands — Coastal/Aerosol, Blue, Green, Red, Near-Infrared, Short Wavelength Infrared 1, Short Wavelength Infrared 2
fr: **Résolution spectrale:** 7 bandes spectrales - côtières / aérosols, bleu, vert, rouge, proche infrarouge, infrarouge à courte longueur d'onde 1, infrarouge à courte longueur d'onde 2

source: For more details, see ``Landsat_collections.ipynb`` in the **Datasets** folder of the Sandbox, or visit the `Landsat Collections website <https://www.usgs.gov/land-resources/nli/landsat/landsat-collections?qt-science_support_page_related_con=2#qt-science_support_page_related_con>`__. These sources also contain information about previous Landsat missions; together, Landsat 5/7/8 data covers the time period 1984 – 2019.
fr: Pour plus de détails, voir ``Landsat_collections.ipynb`` dans le dossier **Datasets** du bac à sable, ou visitez le site Web de Landsat Collections <https://www.usgs.gov/land-resources/nli/landsat/Landsat-collections?qt-science_support_page_related_con=2#qt-science_support_page_related_con>`__. Ces sources contiennent également des informations sur les missions Landsat précédentes; ensemble, les données Landsat 5/7/8 couvrent la période 1984-2019.

source: Satellite product: Sentinel-2
fr: Produit satellite: Sentinel-2

source: The Sentinel-2 mission is part of the European Union ‘Copernicus’ Earth observation programme. Sentinel-2 consists of twin satellites, Sentinel-2A (launched 23 June 2015) and Sentinel-2B (launched 7 March 2017). Their combined data is used in the Digital Earth Africa Sentinel-2 product.
fr: La mission Sentinel-2 fait partie du programme d’observation de la Terre Copernicus de l’Union européenne. Sentinel-2 se compose de deux satellites, Sentinel-2A (lancé le 23 juin 2015) et Sentinel-2B (lancé le 7 mars 2017). Leurs données combinées sont utilisées dans le produit Digital Earth Africa Sentinel-2.

source: Like the Landsat datasets, Sentinel-2 data is tiered by level of pre-processing. Level-0, Level-1A and Level-1B data contain raw data from the satellites, with little to no pre-processing. Level-1C has been corrected to top-of-atmosphere reflectance, while Level-2A is bottom-of-atmosphere reflectance. As with Landsat, the Level-2A bottom-of-atmosphere measurements are most ideal for further research activities.
fr: Tout comme les ensembles de données Landsat, les données Sentinel-2 sont hiérarchisées par niveau de prétraitement. Les données de niveau 0, niveau 1A et niveau 1B contiennent des données brutes provenant des satellites, avec peu ou pas de prétraitement. Le niveau 1C a été corrigé en réflectance du haut de l'atmosphère, tandis que le niveau 2A est la réflectance du bas de l'atmosphère. Comme pour Landsat, les mesures du fond de l'atmosphère de niveau 2A sont idéales pour d'autres activités de recherche.

source: The Digital Earth Africa Sentinel-2 product uses Sentinel-2 Level-2A data, and holds the following characteristics:
fr: Le produit Digital Earth Africa Sentinel-2 utilise les données Sentinel-2 Level-2A et possède les caractéristiques suivantes:

source: **Sandbox alias:** ``s2_l2a``
fr: **Alias du bac à sable:** ``s2_l2a``

source: **Data timespan:** July 2017 – present
fr: **Période de données:** juillet 2017 - présent

source: **Available regions:** Entire African continent
fr: **Régions disponibles:** Tout le continent africain

source: **Spatial resolution:** 10 :math:`\times` 10 m, 20 :math:`\times` 20 m, 60 :math:`\times` 60 m (depending on band)
fr: **Résolution spatiale:** 10: math: `\times` 10 m, 20: math:` \times` 20 m, 60: math: `\times` 60 m (selon la bande)

source: **Temporal resolution:** 5 days
fr: **Résolution temporelle:** 5 jours
