Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: How you analyse Digital Earth Africa data will depend on **what you want to know**. Now that we know more about the strengths and limitations of vegetation indices, we can use them to form the basis of a complete case study that informs a user of a real-world outcome.
fr: La manière dont vous analysez les données Digital Earth Africa dépendra de **ce que vous voulez savoir**. Maintenant que nous en savons plus sur les forces et les limites des indices de végétation, nous pouvons les utiliser pour former la base d'une étude de cas complète qui informe un utilisateur d'un résultat réel.

source: This session will show you how to extend dataset calculations into a meaningful report. This section outlines some common goals of vegetation analysis, and provides references to examples of case study notebooks. The following sections will walk through a tutorial on how to construct a notebook on vegetation change detection.
fr: Cette session vous montrera comment étendre les calculs de jeux de données dans un rapport significatif. Cette section décrit certains objectifs communs de l'analyse de la végétation et fournit des références à des exemples de cahiers d'études de cas. Les sections suivantes parcourent un didacticiel sur la façon de créer un cahier sur la détection des changements de végétation.

source: The significance of vegetation
fr: L'importance de la végétation

source: *Food security is a major focus of the UN’s Sustainable Development Goals (SDGs). The SDGs are a key tenet of the Digital Earth Africa program.* [`Image source <https://rcmrd.org/servir-regional-cropland-assessment-and-monitoring-service>`__]
fr: * La sécurité alimentaire est au cœur des objectifs de développement durable (ODD) de l'ONU. Les ODD sont un élément clé du programme Digital Earth Africa. * [`Source de l'image <https://rcmrd.org/servir-regional-cropland-assessment-and-monitoring-service>`__]

source: Growing things are a cornerstone of life on Earth. Monitoring vegetation can give us insight into:
fr: La croissance des choses est la pierre angulaire de la vie sur Terre. La surveillance de la végétation peut nous donner un aperçu de:

source: **Agriculture:** including cropping, seasonal patterns and changes in land use
fr: **Agriculture:** y compris les cultures, les modèles saisonniers et les changements d'utilisation des terres

source: **Environment health and industry:** including forestry, logging and mining
fr: **Environnement, santé et industrie:** y compris la foresterie, l'exploitation forestière et les mines

source: **Climate:** including desertification and drought
fr: **Climat:** y compris la désertification et la sécheresse

source: Real world example notebooks
fr: Exemples de cahiers du monde réel

source: Several case studies based on vegetation indices have already been made using the Digital Earth Africa Sandbox. These case study notebooks can be found in the Sandbox folder called **Real_world_examples**.
fr: Plusieurs études de cas basées sur des indices de végétation ont déjà été réalisées à l'aide du bac à sable Digital Earth Africa. Ces cahiers d'études de cas se trouvent dans le dossier Sandbox appelé **Real_world_examples**.

source: The **Real_world_examples** folder contains many case studies; the notebooks related to vegetation are summarised below.
fr: Le dossier **Real_world_examples** contient de nombreuses études de cas; les carnets relatifs à la végétation sont résumés ci-dessous.

source: This notebook draws upon the crop health app function to calculate NDVI for selected fields. By comparing two polygons within the area, it is possible to assess the fields for crop health and productivity over time.
fr: Ce cahier s'appuie sur la fonction de l'application de santé des cultures pour calculer le NDVI pour les champs sélectionnés. En comparant deux polygones dans la zone, il est possible d'évaluer les champs pour la santé et la productivité des cultures au fil du temps.

source: Session 1 used this crop health notebook as an example of Sandbox capability.
fr: La session 1 a utilisé ce bloc-notes sur la santé des cultures comme exemple de capacité de Sandbox.

source: This notebook visualises vegetation change over time. Areas where vegetation has increased compared to a baseline time are marked in blue, while areas where vegetation has decreased are output as red. This change is indexed using either NDVI, or the Enhanced Vegetation Index (EVI). The notebook allows the user to choose which index is being used.
fr: Ce cahier visualise les changements de végétation au fil du temps. Les zones où la végétation a augmenté par rapport à une période de référence sont indiquées en bleu, tandis que les zones où la végétation a diminué sont affichées en rouge. Ce changement est indexé à l'aide du NDVI ou de l'indice de végétation amélioré (EVI). Le bloc-notes permet à l'utilisateur de choisir quel index est utilisé.

source: The exercise in this session, Session 5, will contain instructions to create a similar notebook.
fr: L'exercice de cette session, Session 5, contiendra des instructions pour créer un cahier similaire.

source: It is recommended you open these notebooks in the Sandbox, from the folder called **Real_world_examples**. This will allow you to run the pre-prepared code for yourself. However, they can also be viewed at the `Digital Earth Africa notebook repository <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/tree/master/Real_world_examples>`_, which will display a read-only HTML version from GitHub.
fr: Il est recommandé d'ouvrir ces blocs-notes dans le bac à sable, à partir du dossier appelé **Real_world_examples**. Cela vous permettra d'exécuter le code pré-préparé pour vous-même. Cependant, ils peuvent également être consultés dans `le référentiel de cahiers de Digital Earth Africa <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks/tree/master/Real_world_examples>`_, qui affichera une version HTML en lecture seule de GitHub.

source: Structuring a case study
fr: Structurer une étude de cas

source: If you opened up some of the real world example notebooks, you might notice they are more complicated than the exercises in this training course. However, they all have the same structure.
fr: Si vous avez ouvert certains des exemples de cahiers du monde réel, vous remarquerez peut-être qu'ils sont plus compliqués que les exercices de ce cours de formation. Cependant, ils ont tous la même structure.

source: Each notebook you have made from the training course exercises, as well as each real world example notebook, consist of six fundamental components.
fr: Chaque cahier que vous avez créé à partir des exercices du cours de formation, ainsi que chaque exemple de cahier du monde réel, se composent de six éléments fondamentaux.

source: Define the area of interest using longitude and latitude
fr: Définissez la zone d'intérêt en utilisant la longitude et la latitude

source: Load data from the datacube
fr: Charger les données du datacube

source: Perform analysis or calculation on the data (such as calculating an index)
fr: Effectuer une analyse ou un calcul sur les données (comme le calcul d'un indice)

source: Plot the results
fr: Tracez les résultats

source: The **Real_world_examples** notebooks go a few steps further:
fr: Les blocs-notes **Real_world_examples** vont encore plus loin:

source: Frame the analysis in the context of a question or purpose — this is normally introduced at the start of the notebook
fr: Encadrez l'analyse dans le contexte d'une question ou d'un objectif - ceci est normalement introduit au début du cahier

source: Extend results analysis and discussion
fr: Étendre l'analyse et la discussion des résultats

source: With some understanding of the context behind spatial data analysis, we are now ready to create our own case study notebook. This week’s exercise is about incorporating the additional two steps (analysis purpose, and additional results discussion) to make a well-rounded case study.
fr: Avec une certaine compréhension du contexte derrière l'analyse des données spatiales, nous sommes maintenant prêts à créer notre propre carnet d'étude de cas. L’exercice de cette semaine consiste à incorporer les deux étapes supplémentaires (objectif de l’analyse et discussion supplémentaire sur les résultats) pour réaliser une étude de cas complète.

source: In this exercise, we will create a notebook to detect vegetation change. To compare change, we need to have data from two different times: an older dataset, and a newer dataset.
fr: Dans cet exercice, nous allons créer un cahier pour détecter les changements de végétation. Pour comparer les changements, nous avons besoin de données de deux époques différentes: un ensemble de données plus ancien et un ensemble de données plus récent.

source: The notebook will include the following steps:
fr: Le cahier comprendra les étapes suivantes:

source: Calculate a vegetation index for the loaded data
fr: Calculer un indice de végétation pour les données chargées

source: Split the vegetation index data into half, based on when the data was collected — an older half and a newer half
fr: Divisez les données de l'indice de végétation en deux, en fonction du moment où les données ont été collectées - une moitié plus ancienne et une moitié plus récente

source: Compute the mean composite for each half; and
fr: Calculez le composite moyen pour chaque moitié; et

source: Compare the older and newer averages to check for vegetation change.
fr: Comparez les moyennes les plus anciennes et les plus récentes pour vérifier les changements de végétation.

source: At the conclusion of this exercise, you will have performed a vegetation analysis which can be used to report on changes in the selected area.
fr: À la fin de cet exercice, vous aurez effectué une analyse de la végétation qui peut être utilisée pour rendre compte des changements dans la zone sélectionnée.

source: In your **Training** folder, create a new Python 3 notebook. Name it ``Vegetation_exercise.ipynb``. For more instructions on creating a new notebook, see the `instructions from Session 2 <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__.
fr: Dans votre dossier **Training**, créez un nouveau notebook Python 3. Nommez-le ``Vegetation_exercise.ipynb``. Pour plus d'instructions sur la création d'un nouveau bloc-notes, consultez les `instructions de la session 2 <../session_2/04_load_data_exercise.ipynb#Make-a-new-notebook>`__.

source: In the first cell, type the following code and then run the cell to import necessary Python dependencies.
fr: Dans la première cellule, tapez le code suivant, puis exécutez la cellule pour importer les dépendances Python nécessaires.

source: In this exercise, we import one new function, ``calculate_indices``.
fr: Dans cet exercice, nous importons une nouvelle fonction, ``calculate_indices``.

source: Instead of calculating band indices such as NDVI by defining a formula, we can call upon preset index calculations in the Sandbox. ``calculate_indices`` contains definitions for over a dozen different indices, from NDVI to the Bare Soil Index (BSI) to Tasselled Cap Wetness (TCW), and can apply them to your dataset.
fr: Au lieu de calculer des indices de bande tels que NDVI en définissant une formule, nous pouvons faire appel à des calculs d'index prédéfinis dans le bac à sable. ``calculate_indices`` contient des définitions pour plus d'une douzaine d'indices différents, du NDVI au Bare Soil Index (BSI) à Tasselled Cap Wetness (TCW), et peut les appliquer à votre ensemble de données.

source: Using this function to select the index we want might seem like a lot of effort. However, there are some benefits to using the ``calculate_indices`` function, as we will see in this exercise.
fr: Utiliser cette fonction pour sélectionner l'index que nous voulons peut sembler demander beaucoup d'efforts. Cependant, l'utilisation de la fonction ``calculate_indices`` présente certains avantages, comme nous le verrons dans cet exercice.

source: Reduce chances of error in typing out the formula, as they are already defined in the ``calculate_indices`` script — this is great for more complicated formulae
fr: Réduisez les risques d'erreur lors de la saisie de la formule, car ils sont déjà définis dans le script ``calculate_indices`` - c'est idéal pour les formules plus compliquées

source: Compare different index results without manually defining many different formulae
fr: Comparez différents résultats d'index sans définir manuellement de nombreuses formules différentes

source: Reduce the number of definitions you have to type — for instance, there is no need for ``red=`` or ``nir=`` as we used in Session 4
fr: Réduisez le nombre de définitions que vous devez taper - par exemple, il n'y a pas besoin de ``red=`` ou ``nir=`` comme nous l'avons utilisé dans la session 4

source: We will use ``calculate_indices`` after we load the dataset.
fr: Nous utiliserons ``calculate_indices`` après avoir chargé l'ensemble de données.

source: We need to select an area of interest. Some areas to check for vegetation changes include mining sites, where there might be devegetation, or crops, where seasonal changes in vegetation greenness occur.
fr: Nous devons sélectionner un domaine d'intérêt. Certaines zones à vérifier pour les changements de végétation comprennent les sites miniers, où il pourrait y avoir de la végétation, ou les cultures, où des changements saisonniers de verdure de la végétation se produisent.

source: Previously, we have provided a longitude range and a latitude range. However, it is more common to define a central point, and provide a buffer around it.
fr: Auparavant, nous avons fourni une plage de longitude et une plage de latitude. Cependant, il est plus courant de définir un point central et de fournir un tampon autour de lui.

source: *We previously used the* ``x=(lon1, lon2), y=(lat1, lat2)`` *method (left) to define our area of interest. In this exercise, we will use the buffer zone method (right). The advantage is that you can define one buffer to use in all four directions, and it is much easier to explore different areas by changing the central point and/or the buffer width.*
fr: *Nous avons précédemment utilisé la méthode* ``x=(lon1, lon2), y=(lat1, lat2)`` *(à gauche) pour définir notre zone d'intérêt. Dans cet exercice, nous utiliserons la méthode de la zone tampon (à droite). L'avantage est que vous pouvez définir un tampon à utiliser dans les quatre directions, et il est beaucoup plus facile d'explorer différentes zones en modifiant le point central et / ou la largeur du tampon.*

source: We will be selecting an area around a centre point. Enter the following code and run the cell to select an area and time range of interest. The parameters are:
fr: Nous sélectionnerons une zone autour d'un point central. Entrez le code suivant et exécutez la cellule pour sélectionner une zone et une période d'intérêt. Les paramètres sont:

source: ``latitude``: The latitude at the centre of your area of interest.
fr: ``latitude``: la latitude au centre de votre zone d'intérêt.

source: ``longitude``: The longitude at the centre of your area of interest.
fr: ``longitude``: la longitude au centre de votre zone d'intérêt.

source: ``buffer``: The number of degrees to load around the central latitude and longitude.
fr: ``buffer``: Le nombre de degrés à charger autour de la latitude et de la longitude centrales.

source: ``time``: The date range to analyse. For reasonable results, the range should span at least two years to prevent detecting seasonal changes.
fr: ``time``: la plage de dates à analyser. Pour des résultats raisonnables, la plage doit s'étendre sur au moins deux ans pour éviter de détecter les changements saisonniers.

source: ``time_baseline``: The date at which to split the total dataset into two non-overlapping samples. For this exercise, we choose a date halfway in our time range. Its value here, ``'2015-12-31'``, is halfway between ``'2013-01-01'`` and ``'2018-12-31'`` - the time range in ``time``. So our two time periods will be 2013 to 2015, and 2016 to 2018.
fr: ``time_baseline``: La date à laquelle diviser l'ensemble de données total en deux échantillons ne se chevauchant pas. Pour cet exercice, nous choisissons une date à mi-chemin de notre plage horaire. Sa valeur ici, ``'2015-12-31'``, est à mi-chemin entre ``'2013-01-01'`` et ``'2018-12-31'`` - la plage de temps en ``time``. Nos deux périodes seront donc de 2013 à 2015 et de 2016 à 2018.

source: In the next cell, enter the following code, and then run it to select an area.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour sélectionner une zone.

source: In the next cell, enter the following code, and then run it to show the area on a map. Since we have defined our area using the variables ``lon_range`` and ``lat_range``, we can use those instead of typing out ``(latitude-buffer, latitude+buffer)`` and ``(longitude-buffer, longitude+buffer)`` again.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour afficher la zone sur une carte. Puisque nous avons défini notre zone en utilisant les variables ``lon_range`` et ``lat_range``, nous pouvons les utiliser au lieu de taper ``(latitude-buffer, latitude + buffer)`` et ``(longitude-buffer, longitude + tampon)`` à nouveau.

source: Since we want to look at a longer time range, Landsat 8 data is suitable. In the new cell below, enter the following code, and then run it to load Landsat 8 data.
fr: Puisque nous voulons examiner une plage de temps plus longue, les données Landsat 8 conviennent. Dans la nouvelle cellule ci-dessous, entrez le code suivant, puis exécutez-le pour charger les données Landsat 8.

source: Notice ``lat_range``, ``lon_range`` and ``time`` were all defined in the previous cell, so we can use them as variables here.
fr: Remarquez que ``lat_range``, ``lon_range`` et ``time`` ont tous été définis dans la cellule précédente, nous pouvons donc les utiliser comme variables ici.

source: If you are unsure where we defined ``lat_range``, ``lon_range`` and ``time``, scroll up to the previous cell and look for the lines starting with ``lat_range = ...``, ``lon_range = ...`` and ``time = ...``.
fr: Si vous ne savez pas où nous avons défini ``lat_range``, ``lon_range`` et ``time``, faites défiler jusqu'à la cellule précédente et recherchez les lignes commençant par ``lat_range = ... ``, ``lon_range = ...`` et ``time = ...``.

source: The output from running the ``load_ard()`` function should include a statement that says ``Loading 46 time steps``.
fr: La sortie de l'exécution de la fonction ``load_ard()`` doit inclure une instruction qui dit ``Loading 46 time steps``.

source: Calculate indices
fr: Calculer les indices

source: Now we need to calculate a vegetation index.
fr: Nous devons maintenant calculer un indice de végétation.

source: Until now, we have used NDVI, which uses the ratio of the red and near-infrared (NIR) bands to identify live green vegetation. The formula is:
fr: Jusqu'à présent, nous avons utilisé le NDVI, qui utilise le rapport des bandes rouge et proche infrarouge (NIR) pour identifier la végétation verte vivante. La formule est:

source: \begin{aligned} \text{NDVI} = \frac{\text{NIR} - \text{Red}}{\text{NIR} + \text{Red}} \end{aligned}
fr: \ begin {aligné} \ text {NDVI} = \ frac {\ text {NIR} - \ text {rouge}} {\ text {NIR} + \ text {rouge}} \ end {aligné}

source: This time we will use the Enhanced Vegetation Index (EVI). EVI uses the red, near-infrared (NIR) and blue bands to identify vegetation, and is particularly sensitive to high biomass regions, which is why it can be superior to NDVI. The formula for EVI is more complicated than NDVI as it uses three different bands and some empirical scaling constants.
fr: Cette fois, nous utiliserons l'indice de végétation amélioré (EVI). EVI utilise les bandes rouge, proche infrarouge (NIR) et bleue pour identifier la végétation, et est particulièrement sensible aux régions à forte biomasse, c'est pourquoi il peut être supérieur au NDVI. La formule pour EVI est plus compliquée que NDVI car elle utilise trois bandes différentes et des constantes de mise à l'échelle empiriques.

source: \begin{aligned} \text{EVI} = \frac{2.5 \times (\text{NIR} - \text{Red})}{\text{NIR} + 6 \times \text{Red} - 7.5 \times \text{Blue} + 1} \end{aligned}
fr: \ begin {aligné} \ text {EVI} = \ frac {2,5 \ fois (\ text {NIR} - \ text {Red})} {\ text {NIR} + 6 \ times \ text {Red} - 7,5 \ fois \ text {Bleu} + 1} \ end {aligné}

source: Instead of typing out that whole formula, we can use the ``calculate_indices`` function to calculate EVI. ``calculate_indices`` requires three inputs:
fr: Au lieu de taper toute cette formule, nous pouvons utiliser la fonction ``calculate_indices`` pour calculer EVI. ``calculate_indices`` nécessite trois entrées:

source: The dataset name, e.g. ``landsat_ds``
fr: Le nom de l'ensemble de données, par exemple ``landsat_ds``

source: The name of the index to calculate, e.g. ``index='EVI'``
fr: Le nom de l'indice à calculer, par exemple ``index='EVI'``

source: The Landsat collection, e.g. ``collection='c1'``
fr: La collection Landsat, par ex. ``collection='c1'``

source: ``c1`` stands for ‘Collection 1’, which is the currently-available Landsat collection of data as named by its publishers, US Geological Survey.
fr: ``c1`` signifie ‘Collection 1’, qui est la collection de données Landsat actuellement disponible, nommée par ses éditeurs, US Geological Survey.

source: In the next cell, enter the following code, and then run it to calculate the EVI vegetation index for this data.
fr: Dans la cellule suivante, entrez le code suivant, puis exécutez-le pour calculer l'indice de végétation EVI pour ces données.

source: This adds a variable called ``EVI`` to our ``landsat_ds`` dataset.
fr: Cela ajoute une variable appelée ``EVI`` à notre ensemble de données ``landsat_ds``.

source: Detect changes
fr: Détecter les changements

source: We want to determine what changed in vegetation between the older and newer halves of the data.
fr: Nous voulons déterminer ce qui a changé dans la végétation entre les moitiés plus anciennes et plus récentes des données.

source: First, we will split the vegetation index data into the older half and newer half. Data that was collected in the first half of our time range (2013 to 2015) will go in the older half, and data collected in the second half (2016 to 2018) will be in the newer half.
fr: Premièrement, nous diviserons les données de l'indice de végétation entre la moitié la plus ancienne et la moitié la plus récente. Les données qui ont été collectées dans la première moitié de notre période (2013 à 2015) iront dans la moitié plus ancienne, et les données collectées dans la seconde moitié (2016 à 2018) seront dans la nouvelle moitié.

source: The split is done using ``sel()`` and ``slice()``.
fr: Le fractionnement se fait en utilisant ``sel()`` et ``slice()``.

source: ``sel()`` stands for ‘selection’ and tells us we are taking a selection of the dataset. We have to define which coordinate we are selecting by. In this case, we will use the ``time`` coordinate.
fr: ``sel()`` signifie 'selection' et nous dit que nous prenons une sélection de l'ensemble de données. Nous devons définir par quelle coordonnée nous sélectionnons. Dans ce cas, nous utiliserons la coordonnée ``time``.
