Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: You may also like to run this cell a few times, experimenting with different values for the ``timesteps`` parameter. The load command should have returned 71 time steps, meaning the values in your ``timesteps`` list can be anywhere from ``0`` to ``70``.
fr: Vous pouvez également exécuter cette cellule plusieurs fois, en expérimentant différentes valeurs pour le paramètre ``timesteps``. La commande de chargement doit avoir renvoyé 71 pas de temps, ce qui signifie que les valeurs de votre liste de ``timesteps`` peuvent être n'importe où de ``0`` à ``70``.

source: Resampling is used to create a new set of times at regular intervals. Using the resample method, the data can be arranged in days, months, quarterly (three months) or yearly.
fr: Le rééchantillonnage est utilisé pour créer un nouvel ensemble d'heures à intervalles réguliers. En utilisant la méthode de rééchantillonnage, les données peuvent être organisées en jours, mois, trimestriellement (trois mois) ou annuel.

source: Below gives examples of how the data are grouped.
fr: Vous trouverez ci-dessous des exemples de la manière dont les données sont regroupées.

source: ``'nD'`` - number of days (e.g. ``'7D'`` for seven days)
fr: ``'nD'`` - nombre de jours (par exemple ``'7D'`` pendant sept jours)

source: ``'nM'`` - number of months (e.g. ``'6M'`` for six months)
fr: ``'nM'`` - nombre de mois (par exemple, ``'6M'`` pour six mois)

source: ``'nY'`` - number of years (e.g. ``'2Y'`` for two years)
fr: ``'nY'`` - nombre d'années (par exemple, ``'2Y'`` pour deux ans)

source: Follow the steps below to resample the dataset time steps to quarterly.
fr: Suivez les étapes ci-dessous pour rééchantillonner les pas de temps de l'ensemble de données sur trimestriel.

source: Delete the code for plotting all RGB images:
fr: Supprimez le code pour tracer toutes les images RVB:

source: In the cleared cell, write the following code to resample the data and store it in the ``resample_sentinel_2_ds`` variable:
fr: Dans la cellule effacée, écrivez le code suivant pour rééchantillonner les données et les stocker dans la variable ``resample_sentinel_2_ds``:

source: ``resample_sentinel_2_ds`` describes how to group the data into quarterly segments. We can now use this to calculate the geomedian for each quarterly segment.
fr: ``resample_sentinel_2_ds`` décrit comment regrouper les données en segments trimestriels. Nous pouvons maintenant l'utiliser pour calculer le géomédian pour chaque segment trimestriel.

source: ``S`` at the end of ``'3MS'`` is to group the data by start of the month.
fr: ``S`` à la fin de ``'3MS'`` est de regrouper les données par début de mois.

source: For this session, instead of calling ``xr_geomedian(sentinel_2_ds)`` on the entire array as we did in the previous exercise, we pass the ``xr_geomedian`` function to ``map`` and apply it separately to each resampled group(``resample_sentinel_2_ds``).
fr: Pour cette session, au lieu d'appeler ``xr_geomedian (sentinel_2_ds)`` sur l'ensemble du tableau comme nous l'avons fait dans l'exercice précédent, nous passons la fonction ``xr_geomedian`` à ``map`` et l'appliquons séparément à chaque groupe rééchantillonné (``resample_sentinel_2_ds``).

source: Replace the existing ``xr_geomedian`` code with:
fr: Remplacez le code ``xr_geomedian`` existant par:

source: We can plot the output geomedians, and see the change in the landscape over the year. Replace the exsiting ``rgb`` code with:
fr: Nous pouvons tracer les géomédiens de sortie et voir le changement du paysage au cours de l'année. Remplacez le code ``rgb`` existant par:

source: Comparing the two dataset can you tell the difference from the results shown below?
fr: En comparant les deux ensembles de données, pouvez-vous faire la différence avec les résultats ci-dessous?

source: ``sentinel_2_ds``
fr: ``sentinelle_2_ds``

source: Take a look at the dimensions. The raw dataset ``sentinel_2_ds`` has 71 time steps loaded, but after resampling to quarterly as in ``geomedian_resample``, the time dimension is now 4. This makes sense because the year has been divided into four quarters.
fr: Jetez un œil aux dimensions. L'ensemble de données brutes ``sentinel_2_ds`` a 71 pas de temps chargés, mais après rééchantillonnage trimestriel comme dans ``geomedian_resample``, la dimension temporelle est maintenant 4. Cela a du sens car l'année a été divisée en quatre trimestres.

source: Congratulations! You have successfully modified a notebook to create a quarterly geomedian composite by resampling Sentinel-2 data.
fr: Toutes nos félicitations! Vous avez modifié avec succès un bloc-notes pour créer un composite géomédian trimestriel en rééchantillonnant les données Sentinel-2.

source: If you’d like to experiment futher, try running the code with different resampling values. Did you learn anything interesting to share with us?
fr: Si vous souhaitez tester davantage, essayez d'exécuter le code avec différentes valeurs de rééchantillonnage. Avez-vous appris quelque chose d'intéressant à partager avec nous?

source: In the next section, we will continue working with this notebook to calculate the NDVI values for each of our quarterly geomedians.
fr: Dans la section suivante, nous continuerons à travailler avec ce cahier pour calculer les valeurs NDVI pour chacun de nos géomédiens trimestriels.

source: Calculating NDVI: Part 2
fr: Calcul du NDVI: partie 2

source: This exercise follows on from the previous section. In the `previous part of this exercise <../session_4/03_calculate_ndvi_part_2.ipynb>`__, you constructed a notebook to resample a year’s worth of Sentinel-2 data into quarterly time steps.
fr: Cet exercice fait suite à la section précédente. Dans la partie précédente de cet exercice <../session_4/03_calculate_ndvi_part_2.ipynb>`__, vous avez construit un bloc-notes pour rééchantillonner l'équivalent d'une année de données Sentinel-2 en pas de temps trimestriels.

source: In this section, you will conitnue from where you ended in the previous exercise. Most of the code will remain unchanged, but we will introduce a new measurement to the existing measurements which will enable us to calculate and plot NDVI.
fr: Dans cette section, vous continuerez à partir de là où vous avez terminé l'exercice précédent. La plupart du code restera inchangé, mais nous introduirons une nouvelle mesure aux mesures existantes qui nous permettra de calculer et de tracer le NDVI.

source: We will be using the notebook we created in the previous section. If you have not already set up a copy of the notebook called ``Calculate_ndvi.ipynb`` with the required packages and functions, follow the instructions in previous section. Ensure you have completed all the steps, including loading the Sentinel-2 dataset.
fr: Nous utiliserons le cahier que nous avons créé dans la section précédente. Si vous n'avez pas encore configuré une copie du notebook appelée ``Calculate_ndvi.ipynb`` avec les packages et les fonctions requis, suivez les instructions de la section précédente. Assurez-vous d'avoir terminé toutes les étapes, y compris le chargement de l'ensemble de données Sentinel-2.

source: Double-click ``Calculate_ndvi.ipynb``. It will open in the Launcher.
fr: Double-cliquez sur ``Calculate_ndvi.ipynb``. Il s'ouvrira dans le lanceur.

source: Make the following changes below to modify the load cell.
fr: Apportez les modifications suivantes ci-dessous pour modifier la cellule de pesée.

source: Adding ``nir`` measurement
fr: Ajout de la mesure ``nir``

source: To calculate NDVI, we need to load Sentinel-2’s near-infrared band. In the Sandbox, it is called ``nir``. To add the band, modify the ``load_ard`` cell according to the step below:
fr: Pour calculer le NDVI, nous devons charger la bande proche infrarouge de Sentinel-2. Dans le bac à sable, il s'appelle ``nir``. Pour ajouter la bande, modifiez la cellule ``load_ard`` selon l'étape ci-dessous:

source: Add ``nir`` to the measurements array.
fr: Ajoutez ``nir`` au tableau de mesures.

source: If you completed the above step, your ``load_ard`` cell should look like:
fr: Si vous avez terminé l'étape ci-dessus, votre cellule ``load_ard`` devrait ressembler à:

source: Select **Kernel -> Restart Kernel and Run All Cells…**.
fr: Sélectionnez **Kernel -> Restart Kernel and Run All Cells…**.

source: Did you noticed any additional data variables to the ``sentinel_2_ds``?
fr: Avez-vous remarqué des variables de données supplémentaires pour le ``sentinel_2_ds``?

source: Creating a new cell
fr: Créer une nouvelle cellule

source: After successfully running the notebook, this cell will be the last cell:
fr: Après avoir exécuté avec succès le notebook, cette cellule sera la dernière cellule:

source: Notice it now contains the NIR band data, which is the data we just loaded.
fr: Notez qu'il contient maintenant les données de la bande NIR, qui sont les données que nous venons de charger.

source: Follow the steps below to create a new cell.
fr: Suivez les étapes ci-dessous pour créer une nouvelle cellule.

source: Make sure the last cell is selected.
fr: Assurez-vous que la dernière cellule est sélectionnée.

source: Press the ``Esc`` key, then follow it by pressing the ``B`` key. A new cell will be created below the current cell.
fr: Appuyez sur la touche ``Echap``, puis suivez-la en appuyant sur la touche ``B``. Une nouvelle cellule sera créée sous la cellule actuelle.

source: Use the method above to create a new cell.
fr: Utilisez la méthode ci-dessus pour créer une nouvelle cellule.

source: One of the most commonly used remote sensing indices is the Normalised Difference Vegetation Index or ``NDVI``. This index uses the ratio of the red and near-infrared (NIR) bands to identify live green vegetation. The formula for NDVI is:
fr: L'un des indices de télédétection les plus couramment utilisés est l'indice de végétation par différence normalisée ou ``NDVI``. Cet indice utilise le rapport des bandes rouge et proche infrarouge (NIR) pour identifier la végétation verte vivante. La formule du NDVI est:

source: \begin{aligned} \text{NDVI} & = \frac{(\text{NIR} - \text{Red})}{(\text{NIR} + \text{Red})} \\ \end{aligned}
fr: \ begin {aligné} \ text {NDVI} & = \ frac {(\ text {NIR} - \ text {Red})} {(\ text {NIR} + \ text {Red})} \\ \ end {aligné }

source: When interpreting this index, high values indicate vegetation, and low values indicate soil or water.
fr: Lors de l'interprétation de cet indice, les valeurs élevées indiquent la végétation et les valeurs faibles indiquent le sol ou l'eau.

source: Define NDVI formula
fr: Définir la formule NDVI

source: In a new cell, calculate the NDVI for the resampled geomedian dataset. To make it simpler, you can store the red and near-infrared bands in new variables, then calculate the NDVI using those variables, as shown below:
fr: Dans une nouvelle cellule, calculez le NDVI pour le jeu de données géomédian rééchantillonné. Pour simplifier les choses, vous pouvez stocker les bandes rouge et proche infrarouge dans de nouvelles variables, puis calculer le NDVI à l'aide de ces variables, comme indiqué ci-dessous:

source: Run the cell using ``Shift + Enter``.
fr: Exécutez la cellule en utilisant ``Maj + Entrée``.

source: Our calculation is now stored in the ``NDVI`` variable. To visualise it, we can attach the ``.plot()`` method, which will give us an image of the NDVI for each geomedian in our dataset. We can then customise the plot by passing parameters to the ``.plot()`` method, as shown below:
fr: Notre calcul est maintenant stocké dans la variable ``NDVI``. Pour le visualiser, nous pouvons attacher la méthode ``.plot ()``, qui nous donnera une image du NDVI pour chaque géomédian de notre jeu de données. Nous pouvons ensuite personnaliser le tracé en passant des paramètres à la méthode ``.plot()``, comme indiqué ci-dessous:

source: Run the cell using ``Shift + Enter``
fr: Exécutez la cellule en utilisant ``Maj + Entrée``

source: ``col='time'`` tells the plot that we want to display one image for each time step in our dataset.
fr: ``col = 'time'`` indique au tracé que nous voulons afficher une image pour chaque pas de temps dans notre jeu de données.

source: ``vmin=-0.50`` tells the plot to display all values below ``-0.50`` as the same colour. This can help keep contrast in the images (remember that NDVI can take values from -1 to 1).
fr: ``vmin=-0,50`` indique au tracé d'afficher toutes les valeurs inférieures à ``-0,50`` avec la même couleur. Cela peut aider à conserver le contraste dans les images (rappelez-vous que NDVI peut prendre des valeurs de -1 à 1).

source: ``vmax=0.8`` tells the plot to display all values above ``0.8`` as the same colour. This can help keep contrast in the images (remember that NDVI can take values from -1 to 1).
fr: ``vmax=0.8`` indique au tracé d'afficher toutes les valeurs supérieures à ``0.8`` sous la même couleur. Cela peut aider à conserver le contraste dans les images (rappelez-vous que NDVI peut prendre des valeurs de -1 à 1).

source: ``cmap='RdYlGn'`` tells the plot to display the NDVI values using a colour scale that ranges from red for low values to green for high values. This helps us because healthy vegetation shows up as green, and non-vegetation shows up as red.
fr: ``cmap = 'RdYlGn'`` indique au tracé d'afficher les valeurs NDVI en utilisant une échelle de couleurs allant du rouge pour les valeurs faibles au vert pour les valeurs élevées. Cela nous aide car la végétation saine apparaît en vert et la non-végétation apparaît en rouge.

source: If you implement the NDVI plotting code correctly, you should see the image below:
fr: Si vous implémentez correctement le code de traçage NDVI, vous devriez voir l'image ci-dessous:

source: In the image above, vegetation shows up as green (NDVI > 0). Sand shows up as yellow (NDVI ~ 0) and water shows up as red (NDVI < 0).
fr: Dans l'image ci-dessus, la végétation apparaît en vert (NDVI> 0). Le sable apparaît en jaune (NDVI ~ 0) et l'eau apparaît en rouge (NDVI <0).

source: While it is useful to see the NDVI values over the whole area in the plots above, it can sometimes be useful to calculate summary statistics, such as the mean NDVI for each geomedian. This can quickly reveal trends in vegetation health across time.
fr: Bien qu'il soit utile de voir les valeurs NDVI sur toute la zone dans les graphiques ci-dessus, il peut parfois être utile de calculer des statistiques récapitulatives, telles que le NDVI moyen pour chaque géomédian. Cela peut rapidement révéler les tendances de la santé de la végétation au fil du temps.

source: To calculate the mean NDVI, we can apply the ``.mean()`` method to our NDVI variable. We can also then apply the ``.plot()`` method to see the result, as shown below:
fr: Pour calculer le NDVI moyen, nous pouvons appliquer la méthode ``.mean()`` à notre variable NDVI. Nous pouvons également appliquer la méthode ``.plot()`` pour voir le résultat, comme indiqué ci-dessous:

source: ``NDVI.mean(dim=['x', 'y'])`` calculates the mean over all pixels, indicated by ``dim=['x', 'y']``. To instead calculate the mean over all times, you would write ``dim=['time']``.
fr: ``NDVI.mean (dim = ['x', 'y'])`` calcule la moyenne sur tous les pixels, indiquée par ``dim=['x', 'y']``. Pour calculer à la place la moyenne sur tous les temps, vous écririez ``dim=['time']``.

source: ``NDVI.mean(dim=['x', 'y']).plot(size=6)`` calculates the mean over all pixels, then plots the result. The ``size=6`` argument specifies the size of the plot.
fr: ``NDVI.mean (dim = ['x', 'y']). Plot (size = 6)`` calcule la moyenne sur tous les pixels, puis trace le résultat. L'argument ``size = 6`` spécifie la taille du tracé.

source: If you implement the calculation and plotting code correctly, you should see the image below:
fr: Si vous implémentez correctement le calcul et le code de traçage, vous devriez voir l'image ci-dessous:

source: Rather than a spatial view of NDVI at each time step, we see a single value (the mean NDVI) for each time.
fr: Plutôt qu'une vue spatiale du NDVI à chaque pas de temps, nous voyons une valeur unique (le NDVI moyen) pour chaque fois.

source: If you would like to add a title and y-axis label to this plot, you can add the following code below the command to calculate and plot the mean:
fr: Si vous souhaitez ajouter un titre et une étiquette sur l'axe des y à ce graphique, vous pouvez ajouter le code suivant sous la commande pour calculer et tracer la moyenne:

source: Congratulations! You have successfully calculated and visualised the NDVI for a series of geomedian composite images.
fr: Toutes nos félicitations! Vous avez calculé et visualisé avec succès le NDVI pour une série d'images composites géomédiennes.

source: If you’d like to experiment futher, try running the code with different areas. Did you learn anything interesting to share with us?
fr: Si vous souhaitez expérimenter davantage, essayez d'exécuter le code avec différentes zones. Avez-vous appris quelque chose d'intéressant à partager avec nous?

source: Session 4 Quiz and Solution
fr: Session 4 Quiz et solution

source: In Session 4, you created a notebook to load satellite products, resample the data into quarterly segments, and then calculate and plot the Normalised Difference Vegetation Index (NDVI). Combining bands into indices such as NDVI can yield important insights into the data which might not be apparent using true-color RGB imagery alone.
fr: Dans la session 4, vous avez créé un bloc-notes pour charger les produits satellites, rééchantillonner les données en segments trimestriels, puis calculer et tracer l'indice de végétation par différence normalisée (NDVI). La combinaison de bandes dans des indices tels que NDVI peut fournir des informations importantes sur les données qui peuvent ne pas être apparentes en utilisant uniquement des images RVB en couleurs vraies.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://docs.google.com/forms/d/e/1FAIpQLSffGiKtV5lgBBYrgBwplYUlDhsZ05td6CRAufJ05MeAkNRWMw/viewform?usp=sf_link>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `compléter le quiz <https://docs.google.com/forms/d/e/1FAIpQLSffGiKtV5lgBBYrgBwplYUlDhsZ05td6CRAufJ05MeAkNRWMw/sform05MeAkNRWMw/sviewf_linkf. >`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: The quiz will ask you to use the notebook you developed for this session’s exercise on calculating NDVI. If you would like to confirm that your notebook works as expected, you can check it against the solution notebook provided below.
fr: Le quiz vous demandera d'utiliser le bloc-notes que vous avez développé pour l'exercice de cette session sur le calcul du NDVI. Si vous souhaitez confirmer que votre ordinateur portable fonctionne comme prévu, vous pouvez le comparer au bloc-notes de solution fourni ci-dessous.

source: The solution notebooks below do not contain the answer to the quiz. Use them to check that you implemented the exercises correctly, then use your exercise notebook to answer the quiz. Accessing the solution notebook will not affect your progression towards the certificate.
fr: Les carnets de solutions ci-dessous ne contiennent pas la réponse au quiz. Utilisez-les pour vérifier que vous avez correctement mis en œuvre les exercices, puis utilisez votre cahier d'exercices pour répondre au quiz. L'accès au carnet de solutions n'affectera pas votre progression vers le certificat.

source: `Download the solution notebook for the Session 4 Part 1 exercise <../_static/session_4/Calculate_NDVI_Part_1_solution-annotated.ipynb>`__
fr: `Téléchargez le cahier de solutions pour l'exercice Session 4 Partie 1 <../_static/session_4/Calculate_NDVI_Part_1_solution-annotated.ipynb>`__

source: `Download the solution notebook for the Session 4 Part 2 exercise <../_static/session_4/Calculate_NDVI_Part_2_solution-annotated.ipynb>`__
fr: `Téléchargez le cahier de solution pour l'exercice Session 4 Partie 2 <../_static/session_4/Calculate_NDVI_Part_2_solution-annotated.ipynb>`__

source: To view a solution notebook on the Sandbox, you will need to first download it to your computer, then upload it to the Sandbox. Follow these instructions:
fr: Pour afficher un bloc-notes de solution sur le bac à sable, vous devez d'abord le télécharger sur votre ordinateur, puis le télécharger dans le bac à sable. Suivez ces instructions:

source: In this session, we will explore combining multiple bands into various indices to classify and measure terrain features.
fr: Dans cette session, nous explorerons la combinaison de plusieurs bandes en divers indices pour classer et mesurer les caractéristiques du terrain.

source: First, we will introduce several band indices and what they measure. Then we will calculate the geomedian for each season, and show how to measure changes in vegetation over time.
fr: Tout d'abord, nous présenterons plusieurs indices de bande et ce qu'ils mesurent. Ensuite, nous calculerons le géomédian pour chaque saison et montrerons comment mesurer les changements de végétation au fil du temps.

source: Building a case study: vegetation analysis
fr: Construire une étude de cas: analyse de la végétation

source: *The Crop Health notebook investigated in Session 1 is an example of a case study. We now have enough knowledge of the Sandbox to build a similar comprehensive vegetation analysis.*
fr: * Le cahier sur la santé des cultures étudié à la session 1 est un exemple d'étude de cas. Nous avons maintenant suffisamment de connaissances sur le bac à sable pour construire une analyse complète de la végétation similaire. *

source: In the `last session <../session_4/03_calculate_ndvi_part_2.ipynb>`__, we calculated the Normalised Difference Vegetation Index (NDVI) as a method of measuring green vegetation over an area of interest.
fr: Dans la `dernière session <../session_4/03_calculate_ndvi_part_2.ipynb>`__, nous avons calculé l'indice de végétation par différence normalisée (NDVI) comme méthode de mesure de la végétation verte sur une zone d'intérêt.

source: The index made the Earth observation data easier to analyse, and allowed comparison across time periods. In our NDVI map of a cropping field, we could see there were seasonal variations over the quarterly geomedians. However, that information by itself provides little context for further use. Why are we looking at this field? Do the results fit what we were expecting to see? What can we use this information for?
fr: L'indice a rendu les données d'observation de la Terre plus faciles à analyser et a permis une comparaison entre les périodes. Dans notre carte NDVI d'un champ de culture, nous avons pu voir qu'il y avait des variations saisonnières sur les géomédians trimestriels. Cependant, cette information en elle-même fournit peu de contexte pour une utilisation ultérieure. Pourquoi examinons-nous ce domaine? Les résultats correspondent-ils à ce que nous attendions? À quoi pouvons-nous utiliser ces informations?
