Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: **Spectral resolution:** 12 spectral bands — Coastal/Aerosol, Blue, Green, Red, Red Edge 1, Red Edge 2, Red Edge 3, Near-Infrared 1, Near-Infrared 2, Water Vapour, Short Wavelength Infrared 1, Short Wavelength Infrared 2
fr: **Résolution spectrale:** 12 bandes spectrales - côtière / aérosol, bleu, vert, rouge, bord rouge 1, bord rouge 2, bord rouge 3, proche infrarouge 1, proche infrarouge 2, vapeur d'eau, infrarouge à courte longueur d'onde 1 , Infrarouge à courte longueur d'onde 2

source: Note that standalone Sentinel-2A data exists for the period of 2015 – 2017, before Sentinel-2B was launched, but as such has a reduced temporal resolution.
fr: Notez que les données autonomes Sentinel-2A existent pour la période 2015-2017, avant le lancement de Sentinel-2B, mais en tant que telles, elles ont une résolution temporelle réduite.

source: For more details, see ``Sentinel_2.ipynb`` in the **Datasets** folder of the Sandbox.
fr: Pour plus de détails, consultez ``Sentinel_2.ipynb`` dans le dossier **Datasets** du Sandbox.

source: Which satellite product is ‘best’?
fr: Quel produit satellite est «meilleur»?

source: This question depends on the analysis you are doing. It helps to consider the available resolutions of the satellite products. For example:
fr: Cette question dépend de l'analyse que vous faites. Il permet de considérer les résolutions disponibles des produits satellites. Par exemple:

source: **Analysis timespan:** Recent short-term changes (for example, over a couple of months) are best captured by the Sentinel-2 product, which has good temporal resolution. However, if it were changes over several years, then the Landsat 8 product might be more suitable.
fr: **Période d'analyse:** Les changements récents à court terme (par exemple, sur quelques mois) sont mieux capturés par le produit Sentinel-2, qui a une bonne résolution temporelle. Cependant, s'il s'agissait de changements sur plusieurs années, le produit Landsat 8 pourrait être plus approprié.

source: **Analysis region:** Landsat 8 data can only be used on countries for which the data is currently available. For other areas, or continent-wide analyses, Sentinel-2 data should be selected.
fr: **Région d'analyse:** Les données Landsat 8 ne peuvent être utilisées que sur les pays pour lesquels les données sont actuellement disponibles. Pour d'autres domaines ou des analyses à l'échelle du continent, les données Sentinel-2 doivent être sélectionnées.

source: Now you know more about the main satellite products covered in this training course. We will use both Landsat 8 and Sentinel-2 in the upcoming data manipulation exercises.
fr: Vous en savez maintenant plus sur les principaux produits satellites couverts dans cette formation. Nous utiliserons Landsat 8 et Sentinel-2 dans les prochains exercices de manipulation de données.

source: Digital Earth Africa Map
fr: Carte numérique de l'Afrique de la Terre

source: Satellite products, as a dataset, are just a lot of numbers — not the most intuitive format when you are deciding how to analyse the data. It is much more helpful to see what the data looks like. The `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ portal helps users visualise Digital Earth Africa products by offering an interactive map.
fr: Les produits satellites, en tant qu'ensemble de données, ne sont que de nombreux nombres - pas le format le plus intuitif lorsque vous décidez comment analyser les données. Il est beaucoup plus utile de voir à quoi ressemblent les données. Le portail `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ aide les utilisateurs à visualiser les produits Digital Earth Africa en proposant une carte interactive.

source: In this section, we will show you how to navigate the `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__. This includes finding the longitude and latitude coordinates of a location. We will then walk through a short exercise on displaying Landsat 8 data on the Map.
fr: Dans cette section, nous allons vous montrer comment naviguer sur la `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__. Cela inclut la recherche des coordonnées de longitude et de latitude d'un emplacement. Nous allons ensuite parcourir un court exercice sur l'affichage des données Landsat 8 sur la carte.

source: Video: Introduction to the DE Africa Map
fr: Vidéo: Introduction à la carte de l'Afrique DE

source: This video will show you the basics of the Digital Earth Africa Map portal. In the video, a derived product (called ‘Water Observations from Space’) is loaded.
fr: Cette vidéo vous montrera les bases du portail Digital Earth Africa Map. Dans la vidéo, un produit dérivé (appelé «Observations de l’eau depuis l’espace») est chargé.

source: Watch the video to see the product loading process, then follow the written instructions in the exercise below to load and visualise Landsat 8 data.
fr: Regardez la vidéo pour voir le processus de chargement du produit, puis suivez les instructions écrites de l'exercice ci-dessous pour charger et visualiser les données Landsat 8.

source: Navigate the Digital Earth Africa Map
fr: Naviguer sur la carte numérique de l'Afrique de la Terre

source: To access the Map, open https://maps.digitalearth.africa/. This will bring you to the Digital Earth Africa Map user interface.
fr: Pour accéder à la carte, ouvrez https://maps.digitalearth.africa/. Cela vous amènera à l'interface utilisateur de Digital Earth Africa Map.

source: The Digital Earth Africa Map can be split into two sections. The exercise below will cover how to use both.
fr: La carte numérique de l'Afrique de la Terre peut être divisée en deux sections. L'exercice ci-dessous explique comment utiliser les deux.

source: **Data workbench (left side):** Allows users to select data they want to view on the Map. By default, no data is selected.
fr: **Data workbench (côté gauche):** Permet aux utilisateurs de sélectionner les données qu'ils souhaitent afficher sur la carte. Par défaut, aucune donnée n'est sélectionnée.

source: **Map interface (right side):** Displays the data selected in the workbench, and allows users to customise how the data is viewed. By default, it shows an Esri World Imagery Basemap.
fr: **Interface de la carte (côté droit):** Affiche les données sélectionnées dans l'atelier et permet aux utilisateurs de personnaliser la façon dont les données sont affichées. Par défaut, il affiche un fond de carte Esri World Imagery.

source: Longitude and latitude coordinates
fr: Coordonnées de longitude et de latitude

source: Click anywhere on the map interface to display the longitude and latitude of the selected point.
fr: Cliquez n'importe où sur l'interface de la carte pour afficher la longitude et la latitude du point sélectionné.

source: The selected point is shown by a blue location marker.
fr: Le point sélectionné est indiqué par un marqueur de position bleu.

source: Zoom in to the shaded area by scrolling up on your mouse or pressing the floating **+** button on the side of the map interface. Left-click and drag to pan the map.
fr: Effectuez un zoom avant sur la zone ombrée en faisant défiler votre souris vers le haut ou en appuyant sur le bouton flottant **+** sur le côté de l'interface de la carte. Cliquez avec le bouton gauche et faites glisser pour faire un panoramique de la carte.

source: The latitude and longitude coordinates are shown in the **Feature Information** window. You can highlight and copy them with your mouse.
fr: Les coordonnées de latitude et de longitude sont affichées dans la fenêtre **Feature Information**. Vous pouvez les mettre en évidence et les copier avec votre souris.

source: This function is useful when you want to perform analysis on a certain area, and need to input the longitude and latitude to load the data. We do not need coordinates for the exercise below.
fr: Cette fonction est utile lorsque vous souhaitez effectuer une analyse sur une certaine zone et devez saisir la longitude et la latitude pour charger les données. Nous n'avons pas besoin de coordonnées pour l'exercice ci-dessous.

source: The coordinates from Digital Earth Africa Maps are given in terms of degrees in the cardinal directions (North, East, South, West). Latitude coordinates may be North (N) or South (S). Longititude coordinates may be East (E) or West (W). If copying these values for use in the Sandbox, you must add a negative (-) sign to the latitude value if it is given as South, and you must add a negative (-) sign to the longitude value if it is given as West.
fr: Les coordonnées de Digital Earth Africa Maps sont données en degrés dans les directions cardinales (Nord, Est, Sud, Ouest). Les coordonnées de latitude peuvent être Nord (N) ou Sud (S). Les coordonnées de longititude peuvent être Est (E) ou Ouest (W). Si vous copiez ces valeurs pour les utiliser dans le bac à sable, vous devez ajouter un signe négatif (-) à la valeur de latitude si elle est donnée comme sud, et vous devez ajouter un signe négatif (-) à la valeur de longitude si elle est donnée comme ouest .

source: Exercise: Load Landsat 8 imagery
fr: Exercice: charger des images Landsat 8

source: This activity will demonstrate how to load Landsat 8 imagery onto the Digital Earth Africa Map. Follow the instructions below to open the dataset in the workbench and view it in the map interface.
fr: Cette activité montrera comment charger des images Landsat 8 sur la carte numérique de l'Afrique de la Terre. Suivez les instructions ci-dessous pour ouvrir le jeu de données dans l'atelier et l'afficher dans l'interface de la carte.

source: The video above refers to the dataset for Water Observations from Space, however this exercise will use the Landsat 8 dataset.
fr: La vidéo ci-dessus fait référence à l'ensemble de données pour les observations de l'eau depuis l'espace, mais cet exercice utilisera l'ensemble de données Landsat 8.

source: First, we need to select the Landsat 8 dataset. To add data to the data workbench, click **Add Data** to open the Data Catalogue.
fr: Tout d'abord, nous devons sélectionner le jeu de données Landsat 8. Pour ajouter des données à l'atelier de données, cliquez sur **Add Data** pour ouvrir le catalogue de données.

source: The datasets are organised by category. Landsat 8 is a satellite product, so select **Satellite images**. Click **Surface reflectance** and **Daily surface reflectance** to open the folder of Landsat surface reflectance products. Click **Surface reflectance (Landsat 8)**.
fr: Les ensembles de données sont organisés par catégorie. Landsat 8 est un produit satellite, alors sélectionnez **Satellite images**. Cliquez sur **Surface reflectance** et **Daily surface reflectance** (Réflexion de surface quotidienne) pour ouvrir le dossier des produits de réflectance de surface Landsat. Cliquez sur **Surface reflectance (Landsat 8)**.

source: The right panel will show information on the selected dataset. Click **Add to the map**. This will add the dataset to the workbench and close the Data Catalogue.
fr: Le panneau de droite affichera des informations sur l'ensemble de données sélectionné. Cliquez sur **Add to the map**. Cela ajoutera l'ensemble de données à l'atelier et fermera le catalogue de données.

source: The Landsat 8 data will be displayed in the map interface as blue shaded areas. By default, the data shows the latest available timestep. In this case, this is 25 January 2020.
fr: Les données Landsat 8 seront affichées dans l'interface de la carte sous forme de zones ombrées en bleu. Par défaut, les données affichent le dernier pas de temps disponible. Dans ce cas, nous sommes le 25 janvier 2020.

source: Zooming in on the shaded area will show the Landsat 8 data rendered as true-colour imagery. This is only one day of data, so not all of Africa is covered in the satellite flyover. Only the area inside the rectangle is Landsat 8 imagery.
fr: Un zoom avant sur la zone ombrée affichera les données Landsat 8 rendues sous forme d'images en couleurs vraies. Il ne s'agit que d'un jour de données, donc toute l'Afrique n'est pas couverte par le survol par satellite. Seule la zone à l'intérieur du rectangle est constituée d'images Landsat 8.

source: To see other days of data, click the date shown in the workbench dataset **Time** bar. This will open a menu that shows all available timesteps for the Landsat 8 product. Select a different time and see how the map shaded area changes.
fr: Pour afficher les autres jours de données, cliquez sur la date affichée dans la barre **Time** de l'ensemble de données de l'atelier. Cela ouvrira un menu qui affiche tous les pas de temps disponibles pour le produit Landsat 8. Sélectionnez une autre heure et voyez comment la zone ombrée de la carte change.

source: Congratulations — you have used the Digital Earth Africa Map to view Landsat 8 data.
fr: Félicitations, vous avez utilisé la carte numérique de l'Afrique de la Terre pour afficher les données Landsat 8.

source: Now you have successfully loaded Landsat 8 imagery on the Digital Earth Africa Map, try loading imagery for Sentinel-2.
fr: Maintenant que vous avez correctement chargé les images Landsat 8 sur la carte numérique de l'Afrique de la Terre, essayez de charger les images pour Sentinel-2.

source: **Hints:**
fr: **Astuces:**

source: The Sentinel-2 product is also a surface reflectance dataset
fr: Le produit Sentinel-2 est également un jeu de données de réflectance de surface

source: You can have multiple datasets in the workbench
fr: Vous pouvez avoir plusieurs ensembles de données dans l'atelier

source: **Other useful functions:**
fr: **Autres fonctions utiles:**

source: Click on the white square to deselect a dataset. This will keep it in the workbench but remove it from the map interface display
fr: Cliquez sur le carré blanc pour désélectionner un jeu de données. Cela le conservera dans l'établi mais le supprimera de l'affichage de l'interface de la carte

source: Click on **Remove** to remove the selected dataset
fr: Cliquez sur **Remove** pour supprimer l'ensemble de données sélectionné

source: Click on **Remove All** to clear all datasets from the workbench
fr: Cliquez sur **Remove All** pour effacer tous les ensembles de données de l'atelier

source: Details on other functions of the Digital Earth Africa Map can be found in the `Map portal user guide <./../Maps_help.ipynb>`__, but are not necessary to progress in the training course.
fr: Des détails sur les autres fonctions de la carte Digital Earth Africa peuvent être trouvés dans le `Guide de l'utilisateur du portail Map <./../Maps_help.ipynb>`__, mais ne sont pas nécessaires pour progresser dans la formation.

source: Using the `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__, we can see the satellite data in a visual way. This makes it easier to understand the scope of the data we are analysing. It is also a useful tool for pinpointing longitude and latitude coordinates of areas of interest.
fr: En utilisant la `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__, nous pouvons voir les données satellitaires de manière visuelle. Cela facilite la compréhension de la portée des données que nous analysons. C'est également un outil utile pour localiser les coordonnées de longitude et de latitude des zones d'intérêt.

source: Data availability
fr: Disponibilité des données

source: In the `previous section <./02_deafrica_map.ipynb>`__, we loaded the Landsat 8 dataset onto the `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ and saw it only covers certain parts of Africa on each day. The `section on Digital Earth Africa products <./01_products_intro.ipynb>`__ tells us Landsat 8 data is only available at certain times in some countries.
fr: Dans la `section précédente <./02_deafrica_map.ipynb>`__, nous avons chargé l'ensemble de données Landsat 8 sur la `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ et avons vu qu'il ne couvre que certaines parties de L'Afrique chaque jour. La `section sur les produits Digital Earth Africa <./01_products_intro.ipynb>`__ nous indique que les données Landsat 8 ne sont disponibles qu'à certains moments dans certains pays.

source: How do we know specifically **where** and **when** data is available? Before we start any analysis, we can answer this question by verifying existing data on the `Digital Earth Africa Metadata Explorer <https://explorer.digitalearth.africa/>`__. The Metadata Explorer can be found at https://explorer.digitalearth.africa/.
fr: Comment savons-nous précisément**où** et**quand** les données sont disponibles? Avant de commencer toute analyse, nous pouvons répondre à cette question en vérifiant les données existantes sur le `Digital Earth Africa Metadata Explorer <https://explorer.digitalearth.africa/>`__. L'explorateur de métadonnées se trouve à l'adresse https://explorer.digitalearth.africa/.

source: In this section, we will use the `Digital Earth Africa Metadata Explorer <https://explorer.digitalearth.africa/>`__ to check where data is available for a selected time period. The place we will investigate is Tanzania, for the time period of 2018.
fr: Dans cette section, nous utiliserons `l'explorateur de métadonnées Digital Earth Africa <https://explorer.digitalearth.africa/>`__ pour vérifier où les données sont disponibles pour une période donnée. L'endroit sur lequel nous allons enquêter est la Tanzanie, pour la période de 2018.

source: Map or Explorer?
fr: Carte ou explorateur?

source: The `Digital Earth Africa Metadata Explorer <https://explorer.digitalearth.africa/>`__ and `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ look similar, but they are designed for different purposes.
fr: `L'explorateur de métadonnées Digital Earth Africa <https://explorer.digitalearth.africa/>`__ et `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ se ressemblent, mais ils sont conçus pour différents fins.

source: Use the `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ if you:
fr: Utilisez la `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__ si vous:

source: Want to see what the product or dataset looks like
fr: Vous voulez voir à quoi ressemble le produit ou l'ensemble de données

source: Use the `Digital Earth Africa Metadata Explorer <https://explorer.digitalearth.africa/>`__ if you:
fr: Utilisez `l'explorateur de métadonnées Digital Earth Africa <https://explorer.digitalearth.africa/>`__ si vous:

source: Want to know exactly where and when you can find data
fr: Vous voulez savoir exactement où et quand vous pouvez trouver des données

source: Exercise: Data for Tanzania in 2018
fr: Exercice: données pour la Tanzanie en 2018

source: Open the Digital Earth Africa Metadata Explorer
fr: Ouvrez l'explorateur de métadonnées Digital Earth Africa

source: Open https://explorer.digitalearth.africa/. This will display the Metadata Explorer user interface.
fr: Ouvrez https://explorer.digitalearth.africa/. Cela affichera l'interface utilisateur de Metadata Explorer.

source: The Digital Earth Africa Metadata Explorer has four main sections.
fr: L'explorateur de métadonnées Digital Earth Africa comprend quatre sections principales.

source: **Product selection:** This shows the currently-selected product. Click the selected product name to open the products dropdown menu.
fr: **Sélection de produits:** Ceci montre le produit actuellement sélectionné. Cliquez sur le nom du produit sélectionné pour ouvrir le menu déroulant des produits.

source: **Time period:** This shows the time period for which the selected product is being displayed. Click the selected time period to open the time selection dropdown menu.
fr: **Période:** Ceci indique la période pendant laquelle le produit sélectionné est affiché. Cliquez sur la période sélectionnée pour ouvrir le menu déroulant de sélection de l'heure.

source: **Map display:** This shows where data is available, for the selected time and product. Blue shaded tiles indicate the presence of data.
fr: **Affichage de la carte:** Ceci montre où les données sont disponibles, pour l'heure et le produit sélectionnés. Les tuiles bleues indiquent la présence de données.

source: **Product information:** The sidebar shows more information about the data for the selected time and product. For example, this includes how many datasets are selected, the name of the datasets in the product, and its coordinate reference system.
fr: **Informations sur le produit:** La barre latérale affiche plus d'informations sur les données pour l'heure et le produit sélectionnés. Par exemple, cela inclut le nombre de jeux de données sélectionnés, le nom des jeux de données dans le produit et son système de référence de coordonnées.

source: Select the Landsat 8 product
fr: Sélectionnez le produit Landsat 8

source: Click the **product selection** bar to open the dropdown menu. Select **ls8_usgs_sr_scene**. This selects the Landsat 8 product.
fr: Cliquez sur la barre de **sélection de produits** pour ouvrir le menu déroulant. Sélectionnez **ls8_usgs_sr_scene**. Ceci sélectionne le produit Landsat 8.

source: Click the **time** bar to open the dropdown menu. Select **2018**. This will show all Landsat 8 datasets for 2018.
fr: Cliquez sur la barre **heure** pour ouvrir le menu déroulant. Sélectionnez **2018**. Cela affichera tous les ensembles de données Landsat 8 pour 2018.

source: The **map display** will now show all the Landsat 8 datasets for the year of 2018 as blue shaded boxes. Use the **+** button on the map to zoom in, and click and drag to pan the map.
fr: **L'affichage de la carte** affichera désormais tous les jeux de données Landsat 8 pour l'année 2018 sous forme de cases bleues. Utilisez le bouton **+** sur la carte pour effectuer un zoom avant, et cliquez et faites glisser pour faire un panoramique sur la carte.

source: We can see that there is only data available for some African countries. Let’s take a closer look at Tanzania.
fr: On voit qu'il n'y a que des données disponibles pour certains pays africains. Regardons de plus près la Tanzanie.

source: Zoom in on Tanzania
fr: Zoom sur la Tanzanie

source: Use the map’s **+** button to zoom in on Africa. Click and drag to see Tanzania.
fr: Utilisez le bouton **+** de la carte pour zoomer sur l’Afrique. Cliquez et faites glisser pour voir la Tanzanie.

source: We can see the data for 2018 (blue shaded boxes) covers all of Tanzania, which means areas within Tanzania are a suitable location to choose for data analysis. For example, we would not be able to do any 2018 Landsat 8 analysis over the city of Nacala in Mozambique, as it does not have any data available for that time.
fr: Nous pouvons voir que les données pour 2018 (encadrés bleus) couvrent toute la Tanzanie, ce qui signifie que les zones en Tanzanie sont un emplacement approprié pour l'analyse des données. Par exemple, nous ne pourrions pas effectuer d'analyse Landsat 8 2018 sur la ville de Nacala au Mozambique, car elle ne dispose d'aucune donnée pour cette période.

source: You now know how to use the Digital Earth Africa Metadata Explorer to check where and when you can perform data analysis. The next step is loading the data.
fr: Vous savez maintenant comment utiliser l'explorateur de métadonnées de Digital Earth Africa pour vérifier où et quand vous pouvez effectuer l'analyse des données. L'étape suivante consiste à charger les données.

source: Loading data in the Sandbox
fr: Chargement des données dans le bac à sable
