Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Session 6: Water Analyses
fr: Session 6: Analyses de l'eau

source: In this session, we will continue to combine many of the techniques you've learned during the training course to build a complete case study. This is where you have a question in mind that you want to answer, load and analyse the appropriate data, then draw conclusions to try and answer your question.
fr: Dans cette session, nous continuerons à combiner plusieurs des techniques que vous avez apprises pendant la formation pour construire une étude de cas complète. C'est là que vous avez une question en tête à laquelle vous souhaitez répondre, charger et analyser les données appropriées, puis tirer des conclusions pour essayer de répondre à votre question.

source: This session will focus on case studies related to water. First, we'll cover the available water and coastal case studies on the Sandbox, as well as covering the **Water Observations from Space (WOfS)** dataset. Then, you'll work through building your own case study to monitor water extent over time.
fr: Cette session se concentrera sur des études de cas liées à l'eau. Tout d'abord, nous couvrirons les études de cas disponibles sur l'eau et le littoral sur le bac à sable, ainsi que l'ensemble de données **Water Observations from Space (WOfS)**. Ensuite, vous travaillerez à la construction de votre propre étude de cas pour surveiller l'étendue de l'eau au fil du temps.

source: To run this notebook, go to the main menu bar and select ``Run -> Restart Kernel and Run All Cells...``. Click ``Restart``. The notebook may take a few minutes to finish computing. You will know it is complete when you see the app appear (it will look like the example in the next session, but you will be able to move the sliders).
fr: Pour exécuter ce notebook, allez dans la barre de menu principale et sélectionnez ``Run -> Restart Kernel and Run All Cells...``. Cliquez sur ``Restart``. L'ordinateur portable peut prendre quelques minutes pour terminer le calcul. Vous saurez qu'elle est terminée lorsque vous verrez apparaître l'application (elle ressemblera à l'exemple de la prochaine session, mais vous pourrez déplacer les curseurs).
