Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: You should end up with a set of parameters that look like this:
fr: Vous devriez vous retrouver avec un ensemble de paramètres qui ressemblent à ceci:

source: Run the cell to load Sentinel-2 data.
fr: Exécutez la cellule pour charger les données Sentinel-2.

source: In the new cell below that, let us plot an RGB image around the same time as the Landsat 8 RGB image, which was from February 16, 2018.
fr: Dans la nouvelle cellule ci-dessous, traçons une image RVB à peu près au même moment que l'image RVB Landsat 8, qui date du 16 février 2018.

source: We must specify the dataset first, followed by the bands, index, and size. In this case, we want to use ``index=9``. Ensure the cell has the following code and then run it.
fr: Nous devons d'abord spécifier le jeu de données, suivi des bandes, de l'index et de la taille. Dans ce cas, nous voulons utiliser ``index = 9``. Assurez-vous que la cellule contient le code suivant, puis exécutez-la.

source: An RGB image using Sentinel-2 data will be generated.
fr: Une image RVB utilisant les données Sentinel-2 sera générée.

source: As Landsat 8 data and Sentinel-2 data come from different satellites, their flyovers are not always at the same time. In this case, the closest date of Sentinel-2 data to the Landsat data is one day before, on February 15, 2018. It is another cloudy scene, like the Landsat 8 one.
fr: Comme les données Landsat 8 et Sentinel-2 proviennent de différents satellites, leurs survols ne se font pas toujours en même temps. Dans ce cas, la date la plus proche des données Sentinel-2 des données Landsat est la veille, le 15 février 2018. Il s'agit d'une autre scène nuageuse, comme celle de Landsat 8.

source: You have successfully loaded and plotted data for Landsat 8 and Sentinel-2.
fr: Vous avez correctement chargé et tracé les données pour Landsat 8 et Sentinel-2.

source: You have also finished the second session of the Digital Earth Africa training course. In this session, you have learned about:
fr: Vous avez également terminé la deuxième session du cours de formation Digital Earth Africa. Au cours de cette session, vous avez découvert:

source: Digital Earth Africa products, including Landsat 8 and Sentinel-2
fr: Produits Digital Earth Africa, y compris Landsat 8 et Sentinel-2

source: Visualising data with the `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__
fr: Visualisation des données avec la `Digital Earth Africa Map <https://maps.digitalearth.africa/>`__

source: Exploring data availability with the `Digital Earth Africa Explorer <https://explorer.digitalearth.africa/>`__
fr: Explorer la disponibilité des données avec `Digital Earth Africa Explorer <https://explorer.digitalearth.africa/>`__

source: Generating RGB images
fr: Générer des images RVB

source: Congratulations!
fr: Toutes nos félicitations!

source: Session 2 Quiz and Solution
fr: Session 2 Quiz et solution

source: In Session 2, you constructed a notebook to load satellite products and visualise the loaded data as true-colour images. This is often an important step when working with satellite data as it provides a first glimpse of the data, which can help direct your analysis.
fr: Au cours de la session 2, vous avez construit un bloc-notes pour charger les produits satellites et visualiser les données chargées sous forme d'images en couleurs vraies. Il s'agit souvent d'une étape importante lorsque vous travaillez avec des données satellitaires, car cela fournit un premier aperçu des données, ce qui peut vous aider à orienter votre analyse.

source: If you would like to be awarded a certificate of achievement at the end of the course, we ask that you `complete the quiz <https://docs.google.com/forms/d/e/1FAIpQLSeE7pdbIEaJq-5FLZaGwn6FkVuo_Pfzkpfsd1kgNy1XcnNi1A/viewform?usp=sf_link>`__. You will need to supply your email address to progress towards the certificate. After you complete the quiz, you can check if your answers were correct by pressing the **View Accuracy** button.
fr: Si vous souhaitez obtenir un certificat de réussite à la fin du cours, nous vous demandons de `répondre au quiz <https://docs.google.com/forms/d/e/1FAIpQLSeE7pdbIEaJq-5FLZaGwn6FkVuo_Pfzkpfsdform1kgNy1XcnNi1A/view = lien_sf>`__. Vous devrez fournir votre adresse e-mail pour progresser vers le certificat. Après avoir terminé le quiz, vous pouvez vérifier si vos réponses étaient correctes en appuyant sur le bouton **Afficher la précision**.

source: The quiz will ask you to use the notebook you developed for this session’s exercise on loading data. If you would like to confirm that your notebook works as expected, you can check it against the solution notebook provided below.
fr: Le quiz vous demandera d'utiliser le bloc-notes que vous avez développé pour l'exercice de cette session sur le chargement des données. Si vous souhaitez confirmer que votre ordinateur portable fonctionne comme prévu, vous pouvez le comparer au bloc-notes de solution fourni ci-dessous.

source: The solution notebook below does not contain the answer to the quiz. Use it to check that you implemented the exercise correctly, then use your exercise notebook to answer the quiz. Accessing the solution notebook will not affect your progression towards the certificate.
fr: Le cahier de solutions ci-dessous ne contient pas la réponse au quiz. Utilisez-le pour vérifier que vous avez correctement mis en œuvre l'exercice, puis utilisez votre cahier d'exercices pour répondre au quiz. L'accès au carnet de solutions n'affectera pas votre progression vers le certificat.

source: Solution notebook
fr: Cahier de solution

source: We strongly encourage you to attempt the exercise on the previous page before downloading the solution below. This will help you learn how to use the Sandbox independently for your own analyses.
fr: Nous vous encourageons vivement à essayer l'exercice de la page précédente avant de télécharger la solution ci-dessous. Cela vous aidera à apprendre à utiliser le bac à sable indépendamment pour vos propres analyses.

source: `Download the solution notebook for the Session 2 exercise <../_static/session_2/Load_data_solution.ipynb>`__
fr: `Téléchargez le cahier de solution pour l'exercice Session 2 <../_static/session_2/Load_data_solution.ipynb>`__

source: Session 2: Datasets
fr: Session 2: Ensembles de données

source: This session is all about the datasets available through Digital Earth Africa. These datasets can be visualised through the Digital Earth Africa Map, or sorted by availability in the Digital Earth Africa Metadata Explorer. This session will cover how to use the Digitial Africa Sandbox to load datasets for a given area of interest and make a colour image.
fr: Cette session porte sur les ensembles de données disponibles via Digital Earth Africa. Ces ensembles de données peuvent être visualisés via la carte Digital Earth Africa ou triés par disponibilité dans l'explorateur de métadonnées Digital Earth Africa. Cette session couvrira comment utiliser le Digitial Africa Sandbox pour charger des ensembles de données pour une zone d'intérêt donnée et créer une image couleur.

source: Click on **Digital Earth Africa products** to get started. If you would like to review Session 1 content first, click **Session 1: Introduction** in the side menu.
fr: Cliquez sur **Produits Digital Earth Africa** pour commencer. Si vous souhaitez d'abord consulter le contenu de la session 1, cliquez sur **Session 1: Introduction** dans le menu latéral.

source: Introduction to cloud-free composites
fr: Introduction aux composites sans cloud

source: This session is about creating representative datasets and images from multiple timesteps. This allows us to remove and replace unwanted data, such as clouds, and also form images that accurately represent the area of interest over a period of time.
fr: Cette session consiste à créer des ensembles de données et des images représentatifs à partir de plusieurs pas de temps. Cela nous permet de supprimer et de remplacer les données indésirables, telles que les nuages, et également de former des images qui représentent avec précision la zone d'intérêt sur une période de temps.

source: This is summarised in this week’s video, **Time aggregation of data**. Watch the video to see how to use Earth observation data at different points in time.
fr: Ceci est résumé dans la vidéo de cette semaine, **Time aggregation of data**. Regardez la vidéo pour découvrir comment utiliser les données d'observation de la Terre à différents moments.

source: Video: Time aggregation of data
fr: Vidéo: agrégation temporelle des données

source: `Download the video slides as a PDF <../_static/session_3/Week3_Time-aggregation-of-data.pdf>`__
fr: `Téléchargez les diapositives vidéo au format PDF <../_static/session_3/Week3_Time-aggregation-of-data.pdf>`__

source: In the video, we saw that we can compensate for missing or cloudy data points by using data from different points in time to fill in the gaps. This is a two-step process:
fr: Dans la vidéo, nous avons vu que nous pouvons compenser les points de données manquants ou troubles en utilisant des données de différents points dans le temps pour combler les lacunes. Il s'agit d'un processus en deux étapes:

source: Identify and remove cloudy data — this is known as ‘cloud masking’
fr: Identifiez et supprimez les données troubles - c'est ce qu'on appelle le «masquage du cloud»

source: Use data from a different time to fill in missing data — this can be done by calculating geomedians
fr: Utilisez des données d'une autre époque pour remplir les données manquantes - cela peut être fait en calculant les géomédiens

source: In this section, we focus on why cloud masking is an important step in preparing your dataset, and introduce the easiest way to do this in the Sandbox. We then briefly explain the significance of geomedians compared to other statistical values.
fr: Dans cette section, nous nous concentrons sur les raisons pour lesquelles le masquage cloud est une étape importante dans la préparation de votre ensemble de données et présentons le moyen le plus simple de le faire dans le bac à sable. Nous expliquons ensuite brièvement la signification des géomédiens par rapport à d'autres valeurs statistiques.

source: The two pages following this introduction will involve walkthrough exercises, so you can try performing these steps yourself after reading about them in this section.
fr: Les deux pages qui suivent cette introduction impliqueront des exercices pas à pas, vous pouvez donc essayer d'effectuer ces étapes vous-même après avoir lu à leur sujet dans cette section.

source: Recap: loading and plotting data
fr: Récapitulatif: chargement et traçage des données

source: In the `last session <../session_2/04_load_data_exercise.ipynb>`__, we plotted RGB images for Dar es Salaam in Tanzania. The image had clouds in both the Landsat 8 and Sentinel-2 versions.
fr: Dans la `dernière session <../session_2/04_load_data_exercise.ipynb>`__, nous avons tracé des images RVB pour Dar es Salaam en Tanzanie. L'image avait des nuages dans les versions Landsat 8 et Sentinel-2.

source: *Landsat 8 data from 16 February 2018 (left), and Sentinel-2 data from 15 February 2018 (right). Some cloud cover is visible in both images.*
fr: * Données Landsat 8 du 16 février 2018 (à gauche) et données Sentinel-2 du 15 février 2018 (à droite). Une certaine couverture nuageuse est visible sur les deux images. *

source: What if we want to know what is underneath those clouds? If you have data at only one point in time, this is not possible. However, if we have data for the same place at a different time, when the clouds are not present, we can use this data to ‘fill’ in areas of cloud.
fr: Et si nous voulons savoir ce qu'il y a sous ces nuages? Si vous ne disposez de données qu'à un moment donné, cela n'est pas possible. Cependant, si nous avons des données pour le même endroit à un moment différent, lorsque les nuages ne sont pas présents, nous pouvons utiliser ces données pour «remplir» des zones de nuage.

source: To do that, we must first identify which pixels are clouds. The process of determining and removing cloud data points is known as ‘cloud masking’.
fr: Pour ce faire, nous devons d'abord identifier quels pixels sont des nuages. Le processus de détermination et de suppression des points de données cloud est appelé «masquage cloud».

source: ``load_ard()`` vs ``dc.load()``
fr: ``load_ard()`` contre ``dc.load()``

source: The easiest way to apply a cloud mask to your dataset is to load it into the Sandbox using the ``load_ard()`` function. ``ard`` stands for ‘Analysis-Ready Data’ and the ``load_ard()`` function automatically applies a cloud mask.
fr: Le moyen le plus simple d'appliquer un masque de cloud à votre ensemble de données est de le charger dans le bac à sable à l'aide de la fonction ``load_ard()``. ``ard`` signifie ``Analysis-Ready Data`` et la fonction ``load_ard()`` applique automatiquement un masque de nuage.

source: We previously loaded data in the Sandbox using ``dc.load()``. ``dc.load()`` is a universal function for loading data from the datacube and it is important to know how to use it. However, it does not have a built-in cloud masking capability.
fr: Nous avons précédemment chargé des données dans le bac à sable en utilisant ``dc.load()``. ``dc.load()`` est une fonction universelle pour charger des données depuis le datacube et il est important de savoir comment l'utiliser. Cependant, il n'a pas de capacité de masquage de cloud intégrée.

source: When we plotted the RGB images of Tanzania with data loaded using ``dc.load()``, the clouds were part of the image. This makes it difficult to perform cloud masking, as the dataset does not distinguish cloud and not-cloud.
fr: Lorsque nous avons tracé les images RVB de la Tanzanie avec des données chargées à l'aide de ``dc.load()``, les nuages faisaient partie de l'image. Cela rend difficile le masquage du cloud, car l'ensemble de données ne fait pas la distinction entre le cloud et le non-cloud.

source: In this exercise, we will instead use the command ``load_ard()`` to load our data. It demands similar parameters to ``dc.load()``, but automatically identifies pixels of cloud, and applies cloud masking to the loaded data.
fr: Dans cet exercice, nous utiliserons plutôt la commande ``load_ard()`` pour charger nos données. Il exige des paramètres similaires à ``dc.load()``, mais identifie automatiquement les pixels du cloud et applique un masquage du cloud aux données chargées.

source: *Sentinel-2 data from 15 February 2018 loaded with* ``dc.load()`` *(left) and* ``load_ard()`` *(right). The* ``dc.load`` *image shows cloud cover, while the white pixels in the* ``load_ard`` *image are not clouds, but points where data has been removed by the cloud mask.*
fr: * Données Sentinel-2 du 15 février 2018 chargées avec * ``dc.load()`` * (à gauche) et * ``load_ard()`` * (à droite). L'image * ``dc.load`` * montre la couverture nuageuse, tandis que les pixels blancs de l'image * ``load_ard`` * ne sont pas des nuages, mais des points où les données ont été supprimées par le masque de nuage. *

source: The cloud masking algorithm on Sentinel-2 data is more aggressive than its Landsat 8 counterpart. This means it sometimes misinteprets white sand beaches or urban regions as cloud. This can reduce the amount of data available.
fr: L'algorithme de masquage du cloud sur les données Sentinel-2 est plus agressif que son homologue Landsat 8. Cela signifie qu'il interprète parfois à tort les plages de sable blanc ou les régions urbaines comme des nuages. Cela peut réduire la quantité de données disponibles.

source: ``load_ard()`` is compatible with both the Sentinel-2 dataset and the Landsat 8 dataset we used in the last session. However, it is not compatible with some other Digital Earth Africa products, such as Water Observations from Space, with which you will need to use ``dc.load()``.
fr: ``load_ard()`` est compatible avec le jeu de données Sentinel-2 et le jeu de données Landsat 8 que nous avons utilisé lors de la dernière session. Cependant, il n'est pas compatible avec certains autres produits Digital Earth Africa, tels que Water Observations from Space, avec lesquels vous devrez utiliser ``dc.load()``.

source: Calculating a composite
fr: Calcul d'un composite

source: Now that we know how to mask out clouds by using ``load_ard()``, we can load multiple timesteps of our cloud-masked data. These need to be combined in a meaningful way to produce a single image. We do this by compositing our data.
fr: Maintenant que nous savons comment masquer les nuages en utilisant ``load_ard()``, nous pouvons charger plusieurs pas de temps de nos données masquées par le nuage. Ceux-ci doivent être combinés de manière significative pour produire une seule image. Nous faisons cela en composant nos données.

source: Compositing creates one value for each band for each pixel based on the time series data for that pixel.
fr: La composition crée une valeur pour chaque bande pour chaque pixel en fonction des données de série chronologique pour ce pixel.

source: We will briefly compare median and geomedian composites, and explain why it is more reliable to use geomedians.
fr: Nous comparerons brièvement les composites médians et géomédiens, et expliquerons pourquoi il est plus fiable d'utiliser des géomédiens.

source: Median composites
fr: Composites médians

source: For each band in the image, median composites set the value of each pixel to the median value for that band. For a given pixel, each band’s median is independent of the others.
fr: Pour chaque bande de l'image, les composites médians définissent la valeur de chaque pixel sur la valeur médiane de cette bande. Pour un pixel donné, la médiane de chaque bande est indépendante des autres.

source: The benefit of a median composite is that it is very fast to compute, so it can be used to quickly create cloud-free images for an area.
fr: L'avantage d'un composite médian est qu'il est très rapide à calculer, il peut donc être utilisé pour créer rapidement des images sans nuage pour une zone.

source: However, medians do not account for the fact that every pixel holds information for multiple bands. It is therefore better to use a statistic that is configured for multi-dimensional data, such as a geomedian.
fr: Cependant, les médianes ne tiennent pas compte du fait que chaque pixel contient des informations pour plusieurs bandes. Il est donc préférable d'utiliser une statistique configurée pour des données multidimensionnelles, comme un géomédian.

source: *A median considers data from each band independently. This can be seen in Step 2 of the median compositing algorithm shown above.*
fr: * Une médiane considère les données de chaque bande indépendamment. Cela peut être vu à l'étape 2 de l'algorithme de composition médiane illustré ci-dessus. *

source: Geomedian composites
fr: Composites géomédiens

source: Geomedian — or ‘geometric median’ — composites are multi-band generalisations of median composites. Instead of finding a pixel’s median value for each band **individually**, like a median composite does, a geomedian composite finds the median values of the bands for each pixel when considered **together**.
fr: Les composites géomédiens - ou «médianes géométriques» - sont des généralisations multibandes de composites médians. Au lieu de rechercher la valeur médiane d'un pixel pour chaque bande **individuellement**, comme le fait un composite médian, un composite géomédian trouve les valeurs médianes des bandes pour chaque pixel lorsqu'ils sont considérés **ensemble**.

source: This means they represent the data **better** than median composites.
fr: Cela signifie qu'ils représentent les données **mieux** que les composites médians.

source: *Unlike the median composite, the geometric median (geomedian) considers all bands of data together. Each band adds a dimension to the geomedian calculation. For a three-band dataset, such as the RGB dataset shown in the geomedian compositing algorithm above, each point can be represented on a three-dimensional scatter plot. The geomedian is the minimised ‘sum of distances’ between all the points.*
fr: * Contrairement au composite médian, la médiane géométrique (géomédiane) considère toutes les bandes de données ensemble. Chaque bande ajoute une dimension au calcul géomédian. Pour un jeu de données à trois bandes, tel que le jeu de données RVB présenté dans l'algorithme de composition géomédian ci-dessus, chaque point peut être représenté sur un nuage de points en trois dimensions. Le géomédian est la «somme des distances» minimisée entre tous les points. *

source: Comparing medians and geomedians
fr: Comparaison des médianes et des géomédians

source: The difference between medians and geomedians can often be subtle, especially if you are looking at the overall composite image. For example, the RGB images for these median and geomedian composites look almost identical.
fr: La différence entre les médianes et les géomédians peut souvent être subtile, surtout si vous regardez l'image composite globale. Par exemple, les images RVB de ces composites médian et géomédian semblent presque identiques.

source: However, on a pixel-by-pixel basis, it is possible to visualise the difference between median and geomedian. The best way to do this is to use the **geomedian widget** to explore the effects of different datasets on the median and geomedian.
fr: Cependant, pixel par pixel, il est possible de visualiser la différence entre la médiane et le géomédian. La meilleure façon de faire est d'utiliser le **widget geomedian** pour explorer les effets de différents ensembles de données sur la médiane et le géomédian.

source: The geomedian widget uses interactive sliders to change the value of the data. This affects the output median and geomedian values. You will soon see that each compositing method can produce significantly different results. On a larger scale (like a whole image, or over several years), this can affect the end composite image.
fr: Le widget geomedian utilise des curseurs interactifs pour modifier la valeur des données. Cela affecte les valeurs médiane et géomédiane en sortie. Vous verrez bientôt que chaque méthode de composition peut produire des résultats très différents. À plus grande échelle (comme une image entière, ou sur plusieurs années), cela peut affecter l'image composite finale.

source: `Download the widget notebook here <../_static/other_information/Geomedian_interactive_extend1.ipynb>`__ or visit the `Geomedian widget <../Geomedian_widget.ipynb>`__ page for for more information, including instructions on running the widget.
fr: `Téléchargez le bloc-notes des widgets ici <../_static/other_information/Geomedian_interactive_extend1.ipynb>`__ ou visitez la page `Geomedian widget <../Geomedian_widget.ipynb>`__ pour plus d'informations, y compris des instructions sur l'exécution du widget.

source: The bottom line: use geomedians
fr: L'essentiel: utilisez les géomédiens

source: Geomedians take more processing time to calculate than median composites. However, unless you are only doing a quick visualisation, you should use the geomedian method when creating composites. This is because the geomedian value is more scientifically rigorous as it accounts for all the bands in the dataset.
fr: Les géomédiatiques prennent plus de temps à calculer que les composites médians. Cependant, à moins que vous n'effectuiez une visualisation rapide, vous devez utiliser la méthode geomedian lors de la création de composites. En effet, la valeur géomédiane est plus rigoureuse scientifiquement car elle prend en compte toutes les bandes de l'ensemble de données.
