Repository: digitalearthafrica/deafrica-training-workshop
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: In this exercise, we will load data from the datacube. First, we will set up a new notebook to work in. Then, we will load Landsat data for a specific time, and use that data to plot a colour image. Finally, we will show you how to modify the load process to load and plot Sentinel-2 data.
fr: Dans cet exercice, nous chargerons les données du datacube. Tout d'abord, nous allons configurer un nouveau bloc-notes pour travailler. Ensuite, nous chargerons les données Landsat pendant une durée spécifique et utiliserons ces données pour tracer une image couleur. Enfin, nous vous montrerons comment modifier le processus de chargement pour charger et tracer les données Sentinel-2.

source: Make a new notebook
fr: Créer un nouveau cahier

source: Let’s create a new, blank Jupyter notebook for this exercise.
fr: Créons un nouveau bloc-notes Jupyter vierge pour cet exercice.

source: Navigate to the **Training** folder. The **Training** folder was created as part of Session 1, for copying and running the Crop Health notebook. If you do not have this folder in the Sandbox, you can create it by following the steps in `Running a Notebook <../session_1/04_running_a_notebook.ipynb>`__.
fr: Accédez au dossier **Training**. Le dossier **Training** a été créé dans le cadre de la session 1, pour copier et exécuter le bloc-notes Crop Health. Si vous ne disposez pas de ce dossier dans le bac à sable, vous pouvez le créer en suivant les étapes de `Exécution d'un bloc-notes <../session_1/04_running_a_notebook.ipynb>`__.

source: If Launcher is not the active tab in the main work area (right pane), click the **+** button at the top of the left sidebar to open the launcher in the right pane.
fr: Si Le lanceur n'est pas l'onglet actif dans la zone de travail principale (volet droit), cliquez sur le bouton **+** en haut de la barre latérale gauche pour ouvrir le lanceur dans le volet droit.

source: In the **Notebook** section of Launcher, select the **Python 3** option to create a new notebook in the current directory.
fr: Dans la section **Notebook** de Launcher, sélectionnez l'option **Python 3** pour créer un nouveau notebook dans le répertoire actuel.

source: The new notebook will be called ``Untitled.ipynb``, but you can rename it. Right-click the notebook in the file menu and select **Rename**.
fr: Le nouveau notebook s'appellera ``Untitled.ipynb``, mais vous pouvez le renommer. Cliquez avec le bouton droit sur le bloc-notes dans le menu Fichier et sélectionnez **Rename**.

source: Type in the desired name. For example, we can call it ``Load_data.ipynb``.
fr: Tapez le nom souhaité. Par exemple, nous pouvons l'appeler ``Load_data.ipynb``.

source: Press the ``Enter`` key to finish renaming the notebook.
fr: Appuyez sur la touche ``Entrée`` pour terminer de renommer le notebook.

source: Packages and functions act as the toolbox of Python programming. We will import the ones which will be useful to us.
fr: Les packages et les fonctions agissent comme la boîte à outils de la programmation Python. Nous importerons ceux qui nous seront utiles.

source: In the first cell, type the following code and then run the cell.
fr: Dans la première cellule, tapez le code suivant, puis exécutez la cellule.

source: Run a cell by pressing ``Shift + Enter`` on your keyboard.
fr: Exécutez une cellule en appuyant sur ``Maj + Entrée`` sur votre clavier.

source: ``%matplotlib inline`` allows us to plot graphs and maps
fr: ``% matplotlib inline`` nous permet de tracer des graphiques et des cartes

source: The package ``sys`` is imported to run ``sys.path.append('../Scripts')``, which allows this notebook to access the Python utility functions in the ``Scripts`` folder
fr: Le paquet ``sys`` est importé pour exécuter ``sys.path.append('../ Scripts')``, qui permet à ce notebook d'accéder aux fonctions de l'utilitaire Python dans le dossier ``Scripts``

source: The package ``datacube`` is imported to allow us to create an object that can retrieve data from the datacube, which we will do in the next cell we create
fr: Le package ``datacube`` est importé pour nous permettre de créer un objet capable de récupérer les données du datacube, ce que nous ferons dans la cellule suivante que nous créons

source: From the ``deafrica_plotting`` file in the ``Scripts`` folder, we import the ``rgb`` function, which will allow us to visualise data as true-colour (RGB) images
fr: Depuis le fichier ``deafrica_plotting`` dans le dossier ``Scripts``, nous importons la fonction ``rgb``, qui nous permettra de visualiser les données sous forme d'images en vraies couleurs (RVB)

source: When the cell has finished running, it will show ``[1]`` next to it, and generate a new blank cell below it.
fr: Lorsque la cellule a fini de fonctionner, elle affichera ``[1]`` à côté d'elle et générera une nouvelle cellule vide en dessous.

source: The ``datacube`` package allows us to access the data in the Sandbox. To use it, we must establish a connection with the datacube. Enter the following code and run the cell.
fr: Le package ``datacube`` nous permet d'accéder aux données du Sandbox. Pour l'utiliser, nous devons établir une connexion avec le datacube. Entrez le code suivant et exécutez la cellule.

source: The ``datacube.Datacube`` class provides access to the datacube. We usually call objects of this class ``dc``, as we have done here. The ``app`` parameter is a unique name for the analysis which is based on the notebook file name.
fr: La classe ``datacube.Datacube`` permet d'accéder au datacube. Nous appelons généralement les objets de cette classe ``dc``, comme nous l'avons fait ici. Le paramètre ``app`` est un nom unique pour l'analyse basé sur le nom du fichier notebook.

source: When the cell has finished running, it will show a ``[2]`` next to it, and generate a new blank cell below it.
fr: Lorsque la cellule a fini de fonctionner, elle affichera un ``[2]`` à côté d'elle et générera une nouvelle cellule vide en dessous.

source: This exercise will load Landsat data for an area of Dar es Salaam, Tanzania. We will use a pair of latitude coordinates (-6.90, -6.70) and a pair of longitude coordinates (39.20, 39.37) to specify the area to load. Data will be loaded for the rectangle defined by these coordinate ranges.
fr: Cet exercice chargera les données Landsat pour une zone de Dar es Salaam, en Tanzanie. Nous utiliserons une paire de coordonnées de latitude (-6,90, -6,70) et une paire de coordonnées de longitude (39,20, 39,37) pour spécifier la zone à charger. Les données seront chargées pour le rectangle défini par ces plages de coordonnées.

source: First, we will view this area on a map. This allows us to check we have the correct coordinates. In the new cell below, enter the following code, and then run it to see this area on a map.
fr: Tout d'abord, nous allons visualiser cette zone sur une carte. Cela nous permet de vérifier que nous avons les bonnes coordonnées. Dans la nouvelle cellule ci-dessous, entrez le code suivant, puis exécutez-le pour voir cette zone sur une carte.

source: The output of that cell should look like this.
fr: La sortie de cette cellule devrait ressembler à ceci.

source: In the new cell below, enter the following code, and then run it to load Landsat 8 data.
fr: Dans la nouvelle cellule ci-dessous, entrez le code suivant, puis exécutez-le pour charger les données Landsat 8.

source: We load data with the ``dc.load()`` function. We have chosen to call the loaded dataset ``landsat_ds``. The text between the brackets of ``dc.load()`` are our parameters.
fr: Nous chargeons les données avec la fonction ``dc.load()``. Nous avons choisi d'appeler le jeu de données chargé ``landsat_ds``. Le texte entre les crochets de ``dc.load()`` sont nos paramètres.

source: The ``product`` argument is the datacube product to load data from. We want to access the Landsat 8 dataset, which is named ``ls8_usgs_sr_scene``.
fr: L'argument ``produit`` est le produit du datacube à partir duquel charger les données. Nous voulons accéder à l'ensemble de données Landsat 8, qui est nommé ``ls8_usgs_sr_scene``.

source: The ``x`` and ``y`` arguments specify the area to load data for. In this case, they represent longitude and latitude. This defines a rectangle spanning their ranges of coordinate values as seen in the ``display_map`` output above.
fr: Les arguments ``x`` et ``y`` spécifient la zone pour laquelle charger les données. Dans ce cas, ils représentent la longitude et la latitude. Cela définit un rectangle couvrant leurs plages de valeurs de coordonnées, comme indiqué dans la sortie ``display_map`` ci-dessus.

source: The ``time`` argument specifies the time range of data to load. We have specified all of the year of 2018.
fr: L'argument ``time`` spécifie la plage de temps des données à charger. Nous avons précisé toute l'année 2018.

source: The ``output_crs`` argument specifies the Coordinate Reference System (CRS) to load data in. The CRS ``EPSG:6933`` specifies an equal area projection — each pixel has the same area.
fr: L'argument ``output_crs`` spécifie le système de référence de coordonnées (CRS) dans lequel charger les données. Le CRS ``EPSG: 6933`` spécifie une projection à surface égale - chaque pixel a la même surface.

source: The ``resolution`` argument is the ``y`` and ``x`` resolutions (in that order) in pixels per degree. The first value is typically negative. In this case, a ``resolution`` of ``(-30, 30)`` is a resolution of 30 metres per pixel, which is the maximum resolution of Landsat data.
fr: L'argument ``résolution`` correspond aux résolutions ``y`` et ``x`` (dans cet ordre) en pixels par degré. La première valeur est généralement négative. Dans ce cas, une ``résolution`` de ``(-30, 30)`` est une résolution de 30 mètres par pixel, qui est la résolution maximale des données Landsat.

source: The ``group_by`` argument controls how data that is close in time is combined to provide better images. Specifying a value of ``'solar_day'`` is recommended.
fr: L'argument ``group_by`` contrôle la manière dont les données proches dans le temps sont combinées pour fournir de meilleures images. Il est recommandé de spécifier une valeur de ``'solar_day'``.

source: The ``measurements`` argument specifies what bands will be loaded. We will plot a true-colour image of this data later. To do that, we need the red, green, and blue bands.
fr: L'argument ``mesures`` spécifie quelles bandes seront chargées. Nous tracerons une image en couleurs vraies de ces données plus tard. Pour ce faire, nous avons besoin des bandes rouges, vertes et bleues.

source: Troubleshooting code
fr: Code de dépannage

source: Sometimes, typing mistakes can occur. This will produce an error message when you run the cell.
fr: Parfois, des erreurs de frappe peuvent survenir. Cela produira un message d'erreur lorsque vous exécuterez la cellule.

source: For example, this error is a ``SyntaxError``.
fr: Par exemple, cette erreur est une ``SyntaxError``.

source: It tells us there might be a mistake just before the section of the code ``x=(39.20, 39.39),``. Sure enough, this error message was generated when a comma was missing after the ``product`` parameter, as shown in the screenshot below.
fr: Cela nous indique qu'il pourrait y avoir une erreur juste avant la section du code ``x = (39.20, 39.39),``. Effectivement, ce message d'erreur a été généré lorsqu'une virgule manquait après le paramètre ``produit``, comme indiqué dans la capture d'écran ci-dessous.

source: For illustrative purposes, the point where the comma is missing has been highlighted by a red box, but this will not appear in JupyterLab — you will have to find the error or errors yourself.
fr: À des fins d'illustration, le point où la virgule est manquante a été mis en évidence par une boîte rouge, mais cela n'apparaîtra pas dans JupyterLab - vous devrez trouver l'erreur ou les erreurs vous-même.

source: If errors such as ``IndentationError`` or ``SyntaxError`` appear, they must be resolved before you can continue. Try checking for some of these common issues:
fr: Si des erreurs telles que ``IndentationError`` ou ``SyntaxError`` apparaissent, elles doivent être résolues avant de pouvoir continuer. Essayez de rechercher certains de ces problèmes courants:

source: Are all brackets and quotation marks in the right place?
fr: Tous les crochets et guillemets sont-ils au bon endroit?

source: Does every open bracket have a corresponding close bracket?
fr: Chaque support ouvert a-t-il un support fermé correspondant?

source: Do your bracket types match? ``(`` must be closed by ``)`` and ``[`` with ``]``, and they have different meanings in Python, so they are not interchangeable.
fr: Vos types de supports correspondent-ils? ``(`` doit être fermé par ``)`` et ``[`` avec ``]``, et ils ont des significations différentes en Python, donc ils ne sont pas interchangeables.

source: Does every opening quotation mark have a closing quotation mark? You can use either ``'`` or ``"``, but pairs of quotation marks must be the same.
fr: Chaque guillemet d'ouverture a-t-il un guillemet fermant? Vous pouvez utiliser ``'`` ou ``"``, mais les paires de guillemets doivent être identiques.

source: Are there commas ``,`` between items listed in square brackets ``[]`` or parentheses ``()``?
fr: Y a-t-il des virgules ``,`` entre les éléments indiqués entre crochets ``[]`` ou des parenthèses ``()``?

source: Is the indentation correct? Press ``Tab`` on your keyboard to increase the level of indentation, and press ``Shift + Tab`` on your keyboard to decrease the level of indentation.
fr: L'indentation est-elle correcte? Appuyez sur ``Tab`` sur votre clavier pour augmenter le niveau d'indentation, et appuyez sur ``Maj + Tab`` sur votre clavier pour diminuer le niveau d'indentation.

source: Is everything spelt correctly?
fr: Tout est-il correctement orthographié?

source: Once you have made your changes, try executing the cell again, by pressing ``Shift + Enter`` on your keyboard.
fr: Une fois que vous avez effectué vos modifications, essayez à nouveau d'exécuter la cellule, en appuyant sur ``Maj + Entrée`` sur votre clavier.

source: If you get a ``NameError``, it could be because you have not yet imported the required packages and functions. They must be imported every time you start a new server session.
fr: Si vous obtenez un ``NameError``, cela peut être dû au fait que vous n'avez pas encore importé les packages et les fonctions requis. Ils doivent être importés chaque fois que vous démarrez une nouvelle session serveur.

source: Follow the instructions in the section above on **Load packages and functions**.
fr: Suivez les instructions de la section ci-dessus sur **Charger des packages et des fonctions**.

source: Examine data
fr: Examiner les données

source: When the ``dc.load()`` cell successfully executes, it will create a new cell below it. In this new cell, we can enter the name of our dataset and run the cell. This will show the dataset we loaded.
fr: Lorsque la cellule ``dc.load()`` s'exécute avec succès, elle créera une nouvelle cellule en dessous. Dans cette nouvelle cellule, nous pouvons entrer le nom de notre jeu de données et exécuter la cellule. Cela montrera l'ensemble de données que nous avons chargé.

source: The output of the cell should look similar to this:
fr: La sortie de la cellule doit ressembler à ceci:

source: The output of ``dc.load()`` is an ``xarray.Dataset`` object. This type of dataset is a common format for satellite data, and is organised by:
fr: La sortie de ``dc.load()`` est un objet ``xarray.Dataset``. Ce type de jeu de données est un format courant pour les données satellitaires et est organisé par:

source: **Dimensions:** The dimensions of the dataset. For Earth observation data, this is often ``x`` (longitude), ``y`` (latitude) and ``time``, as seen here. The units for the ``x`` and ``y`` dimensions are pixels, while ``time`` is counted in number of flyovers. In this example we see there were 21 flyovers of our selected location during the year of 2018.
fr: **Dimensions:** Les dimensions de l'ensemble de données. Pour les données d'observation de la Terre, il s'agit souvent de ``x`` (longitude), ``y`` (latitude) et ``time``, comme on le voit ici. Les unités pour les dimensions ``x`` et ``y`` sont des pixels, tandis que le ``time`` est compté en nombre de survols. Dans cet exemple, nous voyons qu'il y a eu 21 survols de notre emplacement sélectionné au cours de l'année 2018.

source: **Coordinates:** A list of the values of each dimension. ``spatial_ref`` refers to the CRS we selected in ``dc.load()``.
fr: **Coordinates:** Une liste des valeurs de chaque dimension. ``spatial_ref`` fait référence au CRS que nous avons sélectionné dans ``dc.load()``.

source: **Data variables:** The data values for our chosen measurements. We see ``red``, ``green`` and ``blue`` are loaded as we specified in the ``dc.load()`` command. This product provides values for surface reflectance, which is unitless.
fr: **Data variables:** Les valeurs de données pour nos mesures choisies. Nous voyons que ``red``, ``green`` et ``blue`` sont chargés comme nous l'avons spécifié dans la commande ``dc.load()``. Ce produit fournit des valeurs de réflectance de surface, qui est sans unité.

source: **Attributes:** Metadata about this dataset. The CRS is listed again.
fr: **Attributes:** Métadonnées sur cet ensemble de données. Le CRS est de nouveau répertorié.

source: Plot a true-colour image
fr: Tracez une image en couleurs vraies

source: True-colour images are also known as red-green-blue (RGB) images. They are rendered using the image’s ‘natural’ colours and appear how they might be seen by the human eye. As we loaded red, green and blue bands from Landsat 8, we can now plot an RGB image using the data from ``landsat_ds``.
fr: Les images en couleurs vraies sont également appelées images rouge-vert-bleu (RVB). Ils sont rendus en utilisant les couleurs «naturelles» de l’image et apparaissent comme ils pourraient être vus par l’œil humain. Comme nous avons chargé les bandes rouges, vertes et bleues de Landsat 8, nous pouvons maintenant tracer une image RVB en utilisant les données de ``landsat_ds``.

source: In the next blank cell, enter the following code. Run the cell to generate an RGB image.
fr: Dans la cellule vide suivante, entrez le code suivant. Exécutez la cellule pour générer une image RVB.

source: The function used here is called ``rgb()``.
fr: La fonction utilisée ici s'appelle ``rgb()``.

source: The first item inside the ``rgb()`` brackets is the name of the dataset we are drawing the data from. In this case, we want to pull information from ``landsat_ds``.
fr: Le premier élément entre les crochets ``rgb()`` est le nom de l'ensemble de données dont nous tirons les données. Dans ce cas, nous voulons extraire des informations de ``landsat_ds``.

source: ``bands`` specifies the name of the data variables in the dataset that correspond to red, green and blue. We saw above that in ``landsat_ds`` they are conveniently named ``red``, ``green`` and ``blue``.
fr: ``bands`` spécifie le nom des variables de données dans l'ensemble de données qui correspondent au rouge, au vert et au bleu. Nous avons vu ci-dessus que dans ``landsat_ds``, ils sont commodément nommés ``red``, ``green`` et ``blue``.

source: ``index`` refers to the timestep to view. The default is 0. The Python language counts from 0, so ``index=0`` shows the first flyover, and ``index=1`` the second.
fr: ``index`` fait référence au pas de temps à afficher. La valeur par défaut est 0. Le langage Python compte à partir de 0, donc ``index = 0`` affiche le premier survol et ``index = 1`` le second.

source: ``size`` is the height of the image.
fr: ``size`` est la hauteur de l'image.

source: The RGB image will look like this:
fr: L'image RVB ressemblera à ceci:

source: The title of the image notes that the date for this data is ``2018-02-16``, or 16 February 2018.
fr: Le titre de l'image indique que la date de ces données est ``2018-02-16``, ou 16 février 2018.

source: Exercise: Load and plot Sentinel-2 data
fr: Exercice: charger et tracer les données Sentinel-2

source: Let us repeat the data loading process for Sentinel-2 data. It is a very similar process to loading the Landsat 8 data. We want to load data for the same time and place, so we only have to change the ``product`` and ``resolution``.
fr: Répétons le processus de chargement des données pour les données Sentinel-2. C'est un processus très similaire au chargement des données Landsat 8. Nous voulons charger les données au même moment et au même endroit, nous n'avons donc qu'à changer le ``product`` et la ``resolution``.

source: Let us call our Sentinel-2 dataset ``sentinel_2_ds``. You must name it something different from the Landsat 8 dataset. In a new cell, type the name of the Sentinel-2 dataset.
fr: Appelons notre jeu de données Sentinel-2 ``sentinel_2_ds``. Vous devez lui donner un nom différent de l'ensemble de données Landsat 8. Dans une nouvelle cellule, saisissez le nom de l'ensemble de données Sentinel-2.

source: |Sentinel-2 dataset|
fr: | Ensemble de données Sentinel-2 |

source: Again, we will use ``dc.load()`` to import Sentinel-2 data. After ``sentinel_2_ds``, type ``= dc.load()``. It should look like ``sentinel_2_ds = dc.load()``.
fr: Encore une fois, nous utiliserons ``dc.load()`` pour importer les données Sentinel-2. Après ``sentinel_2_ds``, tapez ``= dc.load()``. Cela devrait ressembler à ``sentinel_2_ds = dc.load()``.

source: How do we fill out the parameters inside the brackets of ``dc.load()``? We can do this by copying some of the information from the Landsat 8 ``dc.load()`` input cell. The first parameter we listed before was ``product``. However, we don’t want to use the Landsat 8 product, we want to select the Sentinel-2 product, ``s2_l2a``.
fr: Comment remplir les paramètres entre crochets de ``dc.load()``? Nous pouvons le faire en copiant certaines des informations de la cellule d'entrée Landsat 8 ``dc.load()``. Le premier paramètre que nous avons répertorié auparavant était ``product``. Cependant, nous ne voulons pas utiliser le produit Landsat 8, nous voulons sélectionner le produit Sentinel-2, ``s2_l2a``.

source: |Sentinel-2 dataset product|
fr: | Produit de l'ensemble de données Sentinel-2 |

source: ``s2_l2a`` stands for **S**\ entinel-**2** **L**\evel-**2A**. The fourth character is a lower-case alphabet 'l'. Double-check you have entered the product name correctly to avoid errors.
fr: ``s2_l2a`` signifie **S** \ entinel-**2** **L**\evel-**2A**. Le quatrième caractère est un alphabet minuscule «l». Vérifiez que vous avez correctement saisi le nom du produit pour éviter les erreurs.

source: The ``resolution`` parameter will also be different from the Landsat 8 load. For Sentinel-2, it should be ``(-10,10)``, since our Sentinel-2 data has a resolution of 10 metres per pixel.
fr: Le paramètre ``resolution`` sera également différent de la charge Landsat 8. Pour Sentinel-2, cela devrait être ``(-10,10)``, car nos données Sentinel-2 ont une résolution de 10 mètres par pixel.

source: |Sentinel-2 dataset resolution|
fr: |Résolution du jeu de données Sentinel-2|

source: Now, type the rest of the parameters to be the same as they were for the Landsat 8 load. This includes:
fr: Maintenant, saisissez le reste des paramètres pour qu'ils soient les mêmes que pour la charge Landsat 8. Ceci comprend:

source: As before, watch out for commas, quotation marks, and brackets to avoid error messages when running the cell.
fr: Comme auparavant, faites attention aux virgules, guillemets et crochets pour éviter les messages d'erreur lors de l'exécution de la cellule.
